{
    "abstract": "The continuous development trend of expressways urgently needs expressway sensing, which is required to be able to perceive unknown risk factors to ensure a safe and stable transportation environment as well as effectively and continuously monitor the safe operation of expressways. Using unconscious payment can greatly improve traffic efficiency and meet the development direction of intelligent tr...",
    "articleNumber": "9973308",
    "articleTitle": "Sofware-Defined Space-Ground-Vehicle Integrated Network Architecture for Unconscious Payment",
    "authors": [
        {
            "preferredName": "Lianlian Zhang",
            "normalizedName": "L. Zhang",
            "firstName": "Lianlian",
            "lastName": "Zhang",
            "searchablePreferredName": "Lianlian Zhang"
        },
        {
            "preferredName": "Feng Liu",
            "normalizedName": "F. Liu",
            "firstName": "Feng",
            "lastName": "Liu",
            "searchablePreferredName": "Feng Liu"
        },
        {
            "preferredName": "Jie Sun",
            "normalizedName": "J. Sun",
            "firstName": "Jie",
            "lastName": "Sun",
            "searchablePreferredName": "Jie Sun"
        }
    ],
    "doi": "10.1109/ACCESS.2022.3227396",
    "publicationTitle": "IEEE Access",
    "publicationYear": "2022",
    "publicationVolume": null,
    "publicationIssue": null,
    "volume": "10",
    "issue": null,
    "documentLink": "/document/9973308/",
    "xml": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<div id=\"BodyWrapper\" class=\"ArticlePage\" xmlns:ieee=\"http://www.ieeexplore.ieee.org\"><div id=\"article\">\n<div class=\"section\" id=\"sec1\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION I.</div><h2>Introduction</h2></div><p>In recent years, China’s economy has been developing rapidly and urbanization is accelerating, in addition to the number of automobiles increasing annually. According to the Traffic Administration Bureau of the Ministry of Public Security data, the number of civilian automobiles in China reached 270 million by 2020; of these, 240 million are private cars. The number of motor vehicles nationwide is growing rapidly, with 24 million newly registered <a ref-type=\"bibr\" anchor=\"ref1\" id=\"context_ref_1_1\">[1]</a>. Meanwhile, the construction of expressways has brought great convenience to people’s travel. By the end of 2020, the total mileage of expressways in China reached 5.19 million kilometers, ranking first in the World <a ref-type=\"bibr\" anchor=\"ref1\" id=\"context_ref_1_1\">[1]</a>. With the emergence of advanced vehicle applications, the challenge of meeting communication and computing needs is becoming increasingly prominent in vehicle network.</p><p>The traditional method of expressway toll collection in China is not flexible, accurate, or intelligent <a ref-type=\"bibr\" anchor=\"ref2\" id=\"context_ref_2_1\">[2]</a>; cash payers must queue up to obtain a card as well as to pay the fees, and the procedures are cumbersome, easily cause congestion, and fees can be easily avoided. In electronic toll collection (ETC), queueing for cards and fees is not needed, but on-board-unit (OBU) installation is cumbersome, installation fees are required, and penetration rates are low. Therefore, this is an important task in expressway construction and operation to realize the payment mode of automatic, senseless, accurate billing and accurate splitting. At present, vehicle path recognition <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_1\">[3]</a> primarily includes video license plate recognition, 433 million active radio-frequency identifications (RFIDs), and 5.8 Gbytes of active RFIDs <a ref-type=\"bibr\" anchor=\"ref4\" id=\"context_ref_4_1\">[4]</a>. The existing identification system has many disadvantages, e.g., the number of detection sensors deployed is limited, and blind spots exist throughout the entire road-section monitoring network. These persistent problems must be solved to ensure effective and sustainable monitoring of expressway safety operation, so as to facilitate users to pay in advance or at the exit toll stations through mobile phones or other handheld terminal devices, thus greatly improving traffic efficiency and meeting the development direction of intelligent transportation.</p><p>Transmission-line sensing can effectively solve the above problems. From the application perspective, sensing applications with different needs should be realized in an economical and flexible way. However, independent ground-sensor networks cannot meet the needs of developing applications. First, the ground-sensing platform and network coverage of roads and rural mountainous areas are poor <a ref-type=\"bibr\" anchor=\"ref5\" id=\"context_ref_5_1\">[5]</a> because the cost of deploying physical entities in sparsely populated areas is large. The aeronautical communication system has the advantages of wide coverage and can provide effective sensing and detection for transmission lines <a ref-type=\"bibr\" anchor=\"ref6\" id=\"context_ref_6_1\">[6]</a>, <a ref-type=\"bibr\" anchor=\"ref7\" id=\"context_ref_7_1\">[7]</a>. In addition, it is also necessary to monitor expressway traffic flow in terms of factors such as its location, congestion degree, and speed. Sensory information cannot be obtained only through ground sensors, and must be obtained through the combination of sensing platforms integrating space, ground, and vehicles.</p><p>Therefore, this paper proposes a three-layer network architecture based on SDN and NFV, including the sensor layer, the transport layer, and the computing layer. The following contributions are made in this paper. \n<ul style=\"list-style-type:disc\"><li><p>To the best of our knowledge, we are the first researchers to put forward a solution to the problems of expressway sensing based on a space-ground-vehicle integrated network, to report our research status and solving of the aforementioned problems in the development of sensing systems, and to show the prominent development trends in related fields.</p></li><li><p>We propose an integrated network architecture of a software-defined space-ground-vehicle network architecture called a SD-SGVIN, for which the expressway services provided by various infrastructure components are designed. We also analyze the problems existing in expressway sensing and put forward the corresponding solutions.</p></li><li><p>We compare the current sensing architecture through simulation. Results show that the SD-SGVIN architecture can significantly reduce the maximum traffic load and improve application coverage.</p></li></ul></p><p>The rest of this paper is organized as follows. First, we introduce the SD-SGVIN architecture followed by system design. Next, we demonstrate the advantages of the SD-SGVIN through performance analysis, which are then summarized.</p></div>\n<div class=\"section\" id=\"sec2\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION II.</div><h2>State of the Art and Challenges</h2></div><div class=\"section_2\" id=\"sec2a\"><h3>A. Defects of Traditional Unconscious Payment</h3><p>Unconscious payment has only recently introduced in pilot initiatives on expressways, and some defects exist, the correction of which can effectively promote the wider application of unconscious payment.</p><div class=\"section_2\" id=\"sec2a1\"><h4>1) Failure to Communicate Across the Country</h4><p>At present, unconscious payment has not yet been made into a complete ecosystem, and the data between various manufacturers cannot be interconnected. To facilitate unconscious payment on expressways in various provinces and cities, different apps must be downloaded, without which drivers cannot obtain a continuous and complete experience. The establishment of a network-interconnected unconscious payment network communication system can effectively solve the above problems.</p></div><div class=\"section_2\" id=\"sec2a2\"><h4>2) Risks Related to License Plates</h4><p>Unconscious payment is keyed by a vehicle’s license plate, and deduction errors occur to license plate recognition issues or artificial risks. Of course, the probability of these errors occurring is very low. Tracking a vehicle route throughout the entire process to avoid fee evasion is also an important problem.</p></div><div class=\"section_2\" id=\"sec2a3\"><h4>3) Signal Problems</h4><p>Signal problems occur in expressway toll stations with poor signal strength, network-coverage blind spots, and at locations in sparsely populated areas. In these areas, the signal is unstable, which will also lead to deduction errors.</p></div><div class=\"section_2\" id=\"sec2a4\"><h4>4) Vehicle Routing Problems</h4><p>At present, unconscious payment systems cannot accurately know the driving route of vehicles, and cannot perform path identification, which cannot help high-speed operation companies accurately split tolls. With the cancellation of provincial toll stations in the future, provincial road networks will be connected uniformly, and the path problem will become more prominent.</p><p>To solve the vehicle routing problem, it is necessary to install antennas, microwave sensors, cameras, and other sensing systems on the expressway portal frame, and then combine these with the spatial sensor platform to obtain sensing information.</p></div></div><div class=\"section_2\" id=\"sec2b\"><h3>B. Expressway Sensing: the State-Of-The-Art</h3><p>In the relevant literature, vehicle network cannot solve the problems of unconscious payment. Chen proposed a novel energy-efficient algorithm to achieve reliable timing-message synchronization in distributed large-scale VANETs <a ref-type=\"bibr\" anchor=\"ref8\" id=\"context_ref_8_2b\">[8]</a>. Tian presented an innovative network selection solution for the fundamental technological requirement of multi-mode communications in heterogeneous vehicular telematics <a ref-type=\"bibr\" anchor=\"ref9\" id=\"context_ref_9_2b\">[9]</a>. Ahmad introduced a future emerging technology called vehicular cloud networking <a ref-type=\"bibr\" anchor=\"ref10\" id=\"context_ref_10_2b\">[10]</a>.</p><p>The vehicle networking model based on the air-space integration network extends the two-dimensional plane of the traditional road network to three-dimensional space. With the acceleration of the process of space-space integration, the U.S. National Aeronautics and Space Administration (NASA) has, in particular, established a space communication and navigation (SCAN) office to provide information on its space communication and navigation infrastructure; this included the near Earth network (NEN) <a ref-type=\"bibr\" anchor=\"ref11\" id=\"context_ref_11_2b\">[11]</a>, space network (SN) <a ref-type=\"bibr\" anchor=\"ref12\" id=\"context_ref_12_2b\">[12]</a>, and deep-space network (DSN) <a ref-type=\"bibr\" anchor=\"ref13\" id=\"context_ref_13_2b\">[13]</a>, carried out unified management and system integration, and began to build an integrated network for SCAN.</p><p>However, the network infrastructure of a space and terrestrial integrated network is very complex, including many different facilities (i.e., aerostat, tracking, and satellite) and different wireless links (i.e. narrowband, telemetry, and command, tracking). In the space and terrestrial integrated network, the topology changes in real time and the link may be interrupted at any moment <a ref-type=\"bibr\" anchor=\"ref14\" id=\"context_ref_14_2b\">[14]</a>. Therefore, reliable transmission is difficult, and requires us to design a space and terrestrial integrated network to ensure sustainable development and meet the needs of various applications.</p><p>The software-defined network (SDN) <a ref-type=\"bibr\" anchor=\"ref15\" id=\"context_ref_15_2b\">[15]</a> is a a network architecture proposed in 2006, the design concept of which is to separate the network control plane from the data forwarding plane to realize the programmable control of the underlying hardware through the software platform in the centralized controller, and realize flexible on-demand allocation of network resources. Several related papers have applied an SDN to a vehicle network. Oubbati et al. <a ref-type=\"bibr\" anchor=\"ref16\" id=\"context_ref_16_2b\">[16]</a> proposed a SDN-enabled approach for vehicle path planning. Jb et al. <a ref-type=\"bibr\" anchor=\"ref17\" id=\"context_ref_17_2b\">[17]</a> applied a SDN to real-time urban traffic analysis in a VANET environment. Network function virtualization (NFV) <a ref-type=\"bibr\" anchor=\"ref18\" id=\"context_ref_18_2b\">[18]</a> uses general hardware platform to replace traditional special communication equipment to deploy network functions and services, separates hardware equipment from network functions, completes the instantiation of virtual functions on general service nodes, and realizes the decoupling of upper software functions and lower hardware devices. Inspired by SDN and NFV, Qi et al. <a ref-type=\"bibr\" anchor=\"ref19\" id=\"context_ref_19_2b\">[19]</a> presented a SDN-enabled social-aware clustering algorithm in the 5G-VANET system. Liu et al. <a ref-type=\"bibr\" anchor=\"ref20\" id=\"context_ref_20_2b\">[20]</a> proposed a software-defined Internet-of-Things (IoT) architecture for smart urban sensing in which a SDN is applied to data sensing. Liu et al. <a ref-type=\"bibr\" anchor=\"ref21\" id=\"context_ref_21_2b\">[21]</a> applied an SDN to a vehicular ad hoc network, separated the control and data communication layers to simplifythe network management and expedite system evolution; Bertaux et al. <a ref-type=\"bibr\" anchor=\"ref22\" id=\"context_ref_22_2b\">[22]</a> applied SDN and NFV to satellite networks. An SDN is applied to satellite networks in <a ref-type=\"bibr\" anchor=\"ref23\" id=\"context_ref_23_2b\">[23]</a> and <a ref-type=\"bibr\" anchor=\"ref24\" id=\"context_ref_24_2b\">[24]</a>.</p><p>Therefore, in the present paper we propose a soft- ware-defined space-ground-vehicle integrated network (SD-SGVIN) communication architecture. Based on a SDN, the control logic is separated from the data-layer equipment, and the logically centralized controller is used to control the equipment through the standard interface. Virtual functions with specific functions can be installed or uninstalled at any service node in the network. When resources are sufficient, multiple virtual functions can be deployed in the same general hardware device to realize the sharing of computing, storage, and other resources, significantly improving resource utilization.</p><p>The SD-SGVIN consists of three parts, including cloud-computing storage (e.g., a data center), communication device (e.g., network nodes), and a sensor platform. Among these, the sensor platform includes vehicles, road portal, toll station entrances and exits, and sensors carried by space equipment. This is responsible for obtaining vehicle-related information, such as speed and location. The network node is responsible for forwarding sensor data and the cloud server for processing and storing vehicle data. Each service function chain carrying the sensing data flow is then set up. Furthermore, the server API completes the functions of data acquisition, transmission, and processing. Accordingly, the underlying physical devices are shielded and can share the infrastructure, so the cost is reduced and the deployment of new applications simplified.</p><p>Therefore, SD-SGVIN can effectively support various application requirements and improve the efficiency of intelligent expressway communication.</p></div><div class=\"section_2\" id=\"sec2c\"><h3>C. Trends</h3><p>With the increasing number of vehicles and applications, the expressway network has broad application and development prospects, but the current network architecture has the problems of low resource utilization, low network coverage, and poor flexibility. Therefore, we need to design a better Internet architecture to overcome these issues.</p><div class=\"section_2\" id=\"sec2c1\"><h4>1) Intelligent Demand</h4><p>The development of computer, automation, sensors, and other related technologies promotes the intellectualization of expressway network systems <a ref-type=\"bibr\" anchor=\"ref25\" id=\"context_ref_25_2c1\">[25]</a>. Intelligent and efficient unconscious payment technology is an important embodiment of the intelligent development of expressway networks.</p></div><div class=\"section_2\" id=\"sec2c2\"><h4>2) Software-Defined Network</h4><p>At present, some limitations exist in the expressway network. Each regional networking system is independent; therefore, complete regional networking cannot be realized. The SDN has the characteristics of programmable and flexible network architecture, which makes it an important topic of research for researchers in wired network management and heterogeneous wireless communication <a ref-type=\"bibr\" anchor=\"ref26\" id=\"context_ref_26_2c2\">[26]</a>, <a ref-type=\"bibr\" anchor=\"ref27\" id=\"context_ref_27_2c2\">[27]</a>. The vehicle network based on the SDN can adapt to the real-time change of topology by modifying the data forwarding rules in the network. In a vehicle network, applications have different delay, propagation, and bandwidth requirements. An SDN supports the heterogeneity of interfaces in the vehicle communication architecture, so as to achieve better computing performance, expanded storage, and improved overall performance at a lower cost. The SDN controller can effectively select different interfaces for different tasks. In the SD-SGVIN, the SDN can flexibly control and manage complex infrastructure.</p></div><div class=\"section_2\" id=\"sec2c3\"><h4>3) Application of NFV</h4><p>NFV converts traditional network functions into software running on general hardware through virtualization technology <a ref-type=\"bibr\" anchor=\"ref16\" id=\"context_ref_16_2c3\">[16]</a>. The traffic processed/forwarded by traditional network functions comes from the physical network interface controller. The indivisible hardware structure leads to poor network function scalability and dependence on special equipment. In an NFV network, combined with emerging SDN technology <a ref-type=\"bibr\" anchor=\"ref28\" id=\"context_ref_28_2c3\">[28]</a>, the virtual network function can be deployed in any virtual machine without being limited by physical configuration and geographical location. Using NFV to realize the processing of sensing data in the SD-SGVIN can make the transmission of expressway sensing information more efficient.</p></div><div class=\"section_2\" id=\"sec2c4\"><h4>4) Openness</h4><p>The openness of the expressway network system can ensure the realization of information sharing, and can provide the information of vehicles, road conditions, traffic flow, road-section environment, and other information to the departments in need. Therefore, the development of the system is essential for the development of the expressway network.</p><p>Although technical problems may continue to arise, with the in-depth promotion of unconscious payment, it could get easier to solve these problems. In this paper, we implemented expressway sensing with the SD-SGVIN. First, we proposed using SD-SGVIN architecture in service design. Then, we analyzed the unresolved problems and their possible solutions in the implementation of expressway sensing.</p></div></div></div>\n<div class=\"section\" id=\"sec3\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION III.</div><h2>SD-SGVIN: Architecture Overvoew and System Design</h2></div><div class=\"section_2\" id=\"sec3a\"><h3>A. Architecture Overview</h3><p><a ref-type=\"fig\" anchor=\"fig1\" class=\"fulltext-link\">Figure 1</a> shows the proposed sensing, transmission, and processing architecture of the SD-SGVIN, which includes three layers, Figure1.(b) shows the connection between the three layers, the sensor platforms namely fhysical facility layer which mainly completes the task of information acquisition, transmission network, that is, the logic control layer, completes the task of transmitting information, and data center implements information processing and application.\n<div class=\"figure figure-full\" id=\"fig1\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973308/liu1ab-3227396-large.gif\" data-fig-id=\"fig1\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973308/liu1ab-3227396-small.gif\" alt=\"FIGURE 1. - Scene introduction: (a) Typical application scenarios; (b) space-ground-vehicle integrated network communication architecture.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 1. </b><fig><p>Scene introduction: (a) Typical application scenarios; (b) space-ground-vehicle integrated network communication architecture.</p></fig></div><p class=\"links\"><a href=\"/document/9973308/all-figures\" class=\"all\">Show All</a></p></div></p><div class=\"section_2\" id=\"sec3a1\"><h4>1) Physical Facility Layer</h4><p>The physical facility layer mainly includes the following physical devices: sensor platform, network node, and processing and storage node. The sensor platform completes the data acquisition function, and its nodes include expressway gantry, vehicle, toll station, and aviation sensing platforms. Network nodes complete data transmission function, and its nodes include unmanned aerial vehicles (UAVs), airships, satellites (Tracking and Data RelaySatellite System,TSRSS), ground stations, and switches/routers. Processing and storage nodes complete data analysis and the storage function, and their nodes include vehicles, roadside facilities, and cloud servers.</p><p>Based on traditional network nodes, we added aerial nodes such as aviation sensing platforms, UAVs, airships, and remote sensing satellites, which can effectively solve the signal problems in remote areas, improve the network coverage, and promote the interconnection of national highway networks.</p><p>These devices have basic capabilities and can perceive the environment of expressway transmission networks, transmit data between nodes through the control instructions given by the control layer, and extract information from them. Their main functions are to detect and collect the traffic information of network nodes and surrounding traffic information, including road traffic conditions, vehicle speed, location information, weather conditions, and other data, to facilitate driver-less control and intelligent traffic control.</p></div><div class=\"section_2\" id=\"sec3a2\"><h4>2) Logic Control Layer</h4><p>There are many types of physical infrastructure layer nodes and various network structures. Different highway applications also have different network requirements. Therefore, the control layer is introduced to connect the infrastructure layer and applications. This layer manages physical entities through the south interface and provides various services to applications through the north. The main function of this layer is to connect the vehicle terminal to the Internet through the transmission protocol to ensure reliable data transmission. It also allows the vehicle network to communicate with various heterogeneous networks, realize remote control of physical infrastructure, and obtain information for the application layer.</p></div><div class=\"section_2\" id=\"sec3a3\"><h4>3) Application Layer</h4><p>The application layer includes an application data service and interaction interface. By processing the data in the vehicle network, the service is provided to individual, enterprise, and government applications. The devices in the application layer are large-scale network servers. The process of vehicle data acquisition, transmission, processing, and storage can be preset; thus, there is no need to change the configuration in the physical entity. By sharing the physical infrastructure, the overhead can be greatly reduced.</p></div></div><div class=\"section_2\" id=\"sec3b\"><h3>B. System Design</h3><p>There are many kinds of expressway network sensing applications with different network requirements. The delay requirement of vehicle network automatic driving control given by 3GPP is 10 ms. There are few pieces of key vehicle monitoring and bridge monitoring data, and the real-time requirements are low. The real-time entertainment interaction needs large bandwidth. The demand of unconscious payment for the network has time-sharing characteristics, with large traffic flow during holidays and daytime and small traffic flow at night. At the same time, it has high real-time requirements to avoid expressway entrance and exit congestion caused by high delay. According to different business requirements, we have designed the system as detailed in the following subsections.</p><div class=\"section_2\" id=\"sec3b1\"><h4>1) Data Acquisition</h4><p>Data acquisition provides the initial data for applications. There are a variety of sensing platforms in the space-ground-vehicle integrated network, and there are many types of data obtained, such as video sensing data, traffic operation sensing data, meteorological environment sensing data, expressway basic road network data, asset data, charging data, and service area data. There are both general and special platform sensors. Multi-spectral remote sensors can only be deployed on the aerial sensing platform, which belongs to the category of special platform sensors. They can be applied to all speed sensors of the platform. These sensor platforms can be required by multiple applications, so the control layer needs to automatically configure the sensor platform to obtain data. The sensor controller must know specific information, including the position, function, and status of each sensor in all sensor platforms. For example, the unconscious payment application requires vehicle traffic data, including vehicle entrance, exit, and passage path. The application can also require other relevant information, such as in-transit vehicles, traffic statistics, and vehicle speed statistics. Moreover, applications can query other data according to characters, such as data type, location, and time of data generation. The addition of an aerial sensing platform effectively improves the coverage of the entire sensing platform, and can more comprehensively monitor vehicle path. Combined with the vehicle-path recognition system, path recognition errors can be avoided.</p></div><div class=\"section_2\" id=\"sec3b2\"><h4>2) Data Transmission Service</h4><p>The high mobility of vehicles and space nodes is one of the reasons that the network is frequently disconnected. When the vehicle and space nodes are moving at high speed, the parameters of the network communication link (such as delay, bandwidth, and noise) changes, resulting in the decline of the service quality of the application. Therefore, when using an SDN and NFV, mobility management technology is adopted. Vehicles can use this technology to access applications without connection interruption, so as to provide guarantee for the application of various network services. To ensure the accurate transmission of information, the network transmission protocol system of space nodes adopts the protocol cluster space communication protocol standards (SCPSs) that have been specially designed and developed by NASA’s Jet Propulsion Laboratory and the Consultative Committee for Space Data Systems (CCSDS) to solve a series of space channel problems and provide reliable space data communication <a ref-type=\"bibr\" anchor=\"ref29\" id=\"context_ref_29_3b2\">[29]</a>.</p><p>Aiming at the problem of high delay, mobile edge computing (MEC) <a ref-type=\"bibr\" anchor=\"ref30\" id=\"context_ref_30_3b2\">[30]</a> has been introduced into the network. MEC has the advantages of customizable and schedulable business logic, low delay of Big Data transmission, high security, open standards, self-organization, and autonomy of computing nodes. Delay-tolerant and ultra-dense data computing tasks are retained in the central cloud for execution, and low-delay and high-reliability control optimization computing tasks are carried out in the servers of multiple connected roadside nodes.The service is transferred from the core network to the edge cloud for processing, so that the application data are closer to the vehicle, thus reducing the round-trip time required to process the data. The edge server senses and collects roadside information from vehicles or roadside units, analyzes and processes it, and can transmit time-delay-sensitive information to other vehicles in the area in a timely manner.</p></div><div class=\"section_2\" id=\"sec3b3\"><h4>3) Data Processing Services</h4><p>After the sensor obtains the data, it must analyze and process it. This part of the work was completed by the resources provided by the cloud processing service model. By providing data processing service application programming interfaces (APIs) and cloud controllers, the controller allows applications to use specified required resources, such as software functions, virtual machine platforms, and operating platforms. At the same time, it completes the function of mapping the resources required by the application to the server resource pool.</p><p>The cloud server for unconscious payment mainly performs the following functions: user and vehicle registration audit, path restoration, online billing, flow saving, online reconciliation, information push, data statistics, and analysis. All of these functions require powerful storage and processing power. The image recognition function monitors the vehicle path information, first stores the received sensor data, and then analyzes the data using relevant programs, judges the vehicle running state, determines path information, and stores photos. This process requires an image recognition function and storage system. The application responsible for whole road network slope position monitoring must monitor the real-time passing vehicle conditions and events of the slope; this requires a significant amount of video storage and analysis and calculation resources, and must be provided by the cloud processing server. The event monitoring and early warning application must conduct statistical analysis of events and early warning of prone sections to assist in decision-making. Therefore, cloud storage, cloud processing, and visualization software are needed.</p></div></div></div>\n<div class=\"section\" id=\"sec4\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION IV.</div><h2>Case Study and Performance Analysis</h2></div><div class=\"section_2\" id=\"sec4a\"><h3>A. Scene Introduction</h3><p>We simulated the test scenario in <a ref-type=\"fig\" anchor=\"fig2\" class=\"fulltext-link\">Fig. 2</a> in MatLab software (MathWorks, USA) to illustrate the advantages of the SD-SGVIN. The simulation test area was composed of expressway traffic network areas. The sensor platform included roadside, vehicle, and aerial sensor platforms. The general sensors can be selectively deployed on expressway facilities (gantries/toll stations), vehicle nodes, and aerial nodes. We considered the following common expressway sensing applications: traffic situation, geological disaster, accurate meteorological, key vehicle, and bridge monitoring. One or no sensor platforms were randomly deployed for each ground facility and rectangle.\n<div class=\"figure figure-full\" id=\"fig2\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973308/liu2-3227396-large.gif\" data-fig-id=\"fig2\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973308/liu2-3227396-small.gif\" alt=\"FIGURE 2. - Selected scenario.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 2. </b><fig><p>Selected scenario.</p></fig></div><p class=\"links\"><a href=\"/document/9973308/all-figures\" class=\"all\">Show All</a></p></div></p><p>As shown in <a ref-type=\"fig\" anchor=\"fig3\" class=\"fulltext-link\">Fig. 3(b)</a>, in a specific rectangular area the occurrence probability of roadside nodes, high-speed vehicles, and aviation nodes is constant. In our simulation, the deployment probabilities of vehicles, roadside nodes, and aviation nodes were set to 01, 0.01, and 0.001, respectively. The vehicle, roadside, and air sensor platform coverages were set to 1, 20, and 200 rectangles, respectively.\n<div class=\"figure figure-full\" id=\"fig3\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973308/liu3abc-3227396-large.gif\" data-fig-id=\"fig3\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973308/liu3abc-3227396-small.gif\" alt=\"FIGURE 3. - Scenario parameters: (a) data rate of each sensor; (b) sensor platform deployment; (c) relative sampling rate.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 3. </b><fig><p>Scenario parameters: (a) data rate of each sensor; (b) sensor platform deployment; (c) relative sampling rate.</p></fig></div><p class=\"links\"><a href=\"/document/9973308/all-figures\" class=\"all\">Show All</a></p></div></p><p>In addition, the SD-SGVIN is connected to the data center through forwarding equipment. <a ref-type=\"fig\" anchor=\"fig3\" class=\"fulltext-link\">Figure 3(a)</a> shows the data rate, which contains the amount of data processed by the application over time. After obtaining the data, data storage, data processing, and processing of other content are completed by aerial measurement platform, image recognition device, and virtual machine, respectively.</p></div><div class=\"section_2\" id=\"sec4b\"><h3>B. Performance Analysis</h3><div class=\"section_2\" id=\"sec4b1\"><h4>1) Data Simulation</h4><p>We considered four random cases to verify the advantages of the SD-SGVIN. In each deployment case, various sensor platforms can carry a stochastic number of sensors in the sensor group.</p><p>For example, as shown in <a ref-type=\"fig\" anchor=\"fig2\" class=\"fulltext-link\">Fig. 2</a>, the vehicle sensor node randomly selects a group of sensors, such as an acceleration sensor ETC, and global positioning system. Sensors are deployed on various platforms according to application requirements, and multiple sensors are embedded on the platform for shared using multiple applications. For each sensor deployment scheme and different rectangular areas, the expressway ground, vehicle, and aerial nodes will randomly select the sensor platform to be deployed. For the three sensor platforms, we randomly generated five applications that can randomly select sensors from the platform-sensor group to meet the requirements. The average coverage is calculated by the area covered by the sensor platform to the entire area of the expressway traffic network to be detected.</p><p>As shown in <a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">Fig. 4</a>, the average coverage rate of the five applications under different sensor platforms is different. For example, in <a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">Fig. 4(a)</a> the coverage of application case 1 of the expressway vehicle sensor platform in four deployment cases (1 through 4) is 0.1346, 0.2372, 0.1418, and 0.1412, respectively. Compared with the other three cases, the average coverage of application case 2 is significantly higher; this is because application case 2 uses SD-SGVIN technology, and one sensor can serve multiple applications, and multiple sensors can be deployed on the same sensor platform. The ratio of coverage of application case 1 is 77.3% higher than that of traditional sensing methods.\n<div class=\"figure figure-full\" id=\"fig4\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973308/liu4abcd-3227396-large.gif\" data-fig-id=\"fig4\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973308/liu4abcd-3227396-small.gif\" alt=\"FIGURE 4. - Performance analysis results: (a)-(c) Coverage ratios with vehicle sensor platforms; (d) maximum link load.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 4. </b><fig><p>Performance analysis results: (a)-(c) Coverage ratios with vehicle sensor platforms; (d) maximum link load.</p></fig></div><p class=\"links\"><a href=\"/document/9973308/all-figures\" class=\"all\">Show All</a></p></div></p><p>The average coverage ratio of the four aforementioned cases with SD-SGVIN architecture is 0.12848, 0.23656, 0.13212, and 0.1292, respectively. If more sensors are installed in the platform, the coverage will be better. As shown in <a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">Figs. 4(a)</a>–<a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">4(c)</a>, even in the same deployment scenario, different applications have different coverages. In <a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">Fig. 4(a)</a>, the coverage ratios for cases 1–4 are 0.13, 0.17, 0.17, 0.09, and 0.08, respectively.</p><p>The overall average coverage ratio of the five applications in application case 1 is 0.16, 0.19, 0.21, 0.12, and 0.10, respectively, which is consistent with application case 1. This shows that the coverage depends on the number and universality of corresponding sensors. Compared to <a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">Figs. 4(a)</a>–<a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">4(c)</a>, the average coverage of the aerial sensor platform is better than that of the roadside sensor platform, and the roadside sensor platform’s coverage is better than that of the vehicle sensor platform.</p><p>Similarly, there is little difference in the coverage of the aerial, roadside, and vehicle sensor platforms; the average coverage ratios are is 0.16, 0.15, and 0.1, respectively. This is because there is a large number of vehicles on the expressway, with a high deployment probability of 0.1, but its coverage is small. The probability of deployment of the aerial sensor platform, however, is very small, i.e., 0.001, but with a large coverage (200). These results show that the communication architecture proposed in this paper can improve the coverage of different applications on different types of sensors compared with the existing sensing architecture.</p></div><div class=\"section_2\" id=\"sec4b2\"><h4>2) Communication Efficiency</h4><p>In <a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">Fig. 4(d)</a>, we show the link load by time periods and applications. The collected vehicle data are sent to the data center for processing through the nearest gateway. The three modes of acquisition and transmission are traditional mode, SD-DA, and the SD-SGVIN.</p><p>Both the traditional and SD-DA modes correspond to the traditional Internet communication architecture, and the shortest path is used for data transmission. The difference is that SD-DA contains changeable configurations. The SD-SGVIN corresponds to the architecture proposed in this paper, and the data transmission is optimized according to the real-time path information.</p><p><a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">Figure 4(d)</a> shows that the attributes of each sensor platform are fixed, the total link data load remains unchanged, and the data load remains at 12,000 in the traditional architecture. SD-DA can choose to change the working state of the sensor by configuring time-sharing or reduce the sampling rate according to the situation. As can be seen from the figure, the maximum link traffic is significantly reduced by 43.75% and 81.25% in idle time (20:00-24:00 and 00:00-06:00, respectively). The software-defined network has the functions of realizing dynamic and global optimization <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_4b2\">[31]</a>, so the SD-SGVIN can migrate traffic from high load link to idle link, which can reduce the maximum link load, so as to reduce the delay. The maximum link load can be reduced throughout the day. In the tested periods (i.e., 6:00-20:00, 20:00-24:00, and 00:00-06:00), the maximum link load was found to have been reduced by 50%, 72%, and 91%, respectively.</p></div></div></div>\n<div class=\"section\" id=\"sec5\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION V.</div><h2>Conclusion</h2></div><p>In this paper, we focus on designing the communication architecture of a software-defined space-ground-vehicle integrated network to support unconscious payment on expressways. We propose a sensing and communication architecture that can separate the application from the physical layer by using SDN and NFV technology. The control layer can flexibly control and manage the physical infrastructure, simplify the application development process, improve the coverage of the sensing platform under certain conditions, and help solve the problem of vehicle payment queue congestion. It also monitors the entire process of vehicle driving trajectory to solve the problems of charge evasion, charge leakage, and charge splitting.</p><p>In this paper, we only analyze the coverage of the sensing platforms, and do not consider the energy and deployment location of air nodes such as UAVs. Therefore, several challenges remain in the specific implementation process, such as insufficient transmission bandwidth; a large volume of application data must be forwarded through the centralized core gateway, which puts great pressure on the centralized transmission of the core network. Aerial nodes have the problems of long distance and large link transmission delay, which cannot meet the requirements of low-delay control instructions. The introduction of MEC can reduce some delay, but it also brings new security and privacy problems. The high mobility of vehicles will cause frequent network disconnections. When vehicles access edge applications, using mobility management technology can avoid connection interruption, and then provide a guarantee for the application of various network services. The aforementioned technical problems must be solved to further promote unconscious payment, and comprise a critical development direction for the Internet of Vehicles in the future.</p></div>\n</div></div>\n"
}