{
    "abstract": "Numerous studies have been conducted on the influence of peers on students’ learning processes and their participation in online forums. However, these studies are limited in terms of system functionality and lack real-time analysis. In this study, we present InPath, a real-time analytics forum system, to rank and provide feedback on the performance of online participation of students. We used the...",
    "articleNumber": "9973307",
    "articleTitle": "InPath Forum: A Real-Time Learning Analytics and Performance Ranking Forum System",
    "authors": [
        {
            "preferredName": "Adeline Chew Yao Yi",
            "normalizedName": "A. C. Y. Yi",
            "firstName": "Adeline Chew Yao",
            "lastName": "Yi",
            "searchablePreferredName": "Adeline Chew Yao Yi"
        },
        {
            "preferredName": "Tey Kai Ying",
            "normalizedName": "T. K. Ying",
            "firstName": "Tey Kai",
            "lastName": "Ying",
            "searchablePreferredName": "Tey Kai Ying"
        },
        {
            "preferredName": "Siang Jo Yee",
            "normalizedName": "S. J. Yee",
            "firstName": "Siang Jo",
            "lastName": "Yee",
            "searchablePreferredName": "Siang Jo Yee"
        },
        {
            "preferredName": "Wee Mee Chin",
            "normalizedName": "W. M. Chin",
            "firstName": "Wee Mee",
            "lastName": "Chin",
            "searchablePreferredName": "Wee Mee Chin"
        },
        {
            "preferredName": "Ting Tin Tin",
            "normalizedName": "T. T. Tin",
            "firstName": "Ting Tin",
            "lastName": "Tin",
            "searchablePreferredName": "Ting Tin Tin"
        }
    ],
    "doi": "10.1109/ACCESS.2022.3227430",
    "publicationTitle": "IEEE Access",
    "publicationYear": "2022",
    "publicationVolume": null,
    "publicationIssue": null,
    "volume": "10",
    "issue": null,
    "documentLink": "/document/9973307/",
    "xml": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<response><accessType>CCBY - IEEE is not the copyright holder of this material. Please follow the instructions via https://creativecommons.org/licenses/by/4.0/ to obtain full-text articles and stipulations in the API documentation.</accessType><div id=\"BodyWrapper\" class=\"ArticlePage\" xmlns:ieee=\"http://www.ieeexplore.ieee.org\"><div id=\"article\">\n<div class=\"section\" id=\"sec1\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION I.</div><h2>Introduction</h2></div><p>In 2020, the COVID-19 pandemic greatly impacted the educational landscape by affecting 94% of the world’s student population in more than 190 countries <a ref-type=\"bibr\" anchor=\"ref1\" id=\"context_ref_1_1\">[1]</a>, <a ref-type=\"bibr\" anchor=\"ref2\" id=\"context_ref_2_1\">[2]</a>. According to the researchers, the number of students forced to stay home due to educational institution closures reached a high of 1.598 billion from 194 countries on April 1, 2020 <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_1\">[3]</a>. One year after the pandemic, almost 50% of the world’s students are still affected by partial or full school closures <a ref-type=\"bibr\" anchor=\"ref1\" id=\"context_ref_1_1\">[1]</a>. Based on research conducted to study how delivery of education is adapted to online learning in response to the pandemic, the author discussed online discussion forums as an online asynchronous platform that has improved student content, student education, and student-student interaction <a ref-type=\"bibr\" anchor=\"ref5\" id=\"context_ref_5_1\">[5]</a>, <a ref-type=\"bibr\" anchor=\"ref6\" id=\"context_ref_6_1\">[6]</a>. Participation in the online discussion group ensures that students become intimately involved with the course material and understand the meaning of the content through interaction with their peers <a ref-type=\"bibr\" anchor=\"ref7\" id=\"context_ref_7_1\">[7]</a>.</p><p>There is a lack of existing studies that investigate student participation in online discussion forums by tracking their performance and providing feedback in real time. <a ref-type=\"table\" anchor=\"table1\" class=\"fulltext-link\">Table 1</a> highlights the gap in existing research with respect to system functionality, such as real-time performance analysis, performance classification using machine learning algorithms, performance ranking, performance feedback mechanisms, and a dashboard for data visualisation. All features listed in <a ref-type=\"table\" anchor=\"table1\" class=\"fulltext-link\">Table 1</a> were incorporated into our proposed system (InPath).<div class=\"figure figure-full table\" id=\"table1\"><div class=\"figcaption\"><b class=\"title\">TABLE 1 </b>\nComparison of Existing Research With Our Proposed Features in the Online Discussion Forum</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin.t1-3227430-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin.t1-3227430-small.gif\" alt=\"Table 1- &#10;Comparison of Existing Research With Our Proposed Features in the Online Discussion Forum\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p><p>We investigate how the students participated and contributed to the online discussion forum. Our main goal is to develop a real-time system that allows both students and educators to evaluate and reflect on student participation in the online discussion forum. In <a ref-type=\"sec\" anchor=\"sec2\" class=\"fulltext-link\">Section II</a>, we present the proposed learning metrics as a measurement of the of students of participation level in online forums based on the literature and availability of data. Then, we explain the data flow and machine-learning approach used in the proposed system. We used peer success as a reference point for students to compare their participation. We introduce a hierarchical badge system that categorises students into three badge levels by applying machine learning clustering algorithms based on the participation level of each student. We also provide a feedback mechanism for student performance based on the proposed metrics to promote self-efficacy and self-regulated learning skills <a ref-type=\"bibr\" anchor=\"ref8\" id=\"context_ref_8_1\">[8]</a>. As a result, we present a dashboard that displays the visualisation of the analysed data and the ranking based on the students’ participation metrics in the online forum, as explained in <a ref-type=\"sec\" anchor=\"sec3\" class=\"fulltext-link\">Section III</a>. In <a ref-type=\"sec\" anchor=\"sec4\" class=\"fulltext-link\">Section IV</a>, we discuss the relationship between the proposed learning metrics and the three badge levels, as well as the current limitations of the InPath system. Finally, in <a ref-type=\"sec\" anchor=\"sec5\" class=\"fulltext-link\">Section V</a>, we conclude our study by summarising the features and implications of the InPath system for students and instructors.</p><p>The main contributions of this research are as follows:\n<ul style=\"list-style-type:disc\"><li><p>Propose learning metrics to measure and assess student participation in the online discussion forum.</p></li><li><p>Apply a machine learning clustering algorithm to categorise different participation levels.</p></li><li><p>Introduce a hierarchical badge system based on the level of participation.</p></li><li><p>Use the feedback mechanism to improve the student’s performance.</p></li><li><p>Introduce a real-time automated dashboard that visualises the participation metrics.</p></li></ul></p></div>\n<div class=\"section\" id=\"sec2\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION II.</div><h2>Materials and Methods</h2></div><div class=\"section_2\" id=\"sec2a\"><h3>A. Dataset</h3><p>The dataset consists of five months of anonymized data obtained from the Ed Discussion Forum for an Information Technology course at an Australian research university in the 2020/21 academic year during the COVID-19 pandemic. In total, 423 undergraduate students and 16 tutors were registered users of the online forum. After obtaining ethical clearance from the university, we loaded this dataset into an online discussion forum for system testing.</p></div><div class=\"section_2\" id=\"sec2b\"><h3>B. Learning Metrics</h3><p>Based on prior research <a ref-type=\"bibr\" anchor=\"ref4\" id=\"context_ref_4_2b\">[4]</a>, <a ref-type=\"bibr\" anchor=\"ref9\" id=\"context_ref_9_2b\">[9]</a>, the authors used the users’ contributions as metrics to analyse their participation in the online discussion forum. By taking these metrics into consideration, we proposed a set of learning metrics based on the objective of this research and the availability of forum data. The learning metrics proposed are as shown in <a ref-type=\"table\" anchor=\"table2\" class=\"fulltext-link\">Table 2</a>, where the number of words, posts, replies, and posts for each category are considered the students’ contributions to the online forum. Meanwhile, the total number of days a student visited the forum and the total number of posts read by the student were used to measure the activity of the students participating in the online forum.<div class=\"figure figure-full table\" id=\"table2\"><div class=\"figcaption\"><b class=\"title\">TABLE 2 </b>\nLearning Metrics and its Description</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin.t2-3227430-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin.t2-3227430-small.gif\" alt=\"Table 2- &#10;Learning Metrics and its Description\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p><p>Existing research models reported in the literature still have room for improvement. They can be refined using a mechanism to assess the quality of user-generated content <a ref-type=\"bibr\" anchor=\"ref4\" id=\"context_ref_4_2b\">[4]</a>, <a ref-type=\"bibr\" anchor=\"ref9\" id=\"context_ref_9_2b\">[9]</a>. Cheng and Vassileva stated that the quality of user contributions declined as the number of user contributions increased <a ref-type=\"bibr\" anchor=\"ref9\" id=\"context_ref_9_2b\">[9]</a>. This could be due to the urge of individuals to increase their contribution scores without considering the quality of content, as quality was not taken into account in the motivation strategy proposed. Therefore, in this study, we decided to use the total number of likes received as a qualitative metric that determines the quality and usefulness of a student’s posts or replies.</p></div><div class=\"section_2\" id=\"sec2c\"><h3>C. Data Flow</h3><p>In this research, we propose InPath, a real-time automated system built on open-source software that collects student activities on an online student discussion forum and generates instant feedback. The InPath system predicts students’ contributions to the online student discussion forum via machine learning clustering, generates dashboard visualisations that can be viewed as comparisons to other peers, and obtains auto-generated feedback indicating the gap between the student’s current performance (indicated by the badge level) and a higher badge level. <a ref-type=\"fig\" anchor=\"fig1\" class=\"fulltext-link\">Fig. 1</a> illustrates the standard data flow of the InPath system. To begin, the database associated with the online discussion forum stores all user information and activity; any updates to the users are passed through the Kafka Connector and read by Kafka Consumer Group 1; additionally, the application filters out non-student users and extracts only the seven learning metrics specified in the previous section. Following that, the Kafka Producer writes each processed record to the Kafka topic belonging to consumer group 2. The streaming data is then passed to the Scala-based Spark streaming application, which forecasts each student’s current badge level using the trained machine learning model. The results were then stored in a database. Finally, the learning analytics dashboard displays student performance in comparison.\n<div class=\"figure figure-full\" id=\"fig1\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin1-3227430-large.gif\" data-fig-id=\"fig1\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin1-3227430-small.gif\" alt=\"FIGURE 1. - Data flow of the InPath system.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 1. </b><fig><p>Data flow of the InPath system.</p></fig></div><p class=\"links\"><a href=\"/document/9973307/all-figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec2d\"><h3>D. Machine Learning Approach</h3><p>The K-means method is a popular unsupervised clustering algorithm that effectively produces clusters in n-dimensional space <a ref-type=\"bibr\" anchor=\"ref10\" id=\"context_ref_10_2d\">[10]</a>. The InPath system employs the same clustering algorithm as <a ref-type=\"bibr\" anchor=\"ref11\" id=\"context_ref_11_2d\">[11]</a>, which is a three-level K-means algorithm that performs the best in grouping students based on the learning metrics in their research. As demonstrated in the pseudocode in <a ref-type=\"fig\" anchor=\"fig2\" class=\"fulltext-link\">Fig. 2(a)</a>, the K-means algorithm takes the number of clusters and the number of data points as input and initialises K centroids randomly. The algorithm proceeds by repeatedly assigning each data point in D to the nearest cluster and recalculating the centroids’ positions until there are no further changes in the positions. Our machine learning approach consists of two major steps: <a ref-type=\"disp-formula\" anchor=\"deqn1\" href=\"#deqn1\" class=\"fulltext-link\">(1)</a> training the K-means clustering model and (2) prediction of data points. As shown in the pseudocode in <a ref-type=\"fig\" anchor=\"fig2\" class=\"fulltext-link\">Fig. 2(b)</a>, we utilised Apache Spark and implemented a Scala-based Spark streaming application that constructs a Kafka consumer to receive data from the database via a stream. Subsequently, the application initialises the K value to be 3 to obtain three ranks and uses the Apache Spark Machine Learning library to load a K-means model. The three-rank mechanism was chosen in our application as it adequately classifies the students based on their participation level on the forum, which can be described as low, moderate and high participation level. In comparison, the two-rank clustering model performed poorly since it resulted in many students being flagged as unengaged due to over-clustering of points into unnecessary extra clusters <a ref-type=\"bibr\" anchor=\"ref10\" id=\"context_ref_10_2d\">[10]</a>.\n<div class=\"figure figure-full\" id=\"fig2\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin2ab-3227430-large.gif\" data-fig-id=\"fig2\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin2ab-3227430-small.gif\" alt=\"FIGURE 2. - Machine learning approach algorithms: (a) K-means algorithm; (b) spark streaming K-means algorithm.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 2. </b><fig><p>Machine learning approach algorithms: (a) K-means algorithm; (b) spark streaming K-means algorithm.</p></fig></div><p class=\"links\"><a href=\"/document/9973307/all-figures\" class=\"all\">Show All</a></p></div></p><p>Next, the dataset was fitted to a model with three clusters based on the learning metrics we proposed. After transforming the students’ attributes from the Kafka stream into vectors, we performed predictions on the vectors one by one. The outcome is a tuple consisting of the student’s ID and predicted cluster ID, which we will use to categorise the students as either Hall of Fame, All Star, or Rookies badge. <a ref-type=\"table\" anchor=\"table3\" class=\"fulltext-link\">Table 3</a> shows the three badge levels and the characteristics of the students who will be classified into each level. The outcomes were then updated in the database.<div class=\"figure figure-full table\" id=\"table3\"><div class=\"figcaption\"><b class=\"title\">TABLE 3 </b>\nBadge Levels and Their Characteristics</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin.t3-3227430-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin.t3-3227430-small.gif\" alt=\"Table 3- &#10;Badge Levels and Their Characteristics\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p></div><div class=\"section_2\" id=\"sec2e\"><h3>E. Ranking System</h3><p>To understand and evaluate the performance of students in the online discussion forum under each K-means cluster, we proposed a ranking system on our learning analytics website. Let <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$F = {\\textit {f1}}, {\\textit {f2}}, {\\textit {f3}}, \\ldots, {\\textit {f7}}$\n</tex-math></inline-formula> be the set of contributions for each student, similar to the learning metrics we proposed. The formula to calculate the score of each student by taking the average of the scores of the seven selected features is presented in <a ref-type=\"disp-formula\" anchor=\"deqn1\" href=\"#deqn1\" class=\"fulltext-link\">(1)</a>. As a result, the top 10 students with the highest scores will be displayed on the Learning Analytics website. This ranking system will act as a powerful reference point for all students and will motivate user participation, as stated by <a ref-type=\"bibr\" anchor=\"ref12\" id=\"context_ref_12_2e\">[12]</a>, and will help achieve the objective of creating a better web-based learning environment.<disp-formula id=\"deqn1\" class=\"display-formula\"><tex-math notation=\"LaTeX\">\\begin{equation*} Score=\\frac {\\sum \\nolimits _{i=1}^{7} {} f_{i}}{7}\\tag{1}\\end{equation*}\n</tex-math><span class=\"formula\"><span class=\"link\">View Source</span><img aria-describedby=\"qtip-0\" style=\"display:inline;\" title=\"Right-click on figure or equation for MathML and additional features.\" data-hasqtip=\"0\" class=\"qtooltip moreInfo\" alt=\"Right-click on figure for MathML and additional features.\" src=\"/assets/img/icon.support.gif\" border=\"0\" height=\"20\" width=\"24\"/><span class=\"tex tex2jax_ignore\" style=\"display:none;\">\\begin{equation*} Score=\\frac {\\sum \\nolimits _{i=1}^{7} {} f_{i}}{7}\\tag{1}\\end{equation*}\n</span></span></disp-formula></p></div><div class=\"section_2\" id=\"sec2f\"><h3>F. Feedback System</h3><p>Feedback is a critical element of the learning process because it allows students to define their expectations, track their current learning progress, and compare their success with that of others <a ref-type=\"bibr\" anchor=\"ref13\" id=\"context_ref_13_2f\">[13]</a>. Learning analytics-based feedback has been demonstrated to be one of the most influential factors affecting student learning performance, with a significant difference in learning performance between students who received feedback and those who did not. <a ref-type=\"bibr\" anchor=\"ref14\" id=\"context_ref_14_2f\">[14]</a>, <a ref-type=\"bibr\" anchor=\"ref15\" id=\"context_ref_15_2f\">[15]</a>. As an outcome, we include two mechanisms in InPath to provide real-time feedback for students to understand their personal performance in terms of their participation level in the online discussion forum, realise the gap between the current badge level and the next upper badge level (<a ref-type=\"table\" anchor=\"table3\" class=\"fulltext-link\">Table 3</a>), and perhaps become motivated to act and improve learning participation. First, Type 1 Feedback: A graphical representation of student-to-student comparisons on learning measures, average Hall of Fame performance, and the highest performance is provided by InPath. Second, Type 2 Feedback: InPath emphasises the difference between current personal statistics and a higher badge level. Student A, for example, with a Rookies badge, is 10 times behind the average in the All Star category in terms of likes received. As a result, student A realised that his posts/questions may be excessively extensive and unproductive in terms of post content for his peers.</p></div></div>\n<div class=\"section\" id=\"sec3\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION III.</div><h2>Results</h2></div><p>This section presents the generated visualization of InPath and the results computed based on the methods applied in the implementation stage of our work. An open-sourced data visualisation tool was used to construct the interactive charts on our learning analytics website.</p><div class=\"section_2\" id=\"sec3a\"><h3>A. Dashboard</h3><p>The dashboard is the main page of the learning analytics website. It displays a graphical examination of the performance of a student compared to others. The dashboard interface is depicted in <a ref-type=\"fig\" anchor=\"fig3\" class=\"fulltext-link\">Fig. 3</a>. At the top of all the charts are statistics on the total number of students who have earned a badge level. The dashboard includes six charts that allow for comparisons between students and the data obtained based on the performance of other students, corresponding to the six learning metrics presented in this study. The second section of the dashboard delves into the first type of feedback mechanism discussed in <a ref-type=\"sec\" anchor=\"sec2\" class=\"fulltext-link\">Section 2</a>.6. The radar chart shown in <a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">Fig. 4</a> compares the user with the highest statistics and the average statistics of the highest badge level (Hall of Fame).\n<div class=\"figure figure-full\" id=\"fig3\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin3-3227430-large.gif\" data-fig-id=\"fig3\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin3-3227430-small.gif\" alt=\"FIGURE 3. - First Part of Dashboard: Graphical representation between students and other reference points.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 3. </b><fig><p>First Part of Dashboard: Graphical representation between students and other reference points.</p></fig></div><p class=\"links\"><a href=\"/document/9973307/all-figures\" class=\"all\">Show All</a></p></div>\n<div class=\"figure figure-full\" id=\"fig4\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin4-3227430-large.gif\" data-fig-id=\"fig4\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin4-3227430-small.gif\" alt=\"FIGURE 4. - Second part of the dashboard: Feedback that compares the user with the highest statistics and highest badge average statistics.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 4. </b><fig><p>Second part of the dashboard: Feedback that compares the user with the highest statistics and highest badge average statistics.</p></fig></div><p class=\"links\"><a href=\"/document/9973307/all-figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec3b\"><h3>B. Individual Statistics</h3><p>The Individual Statistics Page, as shown in <a ref-type=\"fig\" anchor=\"fig5\" class=\"fulltext-link\">Fig. 5</a>, is a page where students can view their forum statistics based on their respective participation levels in the forum. The metrics displayed on this page are the number of posts, replies, words posted, reads, days the student visited the forum, and likes received by the student. We also included a summary of feedback based on these metrics with reference to the average statistics calculated from the metrics of the badge, which is one level higher, as shown in <a ref-type=\"fig\" anchor=\"fig6\" class=\"fulltext-link\">Fig. 6</a>. For students at the highest badge level (Hall of Fame), we will compare them with the highest value obtained for that metric.\n<div class=\"figure figure-full\" id=\"fig5\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin5-3227430-large.gif\" data-fig-id=\"fig5\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin5-3227430-small.gif\" alt=\"FIGURE 5. - First part of individual statistics.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 5. </b><fig><p>First part of individual statistics.</p></fig></div><p class=\"links\"><a href=\"/document/9973307/all-figures\" class=\"all\">Show All</a></p></div>\n<div class=\"figure figure-full\" id=\"fig6\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin6-3227430-large.gif\" data-fig-id=\"fig6\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin6-3227430-small.gif\" alt=\"FIGURE 6. - Second part of individual statistics.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 6. </b><fig><p>Second part of individual statistics.</p></fig></div><p class=\"links\"><a href=\"/document/9973307/all-figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec3c\"><h3>C. A Ranking System</h3><p>As demonstrated in <a ref-type=\"sec\" anchor=\"sec3c\" class=\"fulltext-link\">Section III(C)</a>, we present an equation to rank students in each cluster based on their level of participation in order to evaluate the powerful effect of peer pressure and encourage participation. <a ref-type=\"fig\" anchor=\"fig7\" class=\"fulltext-link\">Fig. 7</a> shows the results of the ranking system on the learning analytics website. This page is designed to function as a leaderboard, which allows tutors and students to discover the top 10 most contributing students on the system, along with their badge. For example, David Hayes had the highest engagement score among the students based on the calculation results. He/she is awarded the Hall of Fame badge and is rated first on the leaderboard.\n<div class=\"figure figure-full\" id=\"fig7\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin7-3227430-large.gif\" data-fig-id=\"fig7\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin7-3227430-small.gif\" alt=\"FIGURE 7. - Ranking system.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 7. </b><fig><p>Ranking system.</p></fig></div><p class=\"links\"><a href=\"/document/9973307/all-figures\" class=\"all\">Show All</a></p></div></p></div></div>\n<div class=\"section\" id=\"sec4\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION IV.</div><h2>Discussion</h2></div><p>In this study, we present the application of the InPath system, a real-time analytics forum system, to rank and provide feedback on the performance of student online participation. It is an innovative and revealing way to motivate students to engage in self-reflection, improve student interaction in online discussion forums, and allow instructors to track students’ learning behaviour in real time. As previously noted in <a ref-type=\"sec\" anchor=\"sec2a\" class=\"fulltext-link\">Section II(A)</a>, the dataset from the five-month forum that we used as the experimental data for our InPath system corresponded to the course of the COVID-19 pandemic. There were 423 students enrolled in this course, and the three K-Mean clusters computed by InPath are presented; the centroids reflect the seven learning metrics, and the centroid results are displayed in <a ref-type=\"table\" anchor=\"table4\" class=\"fulltext-link\">Table 4</a>.<div class=\"figure figure-full table\" id=\"table4\"><div class=\"figcaption\"><b class=\"title\">TABLE 4 </b>\nCentroids Findings for Each Learning Metrics</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin.t4-3227430-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin.t4-3227430-small.gif\" alt=\"Table 4- &#10;Centroids Findings for Each Learning Metrics\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p><p>In <a ref-type=\"fig\" anchor=\"fig8\" class=\"fulltext-link\">Fig. 8</a>, it appears that students who earned a Hall of Fame write longer posts and receive more likes than their peers. This shows that students in the Hall of Fame were more likely to ask relevant questions and earn better forum interactions than others at a lower badge level. <a ref-type=\"fig\" anchor=\"fig9\" class=\"fulltext-link\">Figure 9</a> also shows the relationship between the total number of days spent on the online discussion forum and the total number of posts read. Students with higher badge levels, it goes without saying, are more likely to spend more time on online discussion forums and read more posts. In total, there were 423 students who earned the following badges by the end of the semester:18 were inducted into the Hall of Fame, 75 were named All Star, and 330 were Rookies; the simplified ratio of the three badges is 6:25:110.\n<div class=\"figure figure-full\" id=\"fig8\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin8-3227430-large.gif\" data-fig-id=\"fig8\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin8-3227430-small.gif\" alt=\"FIGURE 8. - Diagram of three clusters against number of words and number of likes.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 8. </b><fig><p>Diagram of three clusters against number of words and number of likes.</p></fig></div><p class=\"links\"><a href=\"/document/9973307/all-figures\" class=\"all\">Show All</a></p></div>\n<div class=\"figure figure-full\" id=\"fig9\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin9-3227430-large.gif\" data-fig-id=\"fig9\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9973307/chin9-3227430-small.gif\" alt=\"FIGURE 9. - Diagram of three clusters against total post read and total days spent on forum.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 9. </b><fig><p>Diagram of three clusters against total post read and total days spent on forum.</p></fig></div><p class=\"links\"><a href=\"/document/9973307/all-figures\" class=\"all\">Show All</a></p></div></p><p>Owing to time constraints, we were unable to collect and analyse data from a variety of different sample forum sizes. Although InPath results only reflect the conclusion of a single forum dataset, they provide critical insight into the real-time learning analytics system implemented in the online discussion forum environment. Some datasets from more comprehensive courses will be used in our future improvements, and we will integrate the InPath system into an ongoing course to track and analyse the influence of this system on students’ attitudes regarding the online learning environment. In addition to this work, different machine learning approaches, such as classification and quality-based methods, can be used as an improvement approach to improve the performance of our system.</p></div>\n<div class=\"section\" id=\"sec5\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION V.</div><h2>Conclusion</h2></div><p>With the advancement of technology, e-learning has grown in popularity. However, e-learning faces a barrier in allowing instructors to assess student performance and improve the e-learning environment. Therefore, we set a research question for this paper: Are we able to assess student participation on discussion forums in real time? As a result, this study proposes a learning analytics tool, InPath, to assess student participation in educational online discussion forums. This research was motivated by the need to understand how to analyse individuals’ performance in comparison to other students’ performance as a reference point, and how an analytics dashboard can assist students in learning their own participation level. As discussed in previous sections, we designed a set of learning metrics and a real-time Spark Streaming K-means system to monitor and rank students based on their participation levels in the discussion forum. As a result of this study, students are categorised into three ranks: Hall of Fame, All Star and Rookies. Furthermore, this paper presents the implementation of a web-based forum analytics website to illustrate the real-time results generated by the InPath system. Ranking mechanisms and feedback systems are also deployed on the website to encourage other learners to become more involved in the forum community and to enhance the quality of the e-learning environment. We believe that InPath will not only motivate students to participate in the online forum but will also support instructors in understanding students’ behaviours and improving their teaching methods.</p></div>\n</div></div></response>\n"
}