{
    "abstract": "Scoliosis is a disease caused by the spine curving. It is treatable but physiotherapists may do different measurements for curvature angles. That’s a problem affecting the treatment planning. This study aims to develop a Deep Learning-based decision support system, which diagnoses scoliosis and plans treatments via Schroth method. The system has an interpretable and explainable CapsNet model proce...",
    "articleNumber": "9975279",
    "articleTitle": "Development of a CapsNet and Fuzzy Logic Decision Support System for Diagnosing the Scoliosis and Planning Treatments via Schroth Method",
    "authors": [
        {
            "preferredName": "Sena Goral",
            "normalizedName": "S. Goral",
            "firstName": "Sena",
            "lastName": "Goral",
            "searchablePreferredName": "Sena Goral"
        },
        {
            "preferredName": "Utku Kose",
            "normalizedName": "U. Kose",
            "firstName": "Utku",
            "lastName": "Kose",
            "searchablePreferredName": "Utku Kose"
        }
    ],
    "doi": "10.1109/ACCESS.2022.3227763",
    "publicationTitle": "IEEE Access",
    "publicationYear": "2022",
    "publicationVolume": null,
    "publicationIssue": null,
    "volume": "10",
    "issue": null,
    "documentLink": "/document/9975279/",
    "xml": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<response><accessType>CCBY - IEEE is not the copyright holder of this material. Please follow the instructions via https://creativecommons.org/licenses/by/4.0/ to obtain full-text articles and stipulations in the API documentation.</accessType><div id=\"BodyWrapper\" class=\"ArticlePage\" xmlns:ieee=\"http://www.ieeexplore.ieee.org\"><div id=\"article\">\n<div class=\"section\" id=\"sec1\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION I.</div><h2>Introduction</h2></div><p>Scoliosis is known as the deformation of the spine structure as a result of ‘S’ or ‘C’ shaped curves in the spine <a ref-type=\"bibr\" anchor=\"ref1\" id=\"context_ref_1_1\">[1]</a>, <a ref-type=\"bibr\" anchor=\"ref2\" id=\"context_ref_2_1\">[2]</a>, <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_1\">[3]</a>, <a ref-type=\"bibr\" anchor=\"ref4\" id=\"context_ref_4_1\">[4]</a>. These curvatures in the spine cause many negative consequences. Patients diagnosed with the scoliosis may experience complaints such as curvature of the back, humpback, difficulty in standing upright, low shoulders, and visual conditions such as asymmetrical disorders/deformation in the body appearance <a ref-type=\"bibr\" anchor=\"ref5\" id=\"context_ref_5_1\">[5]</a>, <a ref-type=\"bibr\" anchor=\"ref6\" id=\"context_ref_6_1\">[6]</a>. At the time of diagnosis, physiotherapists may detect the curvature in the back region (as directed forward or backward), by performing manual evaluations. However, in some patients, scoliosis cannot be detected easily via manual evaluations. At this point, one solution is to examine the x-ray images so deciding about the level of the scoliosis disease. But here another issue appears as the evaluations may differ according to different physiotherapists so finding a generalization in terms of diagnosis is difficult in many cases. In order to plan a treatment for the diagnosed scoliosis, it is important to determine the angle for spinal curvature, by using the Cobb method or the Ferguson method <a ref-type=\"bibr\" anchor=\"ref7\" id=\"context_ref_7_1\">[7]</a>. Nowadays, the Cobb angle measurement method is widely used by the physiotherapists. After getting the angle measurement findings, it is then time to plan the treatment phase for the diagnosed scoliosis case. That is done in order to perform necessary surgical or non-surgical interventions. In the literature, various methods have been developed for the treatment planning, as considering the diagnosis outcomes. Some of these are known as Schroth, Lenke, Dobomed, Lyonnaise, and Side Shift <a ref-type=\"bibr\" anchor=\"ref8\" id=\"context_ref_8_1\">[8]</a>. Considering these methods, most of them require special training and certification in the field. During the diagnosis of scoliosis, the manual control is made via angle measurements done by using the scoliometer. Additionally, the definitive diagnosis may be understood from the x-ray images, as it was indicated before. But that still requires manual interventions by the physiotherapist, who will then again determine the treatment planning (i.e. following the Schroth method).</p><p>At the time of the computer-aided medical applications, all the pointed diagnosis and treatment planning phases can be effectively performed by the specifically developed Artificial Intelligence-based solutions. When the historical advancements within Artificial Intelligence (AI) is examined, it can be seen that Deep Learning models dominate the recent medical applications, as resulting successful outcomes even in the most critical diagnosis and treatment research cases <a ref-type=\"bibr\" anchor=\"ref9\" id=\"context_ref_9_1\">[9]</a>, <a ref-type=\"bibr\" anchor=\"ref10\" id=\"context_ref_10_1\">[10]</a>, <a ref-type=\"bibr\" anchor=\"ref11\" id=\"context_ref_11_1\">[11]</a>, <a ref-type=\"bibr\" anchor=\"ref12\" id=\"context_ref_12_1\">[12]</a>, <a ref-type=\"bibr\" anchor=\"ref13\" id=\"context_ref_13_1\">[13]</a>. Deep Learning-based solutions, which reveal more successful findings than traditional Machine Learning solutions (especially in sensitive analysis of image data) enable effective approaches to be designed in the stages of tumor detection, brain hemorrhage diagnosis, early prediction of eye diseases and many different problems in an automatic way <a ref-type=\"bibr\" anchor=\"ref14\" id=\"context_ref_14_1\">[14]</a>, <a ref-type=\"bibr\" anchor=\"ref15\" id=\"context_ref_15_1\">[15]</a>, <a ref-type=\"bibr\" anchor=\"ref16\" id=\"context_ref_16_1\">[16]</a>, <a ref-type=\"bibr\" anchor=\"ref17\" id=\"context_ref_17_1\">[17]</a>, <a ref-type=\"bibr\" anchor=\"ref18\" id=\"context_ref_18_1\">[18]</a>, <a ref-type=\"bibr\" anchor=\"ref19\" id=\"context_ref_19_1\">[19]</a>. At this point, the advanced Deep Learning models may be used to have efficiency in terms of time and resources and the physiotherapists may benefit from a complete decision support system, if the appropriate set-up may be done with specific algorithmic touches. That seems to be an appropriate way to employ a Deep Learning supported system for image data like x-ray images, as successful results have been reported in the literature <a ref-type=\"bibr\" anchor=\"ref20\" id=\"context_ref_20_1\">[20]</a>, <a ref-type=\"bibr\" anchor=\"ref21\" id=\"context_ref_21_1\">[21]</a>, <a ref-type=\"bibr\" anchor=\"ref22\" id=\"context_ref_22_1\">[22]</a>, <a ref-type=\"bibr\" anchor=\"ref23\" id=\"context_ref_23_1\">[23]</a>. As related to the scoliosis, such a system will be a nice tool to help both physiotherapists and patients in terms of appropriate diagnosis and treatment steps. In the literature, there is a recent interest to research decision support for scoliosis cases <a ref-type=\"bibr\" anchor=\"ref24\" id=\"context_ref_24_1\">[24]</a>, <a ref-type=\"bibr\" anchor=\"ref25\" id=\"context_ref_25_1\">[25]</a>, <a ref-type=\"bibr\" anchor=\"ref26\" id=\"context_ref_26_1\">[26]</a>. It is clear that developing software systems in decision support is a good opportunity for real-use cases.</p><p>The existing studies with AI use for scoliosis employ alternative solutions through Machine/Deep Learning models. However, the following issues for the associated literature are still open:\n<ul style=\"list-style-type:disc\"><li><p>In the literature, there is a great interest in using neural networks for scoliosis. In recent years, that interest has been in Convolutional Neural Networks (CNN) of Deep Learning <a ref-type=\"bibr\" anchor=\"ref27\" id=\"context_ref_27_1\">[27]</a>, <a ref-type=\"bibr\" anchor=\"ref28\" id=\"context_ref_28_1\">[28]</a>. Although competitive findings were reported with CNN usage, the literature still needs for improvement in terms of findings. That’s same for other alternative Machine/Deep Learning models rarely used for scoliosis problem.</p></li><li><p>The existing studies do not provide complete software environment for ensuring decision support regarding both diagnosis and treatment planning. As general, the studies including decision support approach have been targeting specific findings without using complete software environments. They also need sometimes complicated data and even use of 3D image processing <a ref-type=\"bibr\" anchor=\"ref29\" id=\"context_ref_29_1\">[29]</a>, <a ref-type=\"bibr\" anchor=\"ref30\" id=\"context_ref_30_1\">[30]</a>, <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_1\">[31]</a>, <a ref-type=\"bibr\" anchor=\"ref32\" id=\"context_ref_32_1\">[32]</a>. So, it would be great to ensure a more practical software use for helping physiotherapists to save their time.</p></li><li><p>To the best of the authors’ knowledge, the literature does not include a combined use of Deep Learning and an automated Schroth-based diagnosis-treatment planning approach. That’s critical for physiotherapists, who may want an automated solution considering Schroth method.</p></li><li><p>The literature is still open for ensuring automated, intelligent solutions to solve the issue of different curvature angle measurements done by physiotherapists. That may be extended to the potential issue of applying false or less effective exercises for target patients.</p></li><li><p>Although the existing studies provide AI support, most of physiotherapists still go with manual actions in diagnosis and treatment planning. That state is associated with several issues. First of all, physiotherapists want to use a trustworthy decision support system at the era of Deep Learning. On other hand, they tend to prefer easy-to-use systems with complete flow from diagnosis to treatment planning with patient tracking options. It is seen that AI is very competitive for humans at diagnosis of scoliosis <a ref-type=\"bibr\" anchor=\"ref33\" id=\"context_ref_33_1\">[33]</a>. So, that state needs to be met by helping in practical tools in software side.</p></li></ul></p><div class=\"section_2\" id=\"sec1a\"><h3>A. Objective and Contribution of This Study is as Follows</h3><p>This study aims to develop of a complete decision support system, which is able to diagnose scoliosis and create treatment planning. These are done with the Deep Learning background and the Schroth method. It is also able to give feedback on how the treatment goes for a patient. In detail, the Cobb based curvature angle of the spine is calculated by a CapsNet (Capsule Network) model, which is processing the patient’s x-ray spine image. CapsNet was chosen to solve the issue of improving the existing literature (with majority of CNN usage). CapsNet has been accepted as a more effective solution than the CNN technique because the CapsNet uses unique elements called as capsules to deal with some CNN related problems corresponding to pooling and recognition of the displaced elements in the image data <a ref-type=\"bibr\" anchor=\"ref34\" id=\"context_ref_34_1a\">[34]</a>, <a ref-type=\"bibr\" anchor=\"ref35\" id=\"context_ref_35_1a\">[35]</a>. Another literature issue, which is regarding safe Deep Learning usage, was solved by integrating the CapsNet model with interpretable views for the detected spines as well as angle measurements. Furthermore, CapsNet was supported by Explainable Artificial Intelligence (XAI) for ensuring visual clues over the processed x-ray images. In the decision support system, the CapsNet model is followed by the automated Schroth state definition, which is for the corresponding treatment plan. Following that, the exercise flow was adjusted by the Fuzzy Logic technique. Here, the Fuzzy Logic was used as the automated solution for determining appropriate physical exercises for the corresponding patient. With the comparative check for new x-rays and applied treatments for a specific patient, the system is able to give suggestions on changes regarding the patient as well as the treatment. In the evaluation side of the study, the designed CapsNet model was first compared with some alternative Deep Learning solutions from the literature. After being sure about effectiveness of the CapsNet, the decision support system was then developed by integrating the additional components, techniques. The whole decision support system was evaluated by physiotherapists and patients to get human-side feedback in terms of usage of the system. The study contributes to the literature by building a complete decision support system with Schroth method and patient-specific treatment planning. It provides an alternative solution for automating the curvature angle measurement against manual works by physiotherapists. The contributions include also improved diagnosis by Deep Learning, and an automated tractability on patients’ treatments as well as explainable infrastructure for ensuring a safe, trustworthy decision support. It is important to point that the study ensures both complete decision support system and an alternative scoliosis detection instead of using existing approaches. That’s because the related literature is open for complete decision support and alternatives for the detection.</p></div><div class=\"section_2\" id=\"sec1b\"><h3>B. The Organization of the Remaining Content is as Follows</h3><p>The second section gives essential information regarding the scoliosis. It explains human spine structure and Cobb angle measurement as well as Schroth method to detect and treat the disease. This section also expresses the motivation factors to build the decision support system in this study. After that, the third section focuses on the literature including usage of Deep Learning models for the diagnosis of scoliosis. That section also gives idea about the motivating factors (from the literature) to run this study. Next, the fourth section gives a general overview in terms of development of the decision support system. In detail, it gives general information about design of the CapsNet, dataset, and the rest of the system design, which was done with interpretability and explainability additions, patient tracking aspects, and the treatment planning solution by the Fuzzy Logic technique. The fifth section provides details regarding applications done with the system and the evaluation works including comparative approaches and human-side contributions by physiotherapists and the patients. After that, the sixth section makes a general discussion, and the content is ended by the seventh section providing general overview of the conclusions and future work plans.</p></div></div>\n<div class=\"section\" id=\"sec2\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION II.</div><h2>Scoliosis (Curve of the Spine)</h2></div><p>The ‘S’ or ‘C’ shaped curvatures seen in the spine is associated with the disease of scoliosis. There are not any certain/ common reasons of the scoliosis, as reported in the associated literature. However, genetical factors, issues at the time of birth, postural, neurological and orthopedic problems are known as some remarkable signs of the scoliosis <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_2\">[3]</a>, <a ref-type=\"bibr\" anchor=\"ref4\" id=\"context_ref_4_2\">[4]</a>, <a ref-type=\"bibr\" anchor=\"ref5\" id=\"context_ref_5_2\">[5]</a>. It is possible to detect scoliosis with different methods including measurements regarding curvatures <a ref-type=\"bibr\" anchor=\"ref5\" id=\"context_ref_5_2\">[5]</a>, <a ref-type=\"bibr\" anchor=\"ref6\" id=\"context_ref_6_2\">[6]</a>, <a ref-type=\"bibr\" anchor=\"ref7\" id=\"context_ref_7_2\">[7]</a>. Following the detection, some necessary physical exercises or surgical operations should be performed for the treatment purposes. As it can be understood, higher levels of curvatures are the reason for further surgical operations.</p><p>In order to understand the nature of the scoliosis and the related phases of diagnosis and treatment, structure of the human spine, angle measurement, and the Schroth method (as followed in this study) were explained briefly under the following sub-sections:</p><div class=\"section_2\" id=\"sec2a\"><h3>A. The Human Spine</h3><p>As a system, the human body includes many coordinated works of different components. While different organs in that system are responsible for the continuation of vital processes, the skeletal structure focuses on physical actions, protection of the internal organs and keeping the body in a certain form. Therefore, although it is vital for the human body to have a healthy skeletal system, the spine, which enables the body to stand upright and perform sensitive actions, has a critical importance in terms of the skeletal structure. When the human body is examined broadly, it is seen that the spine includes a total of 33 small bones called as vertebrae. Localization of the vertebras start from the bottom of the skull and continue to the coccyx. Thus, the vertebral column is structured accordingly, in different parts of curves (<a ref-type=\"fig\" anchor=\"fig1\" class=\"fulltext-link\">Figure 1</a>). The spine, which enable a person to have an upright body, form a continuous structure among connections of vertebrae <a ref-type=\"bibr\" anchor=\"ref36\" id=\"context_ref_36_2a\">[36]</a>, <a ref-type=\"bibr\" anchor=\"ref37\" id=\"context_ref_37_2a\">[37]</a>.\n<div class=\"figure figure-full\" id=\"fig1\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose1ab-3227763-large.gif\" data-fig-id=\"fig1\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose1ab-3227763-small.gif\" alt=\"FIGURE 1. - Human spine structure: Left: general anatomical appearance. Right: the spine of a 57-year-old male as seen in x-ray image [36], [37].\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 1. </b><fig><p>Human spine structure: Left: general anatomical appearance. Right: the spine of a 57-year-old male as seen in x-ray image <a ref-type=\"bibr\" anchor=\"ref36\" id=\"context_ref_36_2a\">[36]</a>, <a ref-type=\"bibr\" anchor=\"ref37\" id=\"context_ref_37_2a\">[37]</a>.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p><p>When the whole structure of the spine is examined in detail, it is seen that there are 7 neck vertebrae, 12 dorsal vertebrae and 5 lumbar vertebrae respectively. In the continuation of the lumbar vertebrae, there is the coccyx, which is considered as the lowest part of the spine. Next, the sacrum, which is a large triangular bone, appears accordingly. As a result of all these combinations, the spine forms a ‘S’ shape in the frontal and sagittal planes to the right or left. In terms of normal conditions, the ideal positioning of the spine should be in that direction, but various curvatures exceeding the assumed thresholds can be seen at this stage. The formation of these excessive curvatures in the spine is the indicator of the scoliosis disease. That is a vital problem threatening the spine as well as the skeletal system.</p></div><div class=\"section_2\" id=\"sec2b\"><h3>B. Scoliosis Disease</h3><p>Scoliosis, which is among the most serious physical disorders today, may be caused by different reasons. However, reasons regarding approximately 80% of scoliosis cases cannot be understood and this type of scoliosis is called as Idiopathic Scoliosis <a ref-type=\"bibr\" anchor=\"ref5\" id=\"context_ref_5_2b\">[5]</a>, <a ref-type=\"bibr\" anchor=\"ref8\" id=\"context_ref_8_2b\">[8]</a>, <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_2b\">[38]</a>. The rest of scoliosis cases are known as because of postural disorders or neurological and orthopedic problems. Additionally, risk factors include genetic predisposition, prolonged inactivity and unilateral activities <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_2b\">[3]</a>, <a ref-type=\"bibr\" anchor=\"ref4\" id=\"context_ref_4_2b\">[4]</a>, <a ref-type=\"bibr\" anchor=\"ref5\" id=\"context_ref_5_2b\">[5]</a>, <a ref-type=\"bibr\" anchor=\"ref6\" id=\"context_ref_6_2b\">[6]</a>, <a ref-type=\"bibr\" anchor=\"ref39\" id=\"context_ref_39_2b\">[39]</a>. Patients diagnosed with scoliosis usually suffers from external asymmetries such as curvature of the back, difficulty in standing upright, humpback and protruding ribs on one side. As an initial detection, shoulder and pelvis inequality is accepted the sign for the scoliosis. After that, the arm inequality is checked, and the distance of the scapula to the spine is measured <a ref-type=\"bibr\" anchor=\"ref40\" id=\"context_ref_40_2b\">[40]</a>. That process is accepted as a general testing guide in the diagnosis of scoliosis. However, that process does not give the exact result. A safer and certain diagnosis can be done through measuring the curvature angle over x-ray images. <a ref-type=\"fig\" anchor=\"fig2\" class=\"fulltext-link\">Figure 2</a> shows some samples of x-ray images of the scoliosis <a ref-type=\"bibr\" anchor=\"ref41\" id=\"context_ref_41_2b\">[41]</a>.\n<div class=\"figure figure-full\" id=\"fig2\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose2-3227763-large.gif\" data-fig-id=\"fig2\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose2-3227763-small.gif\" alt=\"FIGURE 2. - X-ray images of a spine with scoliosis [41].\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 2. </b><fig><p>X-ray images of a spine with scoliosis <a ref-type=\"bibr\" anchor=\"ref41\" id=\"context_ref_41_2b\">[41]</a>.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec2c\"><h3>C. Treatment of the Scoliosis</h3><p>As it is a physically visible disease, the scoliosis may be treated via some tasks. These include using a corset, physical therapy-rehabilitation practices (exercises), and surgery. The main objective here is to prevent the progression of the curvature. In the early period of the scoliosis, corset use or physical exercise methods may be applied accordingly. For the patients with higher level of scoliosis, the movement of the spine may cause risks over the lungs and the breathing may become difficult in time. Such patients require urgent surgery <a ref-type=\"bibr\" anchor=\"ref42\" id=\"context_ref_42_2c\">[42]</a>, <a ref-type=\"bibr\" anchor=\"ref43\" id=\"context_ref_43_2c\">[43]</a>. Apart from surgical intervention, the progression of the scoliosis can be stopped or at least the curvature angles can be reduced by applying various physical exercises under the guidance of a physiotherapist. It is remarkable that the related exercises should be separate and specific according to each patient’s conditions such as spine curvature differences as well as age, height, weight factors.</p><p>Except from the age, height, and weight factors, the spine curvature differences take place in the heart of the treatment decisions. Although the manual evaluations done by a physiotherapist gives first signs for the existence of scoliosis, the exact evaluation is with the angle measurement done over the x-ray image. By using the x-ray image, some measurement components such as the region of the curvature, direction, start and end points are specified accordingly. These evaluations are critical because any of small curvature seen in the x-ray image does not mean scoliosis always. For this reason, some measurement approaches were introduced in the literature. The Cobb angle measurement is among these approaches.</p></div><div class=\"section_2\" id=\"sec2d\"><h3>D. Cobb Angle Measurement for Diagnosis</h3><p>Cobb angle is known as the term defining the angle of the scoliosis. By moving from that term, the angle-oriented detections over the x-ray image are defined as the Cobb angle measurement approach. Briefly, the Cobble angle measurement includes the following steps: <a ref-type=\"bibr\" anchor=\"ref44\" id=\"context_ref_44_2d\">[44]</a>, <a ref-type=\"bibr\" anchor=\"ref45\" id=\"context_ref_45_2d\">[45]</a>, <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_2d\">[46]</a>:\n<ul style=\"list-style-type:disc\"><li><p><b>Step 1:</b> First of all, the bones forming the upper and lower ends of the curvature (in the spine) are determined. These are the bones that are most inclined relative to the horizontal plane.</p></li><li><p><b>Step 2:</b> Next, some parallel lines are drawn from the upper edge of the upper vertebra to the lower edge of the lower vertebra.</p></li><li><p><b>Step 3:</b> In the third step, some new lines that make right angles to the previously-drawn lines are places, and the angle between the two perpendiculars is measured. That angle, called as the Cobb angle, shows the angle value of the scoliosis case. If the patient has more than one curvature, it may be necessary to measure the Cobb angle separately for each curvature. In this context, the larger angle is called as the major curvature, and the smaller one is called as the minor curvature.</p></li></ul></p><p>The related measurement phases are represented in <a ref-type=\"fig\" anchor=\"fig3\" class=\"fulltext-link\">Figure 3</a> and <a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">Figure 4</a> respectively <a ref-type=\"bibr\" anchor=\"ref47\" id=\"context_ref_47_2d\">[47]</a>, <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_2d\">[48]</a>. There are software tools to do the measurement over the corresponding x-ray image data. In the context of the measurement, the vertebral bone that is most distant from the midline is defined as the apex. In order to be clear when defining the scoliosis curvature, the lower and upper end vertebrae, vertebral column level, direction and the angle of curvature should be specified. Since the Cobb angle measurement is widely determined as a result of the evaluations done by the physiotherapists, there are often differences among the measurements. Furthermore, the time for evaluations over the x-ray images are often different according to personal abilities belonging the physiotherapists. Because of these reasons, the human-side (expert-side) measurement is actually not a perfect task. So, it may be a good way to employ computational systems/ algorithms to deal with the measurement task, and maybe more further steps.\n<div class=\"figure figure-full\" id=\"fig3\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose3-3227763-large.gif\" data-fig-id=\"fig3\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose3-3227763-small.gif\" alt=\"FIGURE 3. - A Schematic view for the Cobb angle measurement in the diagnosis of scoliosis [47].\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 3. </b><fig><p>A Schematic view for the Cobb angle measurement in the diagnosis of scoliosis <a ref-type=\"bibr\" anchor=\"ref47\" id=\"context_ref_47_2d\">[47]</a>.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div>\n<div class=\"figure figure-full\" id=\"fig4\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose4-3227763-large.gif\" data-fig-id=\"fig4\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose4-3227763-small.gif\" alt=\"FIGURE 4. - Cobb angle measurement done over the x-ray image [48].\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 4. </b><fig><p>Cobb angle measurement done over the x-ray image <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_2d\">[48]</a>.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec2e\"><h3>E. The Schroth Method for Treatment</h3><p>As it was mentioned before, various methods are used for the treatment of scoliosis <a ref-type=\"bibr\" anchor=\"ref8\" id=\"context_ref_8_2e\">[8]</a>. In this context, the Schroth method is known as the widely used one as it is the fastest treatment planning opportunity. Katharina Schroth, who gave the name of that treatment method, had a spine with scoliosis. While trying to develop a more functional treatment method for herself, Katharina Schroth had worn a steel corset for years. During that time period, Katharina Schroth inspired by a balloon to try to correct the dimples in her body, by breathing in front of a mirror. In addition, she continued her treatment by watching the deformity in the mirror with the help of some corrective movements. She thought that postural control could be achieved by keeping a stable perception on the body. In time, Katharina Schroth had improved her treatment method and established the Katharina Schroth Clinic, where the Schroth method was known by the audience, as increasing its visibility <a ref-type=\"bibr\" anchor=\"ref49\" id=\"context_ref_49_2e\">[49]</a>, <a ref-type=\"bibr\" anchor=\"ref50\" id=\"context_ref_50_2e\">[50]</a>, <a ref-type=\"bibr\" anchor=\"ref51\" id=\"context_ref_51_2e\">[51]</a>.</p><p>In the Schroth method, the spine is examined by dividing it into three blocks. This approach is called as also Lehnert-Schroth classification. In detail, the related three blocks are determined as the Cervical (C), Thoracic (T) and Lumbar (L) regions (The first letters of the blocks are used in state definitions, as explained below) <a ref-type=\"bibr\" anchor=\"ref50\" id=\"context_ref_50_2e\">[50]</a>, <a ref-type=\"bibr\" anchor=\"ref51\" id=\"context_ref_51_2e\">[51]</a>.</p><p>Although the C-T-L blocks are on top of each other when viewed frontally in a healthy individual, they are located on top of each other rotated to the left and right in the case of scoliosis. Here, the Lehnert-Schroth classification (Schroth definition) is used to determine individual exercise and treatment plans. According to curvature way of the spine, different state definitions: T-Left, T-Right, L-Left, L-Right, T-Right L-Left (two scoliosis), and T-Left L-Right (two scoliosis) are made to plan the physical exercises for the patient. While T-Right L-Left exercises are also used in L-Left T-Right states, T-Left L-Right exercises may be used also in L-Right T-Left states (As it may be understood, multiple state names are for multiple curvatures in the spine). <a ref-type=\"fig\" anchor=\"fig5\" class=\"fulltext-link\">Figure 5</a> shows manually determined examples for L-Left, L-Left T-Right, T-Left, and L-Left, C-Left T-Right (three scoliosis) cases. During the exercises, the patients are wanted to take a deep breath and exhale by making a hissing sound. The purpose of that breathing is to increase the pulmonary (lung) capacity and ensure the maximum level of effectiveness <a ref-type=\"bibr\" anchor=\"ref51\" id=\"context_ref_51_2e\">[51]</a>, <a ref-type=\"bibr\" anchor=\"ref52\" id=\"context_ref_52_2e\">[52]</a>.\n<div class=\"figure figure-full\" id=\"fig5\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose5ab-3227763-large.gif\" data-fig-id=\"fig5\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose5ab-3227763-small.gif\" alt=\"FIGURE 5. - Schroth definition examples for L-Left (top-left), L-Left T-Right (top-right), T-Left (bottom-left), and L-Left, C-Left T-Right (bottom-right) cases [51].\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 5. </b><fig><p>Schroth definition examples for L-Left (top-left), L-Left T-Right (top-right), T-Left (bottom-left), and L-Left, C-Left T-Right (bottom-right) cases <a ref-type=\"bibr\" anchor=\"ref51\" id=\"context_ref_51_2e\">[51]</a>.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p><p>After the definition, the physical exercises are determined accordingly. The related physical exercises are always same for all defined cases. At this point, it is aimed to correct and improve the posture with asymmetrical standing exercises by keeping balance and stability. All the posture correction activities are supported by breathing exercises and it is aimed to provide posture control with the help of mirrors. <a ref-type=\"fig\" anchor=\"fig6\" class=\"fulltext-link\">Figure 6</a> shows examples of physical exercises for T-Right, T-Left, and T-Left L-Right cases. It is also remarkable that Schroth method needs different levels of same physical exercises for the patients with different height, weight, and age. These levels are with different day, set and repetition numbers.\n<div class=\"figure figure-full\" id=\"fig6\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose6abc-3227763-large.gif\" data-fig-id=\"fig6\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose6abc-3227763-small.gif\" alt=\"FIGURE 6. - Examples of physical exercises for T-Right (top), T-Left (middle), and T-Left L-Right (bottom) cases [51].\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 6. </b><fig><p>Examples of physical exercises for T-Right (top), T-Left (middle), and T-Left L-Right (bottom) cases <a ref-type=\"bibr\" anchor=\"ref51\" id=\"context_ref_51_2e\">[51]</a>.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec2f\"><h3>F. Motivation for a Decision Support System</h3><p>Decision support systems are effective tools to automate many human-side tasks and provide faster feedback in terms of the target problem. Considering the effectiveness of AI backend, it has become an essential need to ensure practical and efficient human-machine relation in many real-world applications. That’s even too critical when an automated decision support system can reduce needed energy and time to perform medical diagnosis and plan treatments. But the important thing here is to connect any steps through a tool running computational algorithms. In this study, the scoliosis case has separate steps to taken carefully. Although the Cobb angle measurement can be done through the effective Deep Learning models, there is still need for building the rest for an automated treatment planning. So, the big motivation is building a comprehensive decision support system for both diagnosis and treatment planning. Considering that, the additional motivation points of this study are as follows:\n<ul style=\"list-style-type:disc\"><li><p>It is a great contribution to not only literature but also for the physiotherapists (and even medical staff, experts… etc.) to have a generalized, complete decision support tool for diagnosis and treatment of scoliosis. Such a tool should be easy-to-use and ensure all required steps from diagnosis to treatment planning. Tracking a patient’s state is also a good contribution for managing the treatment flow.</p></li><li><p>Since the measurements done by physiotherapists are often different, an accurate diagnosis approach can be done via powerful Deep Learning models.</p></li><li><p>Evaluation of any Deep Learning model with set-up may be used for getting recent findings and understanding if a better solution can be built in terms of the target diagnosis problem, and the decision support solution.</p></li><li><p>Use of Deep Learning models need additional approaches to see if they are trustworthy for further usage. So, in the scoliosis case, the used Deep Learning model can be supported with interpretable views as well as XAI components to see if physiotherapists will find a decision support system safe.</p></li><li><p>The Schroth method is a widely used treatment planning approach for scoliosis. But there is not any complete patient-specific, automated decision system supporting physiotherapists with Schroth-based treatments. In the literature, more consideration has been given to the Lenke method. So, the Schroth method seems an open way to be included in a decision support system.</p></li><li><p>It is a good motivating factor to evaluate the built decision support system (of scoliosis) with both physiotherapists and patients.</p></li></ul></p><p>This study also examined the literature of Deep Learning (for scoliosis), to get more motivation for making this study beyond the latest advancements.</p></div></div>\n<div class=\"section\" id=\"sec3\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION III.</div><h2>Deep Learning for Scoliosis</h2></div><p>When the literature is examined, it is seen that there are different studies in terms of diagnosing the scoliosis. Some of these studies are based on using traditional Machine Learning techniques or some computational algorithms <a ref-type=\"bibr\" anchor=\"ref24\" id=\"context_ref_24_3\">[24]</a>, <a ref-type=\"bibr\" anchor=\"ref25\" id=\"context_ref_25_3\">[25]</a>, <a ref-type=\"bibr\" anchor=\"ref26\" id=\"context_ref_26_3\">[26]</a>, <a ref-type=\"bibr\" anchor=\"ref27\" id=\"context_ref_27_3\">[27]</a>, <a ref-type=\"bibr\" anchor=\"ref28\" id=\"context_ref_28_3\">[28]</a>, <a ref-type=\"bibr\" anchor=\"ref29\" id=\"context_ref_29_3\">[29]</a>, <a ref-type=\"bibr\" anchor=\"ref53\" id=\"context_ref_53_3\">[53]</a>, <a ref-type=\"bibr\" anchor=\"ref54\" id=\"context_ref_54_3\">[54]</a>, <a ref-type=\"bibr\" anchor=\"ref55\" id=\"context_ref_55_3\">[55]</a>. Because the origin of this study is associated with the use of Deep Learning, some remarkable studies with only Deep Learning use were reviewed as follows: In their study, Horng et al. implemented an automated system to measure spinal curvature using x-ray images. They segmented the vertebrae by using the CNN model and measured the Cobb angle. The obtained findings by the CNN were compared with the measurements by some physiotherapists and it was seen that there was no big difference <a ref-type=\"bibr\" anchor=\"ref47\" id=\"context_ref_47_3\">[47]</a>. The study contributes to the literature by having a nice comparative approach between intelligent systems and humans. On the other hand, Pan et al. proposed a solution in which two mask R-CNN models employed an automatic measurement approach on x-ray images <a ref-type=\"bibr\" anchor=\"ref56\" id=\"context_ref_56_3\">[56]</a>. They carried out their work within the framework of an application that generally focused on 248 images. The study presented an efficient automated measurement approach with R-CNN. The study is remarkable with its way for automated measurement with specific combination of R-CNN models. In another study, Zhang et al. developed a method to develop a computer-aided system for reducing the variability of Cobb angle measurements. By using a trained Deep Neural Network (DNN), the differences on the processed images and manual measurements were checked and it was stated that the differences could be reduced <a ref-type=\"bibr\" anchor=\"ref57\" id=\"context_ref_57_3\">[57]</a>. The study is critical in terms of contributing to the measurement errors and providing a practical solution through DNN architecture. As a specific approach in the literature, a good way to perform measurement is predicting spine positions. In this context, Choi et al. developed an automated system that can predict spine positions using a CNN and then automatically scan for predicted spine deformation in case of adolescent idiopathic scoliosis. This study is critical as it focuses on alternative datasets. In the study, Cobb angle was measured by the CNN, and the findings were compared with previous studies as well as the manual detections. Eventually, it was seen that there was a low error rate among the detections <a ref-type=\"bibr\" anchor=\"ref58\" id=\"context_ref_58_3\">[58]</a>. In the study by Mahesh et al., a CNN model was built to classify scoliosis cases. In terms of the whole applications, the CNN resulted accuracy values more than 90% <a ref-type=\"bibr\" anchor=\"ref59\" id=\"context_ref_59_3\">[59]</a>. In another remarkable study, Zhang et al. stated that the Cobb angle measurement for idiopathic scoliosis is very important for surgical planning and medical treatment. As similar to the alternative studies, they used a CNN for the Cobb angle measurement <a ref-type=\"bibr\" anchor=\"ref60\" id=\"context_ref_60_3\">[60]</a>. Although the surgery state is a specific topic, which may include additional research aspects <a ref-type=\"bibr\" anchor=\"ref26\" id=\"context_ref_26_3\">[26]</a>, <a ref-type=\"bibr\" anchor=\"ref61\" id=\"context_ref_61_3\">[61]</a>, <a ref-type=\"bibr\" anchor=\"ref62\" id=\"context_ref_62_3\">[62]</a>, <a ref-type=\"bibr\" anchor=\"ref63\" id=\"context_ref_63_3\">[63]</a>, the study by Zhang et al. considered the Cobb angle measurement as a starting point for understanding the criticality level. Thong et al. stated that the current classification systems for adolescent idiopathic scoliosis do not provide detailed information about the three-dimensional deformation of the spine. In order to solve this problem, they implemented a system for classification of three-dimensional (3D) spine reconstructions, by using Deep Learning models. They employed the Lenke method (which is another method like Schroth), and run the model on 155 patients with type-1 thoracic spinal deformation within scoliosis case <a ref-type=\"bibr\" anchor=\"ref64\" id=\"context_ref_64_3\">[64]</a>. The study is valuable to support the literature from 3D analysis of spine. In this case, the 3D representation data is a requirement to perform further research through AI. Considering treatment planning, Tan et al. developed an automatic scoliosis measurement system, which is based on Deep Learning. The study aimed to increase measurement accuracy and assist experts for treatments. In detail, they used a U-Net segmentation mesh to segment the spine radiographs. Next, the Cobb angles between the end plates of the upper vertebrae and the end plates of the lower vertebrae were measured accordingly. In the study, only Cobb angle detection were studied. So, no determination regarding scoliosis diagnosis were made <a ref-type=\"bibr\" anchor=\"ref65\" id=\"context_ref_65_3\">[65]</a>. Sabri et al. worked for the Lenke classification, by using a CNN model. The study differs from others by considering photogrammetry images for the classification purposes in Lenke method. In detail, the evaluations were done to determine the relationship between the different dimensions of the image data and the Lenke classification accuracy <a ref-type=\"bibr\" anchor=\"ref66\" id=\"context_ref_66_3\">[66]</a>. In another study with the Lenke classification, Anitha worked with Deep Learning to eliminate the observer errors <a ref-type=\"bibr\" anchor=\"ref67\" id=\"context_ref_67_3\">[67]</a>. The study by Anitha is another research showing the need for eliminating errors and ensuring automated tools in this manner. Yang et al. applied different Deep Learning models over scoliosis related images taken from 3240 patients. Except from the applications by Deep Learning, the study includes a comparative approach against human-side measurements. In this context, the study found that the measurements done by the Deep Learning models were more accurate than the detections by physiotherapists <a ref-type=\"bibr\" anchor=\"ref68\" id=\"context_ref_68_3\">[68]</a>. In a recent study by Kim et al., the region called vertebral-tilt was used to determine the measurement areas, and a solution with an average angle error of 3.51 and a percentage error of 7.84% was obtained via Deep Learning <a ref-type=\"bibr\" anchor=\"ref69\" id=\"context_ref_69_3\">[69]</a>. In another study, a CNN model was combined with Discriminant Analysis (DA) for an automated diagnosis of scoliosis <a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_3\">[70]</a>. The study is remarkable with a practical use of DA for improving the work by CNN. He et al. developed a Bilateral CNN model diagnosing scoliosis with an accuracy of 87.92% <a ref-type=\"bibr\" anchor=\"ref71\" id=\"context_ref_71_3\">[71]</a>. The study is a sample for the high interest and remarkable outcomes for the CNN model (and the variations) in very recent literature. In another study, an ultrasound-based scoliosis diagnosis was done via an automated tool with three-dimensional (3D) spine imaging and a CNN model <a ref-type=\"bibr\" anchor=\"ref72\" id=\"context_ref_72_3\">[72]</a>. The study showed very recent, alternative way for diagnosis of scoliosis through ultrasound and 3D imaging. By using a CNN model, a recent study by Caesarendra et al. showed that the Deep Learning was effective enough to compete with human-side manual measurements in terms of Cobb angle <a ref-type=\"bibr\" anchor=\"ref73\" id=\"context_ref_73_3\">[73]</a>. That means the recent research in 2022 supports the domination of Deep Learning (against the human) in scoliosis measurement. In their study, Wu et al. compared several models by including BoostNet and ConvNet as Deep Learning models in terms of automated measurement. The study is remarkable with its approach on evaluating two important Deep Learning models recently. In the study, the BoostNet showed better findings <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_3\">[74]</a>. Alharbi et al. used a ResNet-50 model to compare the automated measurements with manual detections, and they found small differences when the human-side detections and the Deep Learning findings were compared <a ref-type=\"bibr\" anchor=\"ref75\" id=\"context_ref_75_3\">[75]</a>. A very recent use of ResNet-50 model is with the study by Mohamed et al. but it belongs to only detection of scoliosis (not measurement or further analyzes) <a ref-type=\"bibr\" anchor=\"ref76\" id=\"context_ref_76_3\">[76]</a>. In another recent study, Amin et al. used EfficientNet-b7 and transfer learning to classify scoliosis cases and achieved an accuracy of 86% <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_3\">[77]</a>. In their recent study, Li et al. used different U-Net models to evaluate angle measurements done by Deep Learning perspective <a ref-type=\"bibr\" anchor=\"ref78\" id=\"context_ref_78_3\">[78]</a>. Recalling the CNN, a very recent study by Huang et al. compared their CNN model and manual measurements in terms of Cobb angle <a ref-type=\"bibr\" anchor=\"ref79\" id=\"context_ref_79_3\">[79]</a>. As result, the study showed that CNN usage is effective and efficient when the measurements are thought as time spending (when manually done) and including errors. In another very recent study, Sabri et al. designed a hybrid feature extraction method and used Evolving Spiking Neural Network (ESNN) model to get a fast classification solution for scoliosis. In the study, Local Binary Pattern (LBP), and 1D CNN was used for feature extraction purposes. The resulting LBP-1DCNN-ESNN system resulted an accuracy of 90% <a ref-type=\"bibr\" anchor=\"ref80\" id=\"context_ref_80_3\">[80]</a>. The study is a valuable recent touch in terms of improving speed and getting acceptable classification accuracies. As a different approach, the study by Yahara et al. predicted the progression of the scoliosis by using a Deep CNN (DCNN) model <a ref-type=\"bibr\" anchor=\"ref81\" id=\"context_ref_81_3\">[81]</a>. The study reported an accuracy of 69% for the employed model. In detail, transfer learning approach over the pretrained DCNN resulted to improved risk prediction accuracy in scoliosis progression. In another study including transfer learning, Fraiwan et al. employed many Deep Learning models for the scoliosis classification problem. The study used x-ray images to ensure scoliosis diagnosis without any measurement <a ref-type=\"bibr\" anchor=\"ref82\" id=\"context_ref_82_3\">[82]</a>. According to the comparative evaluations, the DenseNet-201 model achieved an average accuracy of 96.34%. It was followed by the ResNet-18 model, which provided an average accuracy of 95.13%. The study is remarkable as a very recent touch for comparing different Deep Learning models for the scoliosis diagnosis.</p><div class=\"section_2\" id=\"sec3a\"><h3>A. Motivation From the Literature</h3><p>It can be seen from the literature that use of Deep Learning has been showing good results in terms of scoliosis diagnosis. Many studies were done for angle measurement but there are also some studies in terms of specific purposes such as classifying scoliosis. Here, the key point is that the findings from Deep Learning models have been compared with human-side measurements/detections. However, the following motivations have been important for this study:\n<ul style=\"list-style-type:disc\"><li><p>Majority of the previous studies are associated with CNN-based models and they do not include further steps towards automated treatment planning for patients. Also, some of them consider only automated measurement (not diagnosis). So, use of a different Deep Learning model, comparing it with the literature, and finally, supporting it with a hybrid treatment planning component were thought as critical motivation factors.</p></li><li><p>As another motivating factor, it is still possible to build alternative, easy-to-use decision support system interfaces to interact with physiotherapists and come with trustworthy evaluation points to get more human-side feedback.</p></li><li><p>To the best of the authors’ knowledge, there is not a study including detailed patient feedback, after experiencing a treatment plan of a decision support system. There is not also a system considering exercise plans in terms of treatment.</p></li></ul></p><p>As per the motivations, the whole research steps followed in this study are shown in <a ref-type=\"fig\" anchor=\"fig7\" class=\"fulltext-link\">Figure 7</a>.\n<div class=\"figure figure-full\" id=\"fig7\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose7-3227763-large.gif\" data-fig-id=\"fig7\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose7-3227763-small.gif\" alt=\"FIGURE 7. - Research steps followed in this study.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 7. </b><fig><p>Research steps followed in this study.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p></div></div>\n<div class=\"section\" id=\"sec4\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION IV.</div><h2>CapsNet and Fuzzy Logic Based Decision Support System for Scoliosis</h2></div><p>In this study, a general decision support system was built by using Deep Learning and Fuzzy Logic synergy in a hybrid structure. Within that structure, different steps of angle measurement and treatment planning were combined to cover all phases where physiotherapists take active role (<a ref-type=\"fig\" anchor=\"fig8\" class=\"fulltext-link\">Figure 8</a>).\n<div class=\"figure figure-full\" id=\"fig8\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose8-3227763-large.gif\" data-fig-id=\"fig8\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose8-3227763-small.gif\" alt=\"FIGURE 8. - A general view of the decision support system structure.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 8. </b><fig><p>A general view of the decision support system structure.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p><p>In terms of the decision support system, the following steps were taken respectively:\n<ul style=\"list-style-type:disc\"><li><p><b>Step 1:</b> X-ray image belonging to the patient is received by the CapsNet model and the automated Cobb angle measurement is done over the image.</p></li><li><p><b>Step 2:</b> Considering the measured angle values, the system automatically determines Schroth definition.</p></li><li><p><b>Step 3:</b> Considering the Schroth definition, angle values, and patient-specific additional parameters, the system automatically determines the physical exercises, and the exercise levels (days-sets-repetitions) are automatically defined by the Fuzzy Logic component.</p></li><li><p><b>Step 4:</b> Based on the outcomes of the previous steps, the user (physiotherapists, or medical staff, expert… etc.) is able to act according to the decision support received.</p></li></ul></p><p>At the Cobb angle measurement step, the CapsNet was chosen as the Deep Learning model as CapsNet models have been reported better than CNN models, when it comes to the issues regarding pooling and recognizing displaced elements within image data <a ref-type=\"bibr\" anchor=\"ref34\" id=\"context_ref_34_4\">[34]</a>, <a ref-type=\"bibr\" anchor=\"ref35\" id=\"context_ref_35_4\">[35]</a>. In the context of the learning approach through routing-by-agreement, CapsNet employs capsule components, which are able to keep details of image data so resulting to a better detection at the end <a ref-type=\"bibr\" anchor=\"ref83\" id=\"context_ref_83_4\">[83]</a>, <a ref-type=\"bibr\" anchor=\"ref84\" id=\"context_ref_84_4\">[84]</a>. Since the detections to be done over x-ray images are critical for Cobb angle measurement in this study, a CapsNet model was designed for that purpose.</p><div class=\"section_2\" id=\"sec4a\"><h3>A. CapsNet for Cobb Angle Measurement</h3><p>The CapsNet model designed in this study was modeled for detecting the vertebral boundaries in x-ray image and resulting to Cobb angle measurements. In this context, the input data has been spine x-ray images whereas the output data is point determinations representing the vertebrae. The angle measurements were done automatically by using the point determinations over the input data. The model network structure was obtained through grid search hyper parameter optimization <a ref-type=\"bibr\" anchor=\"ref85\" id=\"context_ref_85_4a\">[85]</a> including model tries with sets of parameters (as running on the same scoliosis dataset explained in the next sub-title). <a ref-type=\"table\" anchor=\"table1\" class=\"fulltext-link\">Table 1</a> shows hyper parameter sets for the CapsNet model determination.<div class=\"figure figure-full table\" id=\"table1\"><div class=\"figcaption\"><b class=\"title\">TABLE 1 </b>\nGrid Search Hyper Parameter Sets for the CapsNet Model</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t1-3227763-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t1-3227763-small.gif\" alt=\"Table 1- &#10;Grid Search Hyper Parameter Sets for the CapsNet Model\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p><p>While determining the hyper parameter sets for modeling of the CapsNet, it was aimed to keep a balance in catching enough features but not losing any needed information from the processed input image. A total of top-10 CapsNet structure was chosen from the grid search results. These models were evaluated in the target dataset again and the best, final structure was taken to the next steps in terms of decision support system development and evaluations. The related CapsNet structure is briefly as follows:\n<ul style=\"list-style-type:disc\"><li><p>CapsNet model included 4 convolutional layers and 3 capsule layers in total. Additionally, the model was supported with CAM (Class Activation Mapping) for receiving XAI feedback <a ref-type=\"bibr\" anchor=\"ref86\" id=\"context_ref_86_4a\">[86]</a>.</p></li><li><p>After the first convolutional layer, a batch-normalization layer is positioned following the related layer. That layer is critical for faster but optimum training.</p></li><li><p>The average pooling layer is positioned behind the second convolutional layer</p></li><li><p>The fourth convolutional layer was revised to form the first capsule layer.</p></li><li><p>The remaining capsule layers are integrated into the model to support the routing-by-agreement process.</p></li></ul></p><p>For the final CapsNet structure, kernel initializer was found as uniform while batch size was 10, and the activation type was relu. The optimizer was Adam and the learning rate was considered as 0.001. The best routing value was found as 3. More details for the layers of the final model are indicated in <a ref-type=\"table\" anchor=\"table2\" class=\"fulltext-link\">Table 2</a>.<div class=\"figure figure-full table\" id=\"table2\"><div class=\"figcaption\"><b class=\"title\">TABLE 2 </b>\nDetails for the Layers of the Final CapsNet Model</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t2-3227763-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t2-3227763-small.gif\" alt=\"Table 2- &#10;Details for the Layers of the Final CapsNet Model\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p><p>As it is seen from <a ref-type=\"table\" anchor=\"table2\" class=\"fulltext-link\">Table 2</a>, the kernel size values of the layers were determined as per the requirement for deep analyze over input x-ray images. The model also hosts many convolutional layers and employs three capsule layers for improving quality of the output. If the input image data were easier to analyze, number of layers and the diversity of i.e. kernel size values would have been smaller or limited. But in the case of this study, the hyper parameter optimization resulted to an advanced organization of the CapsNet technique.</p><p>In order to locate the points for Cobb angle measurement, the CapsNet was set to produce 4 points for each of 17 vertebrae covering the thoracic and lumbar spine. That caused CapsNet to give a total of 68 points as the output (126 values according to the <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$x$\n</tex-math></inline-formula>, <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$y$\n</tex-math></inline-formula> locations). Moving from these points, the Cobb angle measurement approach by Alharbi et al. <a ref-type=\"bibr\" anchor=\"ref75\" id=\"context_ref_75_4a\">[75]</a> was used for automated angle determination. In detail, the following steps were applied accordingly <a ref-type=\"bibr\" anchor=\"ref75\" id=\"context_ref_75_4a\">[75]</a>:\n<ul style=\"list-style-type:disc\"><li><p><b>Step 1:</b> Considering 4 points of a vertebrae (a total of 8 values in <i>x-y</i> coordination), determine the corresponding center point (with <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$n$\n</tex-math></inline-formula> as the index of a vertebrae, a center point is <i>vn</i> <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$_{center\\_{}x}$\n</tex-math></inline-formula> and <i>vn</i> <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$_{center\\_{}y}$\n</tex-math></inline-formula>).</p></li><li><p><b>Step 2:</b> Starting from the top, detect the angle between two consecutive center points by using the following equation:<disp-formula id=\"deqn1\" class=\"display-formula\"><tex-math notation=\"LaTeX\">\\begin{align*} \\varphi ={90+tan}^{-1}\\left ({\\frac {vn2_{center\\_{}y}-{vn1}_{center\\_{}y}}{vn2_{center\\_{}x}-{vn1}_{center\\_{}x}} }\\right)\\ast 180/\\pi \\\\{}\\tag{1}\\end{align*}\n</tex-math><span class=\"formula\"><span class=\"link\">View Source</span><img aria-describedby=\"qtip-0\" style=\"display:inline;\" title=\"Right-click on figure or equation for MathML and additional features.\" data-hasqtip=\"0\" class=\"qtooltip moreInfo\" alt=\"Right-click on figure for MathML and additional features.\" src=\"/assets/img/icon.support.gif\" border=\"0\" height=\"20\" width=\"24\"/><span class=\"tex tex2jax_ignore\" style=\"display:none;\">\\begin{align*} \\varphi ={90+tan}^{-1}\\left ({\\frac {vn2_{center\\_{}y}-{vn1}_{center\\_{}y}}{vn2_{center\\_{}x}-{vn1}_{center\\_{}x}} }\\right)\\ast 180/\\pi \\\\{}\\tag{1}\\end{align*}\n</span></span></disp-formula> If <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\varphi $\n</tex-math></inline-formula> is bigger than 90 then subtract 180 from the <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\varphi $\n</tex-math></inline-formula> value. Apply the Step 2 until all center points end.</p></li><li><p><b>Step 3:</b> Find the Cobb angle by finding the difference between the max. <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\varphi $\n</tex-math></inline-formula> and the min <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\varphi $\n</tex-math></inline-formula>: max.(<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\varphi$\n</tex-math></inline-formula>) – min.(<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\varphi$\n</tex-math></inline-formula>).</p></li></ul></p><p>The points created over the vertebrae may be accepted as some interpretable outcomes for the CapsNet model. But they are associated with the final localizations not with the image regions considered by the model. So, as the additional XAI support, the CAM layer was used for catching the weighted feature maps and creating heat maps over the input image to reflect which regions were considered by the CapsNet model while creating the outputs (<a ref-type=\"fig\" anchor=\"fig10\" class=\"fulltext-link\">Figure 10</a>). Except from the CAM, also a representation of the processed x-ray image, where both measured values and the impact of each vertebra are shown (value-impact visualization), was provided over the developed decision support system. All interpretable and XAI-based features have been critical to obtain a trustworthy system.\n<div class=\"figure figure-full\" id=\"fig9\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose9-3227763-large.gif\" data-fig-id=\"fig9\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose9-3227763-small.gif\" alt=\"FIGURE 9. - A typical CapsNet model architecture [83].\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 9. </b><fig><p>A typical CapsNet model architecture <a ref-type=\"bibr\" anchor=\"ref83\" id=\"context_ref_83_4a\">[83]</a>.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div>\n<div class=\"figure figure-full\" id=\"fig10\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose10-3227763-large.gif\" data-fig-id=\"fig10\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose10-3227763-small.gif\" alt=\"FIGURE 10. - Integrating the CAM to deep learning models [86].\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 10. </b><fig><p>Integrating the CAM to deep learning models <a ref-type=\"bibr\" anchor=\"ref86\" id=\"context_ref_86_4a\">[86]</a>.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec4b\"><h3>B. Dataset</h3><p>In order to train the designed CapsNet model for angle measurement purposes (through points over 17 vertebrae), a scoliosis x-ray dataset from the 2019 MICCAI Workshop on Computational Methods and Clinical Applications for Spine Imaging event was used. Among the provided datasets, the dataset-16 was chosen to train the CapsNet model. That’s the dataset previously used in different studies such as Wu et al. <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_4b\">[74]</a>. It is known as a research dataset consisting of 609 anterior-posterior spine x-ray images. These include the images with healthy states and the existence of scoliosis.</p><p>In this study, a total of 10 physiotherapists with scoliosis certification took part in data pre-processing, application, and evaluation works. In order to make the dataset-16 ready for the study, one of the physiotherapists measured the Cobb angles over the x-ray images (with an imaging software) and classified them according to the Schroth definitions. So, each input image was associated with the outputs: angle values and Schroth definition(s). In order to eliminate any measurement and definition differences, the remaining 9 physiotherapists approved the pre-processed images. There was not any opposite feedback in terms of Schroth definitions. <a ref-type=\"fig\" anchor=\"fig11\" class=\"fulltext-link\">Figure 11</a> represents some of the measured x-ray images and their Schroth definitions (over images) made manually.\n<div class=\"figure figure-full\" id=\"fig11\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose11-3227763-large.gif\" data-fig-id=\"fig11\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose11-3227763-small.gif\" alt=\"FIGURE 11. - Some measured and classified x-ray images.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 11. </b><fig><p>Some measured and classified x-ray images.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec4c\"><h3>C. Fuzzy Logic for Treatment Planning</h3><p>The treatment planning in the decision support system was done via Fuzzy Logic technique. In order to ensure a fast and practical solution, the system used Schroth definitions to determine the physical exercises (as they are in standards already). At the same time, it also used the angle values from the CapsNet output to feed a Fuzzy Logic model so that day, set and repetition numbers for the exercise can be determined accurately. In terms of determining the parameters (variables, membership functions, rules… etc.), the physiotherapists’ expert knowledge was considered deeply. According to the physiotherapists in this study, the patients with several scoliosis or critical angle levels may need more days of exercises to ensure better impact in treatment. As general, they perform more exercises in this way. But sometimes, set and repetition numbers may be kept same to have shorter rehabilitation (or more days with less sets-repetitions for i.e. older patients). Depending on each patient’s characteristics, all the associated parameters should be analyzed for an effective enough exercise plan. Considering these, the Fuzzy Logic model was built with the Mamdani inferencing method <a ref-type=\"bibr\" anchor=\"ref87\" id=\"context_ref_87_4c\">[87]</a>. The following input and output variables (<a ref-type=\"fig\" anchor=\"fig12\" class=\"fulltext-link\">Figure 12</a>, and <a ref-type=\"fig\" anchor=\"fig13\" class=\"fulltext-link\">13</a>) were defined by 10 physiotherapists in the study:\n<ul style=\"list-style-type:disc\"><li><p><b>Input-1; Height (cm.):</b> Min. 50, Max. 200, five triangle memberships: very short, short, normal, tall, very tall.</p></li><li><p><b>Input-2; Weight (kg.):</b> Min. 5, Max. 150, five triangle memberships: very thin, thin, normal, fat, very fat.</p></li><li><p><b>Input-3; Age (year-old):</b> Min. 0, Max. 80, five triangle memberships: baby, child, adolescent, adult, old.</p></li><li><p><b>Input-4; (Cobb) Angle (with °):</b> Min. 0, Max. 100, five triangle memberships: very low, low, medium, high, very high.</p></li><li><p><b>Output-1; Day Count:</b> Min. 1, Max. 7, four triangle memberships: very few, few, high, very high.</p></li><li><p><b>Output-2; Set Count:</b> Min. 1, Max. 8, three triangle memberships: low, normal, high.</p></li><li><p><b>Output-3; Repetition Count:</b> Min. 3, Max. 15, five triangle memberships: very low, low, medium, high, very high.</p></li></ul>\n<div class=\"figure figure-full\" id=\"fig12\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose12-3227763-large.gif\" data-fig-id=\"fig12\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose12-3227763-small.gif\" alt=\"FIGURE 12. - Input variables of the Fuzzy Logic model for treatment planning.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 12. </b><fig><p>Input variables of the Fuzzy Logic model for treatment planning.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div>\n<div class=\"figure figure-full\" id=\"fig13\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose13-3227763-large.gif\" data-fig-id=\"fig13\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose13-3227763-small.gif\" alt=\"FIGURE 13. - Output variables of the Fuzzy Logic model for treatment planning.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 13. </b><fig><p>Output variables of the Fuzzy Logic model for treatment planning.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p><p>As based on the related input/output variables, the physiotherapists determined a total of 121 rules to employ an inferencing flow. <a ref-type=\"table\" anchor=\"table3\" class=\"fulltext-link\">Table 3</a> provides some of the rules. All input variables are connected with AND operator through simple triangle membership functions. For even the case of multiple scoliosis (spine curvatures), the system chooses the corresponding plans as there are specific exercises for multiple cases such as T-Right L-Left or T-Left L-Right. In the context of output side, real values are rounded automatically. All outcomes are for one week treatment plan. Such simple working mechanisms were done for ensuring practical information for treatment planning. Eventually, a Fuzzy Logic-based planning is run by using the physiotherapists’ knowledge. In detail, the determined parameters here may be increased (or new rules may be added) in case of more detailed treatment plans for i.e. only children or older people. All characteristics/parameters inside the Fuzzy Logic of this study were determined as a generalized approach.<div class=\"figure figure-full table\" id=\"table3\"><div class=\"figcaption\"><b class=\"title\">TABLE 3 </b>\nSome Rules Written for the Fuzzy Logic Model</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t3-3227763-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t3-3227763-small.gif\" alt=\"Table 3- &#10;Some Rules Written for the Fuzzy Logic Model\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p></div><div class=\"section_2\" id=\"sec4d\"><h3>D. Software Environment of the System</h3><p>The developed decision support system was built over some simple interfaces to ensure an appropriate interaction for users. In terms of the software development phase, the React framework, which allows cross-platform application development, was used accordingly. AI backend was coded with Python programming language by considering known libraries such as numpy for numerical analyzes, sklearn for specific data processing and Machine/Deep Learning evaluation purposes, scipy for scientific calculations, and matplotlib for visualizations. Also, OpenCV was used for image processing purposes. CapsNet model was coded with pure code but some support from Keras library was also used. In addition to the AI backend, user interfaces were supported with Node.js. Additionally, separate components in the software environment were connected each other through APIs. <a ref-type=\"fig\" anchor=\"fig14\" class=\"fulltext-link\">Figure 14</a> shows a general view for the coding aspects of the whole decision support system.\n<div class=\"figure figure-full\" id=\"fig14\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose14-3227763-large.gif\" data-fig-id=\"fig14\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose14-3227763-small.gif\" alt=\"FIGURE 14. - General view for the coding aspects of the decision support system.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 14. </b><fig><p>General view for the coding aspects of the decision support system.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p><p>In terms of the software system, some visibility issues were seen in mobile interfaces. But they were pretty good in PC environment. In terms of multiple platforms, all the backend of AI as well as data processing were observed as running successfully. <a ref-type=\"fig\" anchor=\"fig15\" class=\"fulltext-link\">Figure 15</a> represents the general software environment of the developed system. Considering the general environment seen in <a ref-type=\"fig\" anchor=\"fig15\" class=\"fulltext-link\">Figure 15</a>, a typical workflow over the system is done as follows:\n<ul style=\"list-style-type:disc\"><li><p><b>Processes over the x-ray image:</b> The overall interface is divided into three sub-interfaces from left to right. The user first creates a new project in the left sub-interface, to upload patient x-ray and allow CapsNet to automatically measure Cobb angles and make the Schroth definitions. All the points determined over the x-ray are viewed in the same interface. Opening of saved projects and further tasks regarding seeing details of angle values, Schroth definitions, file details… etc. may be done by using the other options here. Here, it is also possible to see CAM-based XAI outputs and the value-impact visualization (specifically prepared by the system) for the input x-ray image. That can be by clicking on the resulting image view. When the operations are done here, the user clicks on the Stage OK button to pass to the next stage.</p></li><li><p><b>Defining patient parameters:</b> The next stage in terms of software environment is feeding the system with patient information, by using the middle sub-interface. This sub-interface is also for adjusting general system settings and detailed adjustments of the technical components on the back. After the patient parameters for the Fuzzy Logic model are defined in this sub-interface, the user may click on the Stage OK button for the final stage.</p></li><li><p>Patient-specific treatment planning: The third stage is associated with the sub-interface on the right. After passing the previous stages, the system automatically views the standard physical exercises here. Additionally, details regarding the numbers for day-set-repetition plans may be seen by clicking on the View Details button. The user is also able to visualize Fuzzy Logic inferencing by clicking on the same button.</p></li><li><p><b>Tracking the progress:</b> If the checkings were saved properly, the system is able to also provide information about the progress of the scoliosis case. This can be done by clicking on the Details button in the middle sub-interface, after a new diagnosis and planning (<a ref-type=\"fig\" anchor=\"fig16\" class=\"fulltext-link\">Figure 16</a>). The related feature is based on the updated CapsNet and Fuzzy Logic outcomes for the associated patient case. The interface provides feedback with positive (green color) and negative (red color) views.</p></li></ul>\n<div class=\"figure figure-full\" id=\"fig15\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose15-3227763-large.gif\" data-fig-id=\"fig15\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose15-3227763-small.gif\" alt=\"FIGURE 15. - Software environment of the decision support system.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 15. </b><fig><p>Software environment of the decision support system.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div>\n<div class=\"figure figure-full\" id=\"fig16\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose16-3227763-large.gif\" data-fig-id=\"fig16\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose16-3227763-small.gif\" alt=\"FIGURE 16. - Tracking the progress for a patient.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 16. </b><fig><p>Tracking the progress for a patient.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p><p>In the context of this study, the developed system was used and passed through some evaluation phases. These were for understanding if the system is effective, trustworthy/safe, and easy-to-use for diagnosis, treatment planning and tracking purposes. The next section provides all details in this manner.</p></div></div>\n<div class=\"section\" id=\"sec5\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION V.</div><h2>Applications for the Scoliosis Diagnosis and Treatment</h2></div><p>After the development, the system was gone through some applications including evaluations. At first, evaluation of system outputs and comparative evaluations were done.</p><div class=\"section_2\" id=\"sec5a\"><h3>A. Evaluation of the System Outputs</h3><p>When the system was evaluated as single, it is possible to observe CapsNet and Fuzzy Logic outputs. Considering the final CapsNet model, <a ref-type=\"fig\" anchor=\"fig17\" class=\"fulltext-link\">Figure 17</a> shows some outputs as showing the 68 points determined over the vertebrae.\n<div class=\"figure figure-full\" id=\"fig17\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose17-3227763-large.gif\" data-fig-id=\"fig17\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose17-3227763-small.gif\" alt=\"FIGURE 17. - Outputs by the CapsNet as showing the points determined over the vertebrae.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 17. </b><fig><p>Outputs by the CapsNet as showing the points determined over the vertebrae.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p><p>As <a ref-type=\"fig\" anchor=\"fig17\" class=\"fulltext-link\">Figure 17</a> shows, the CapsNet seems successful in terms of determining the 4 points for each of 17 vertebrae covering the spine. These points are actually some interpretable outcomes to understand if the CapsNet is catching true vertebrae areas. The system determined the corresponding angle values and the Schroth definitions by considering the all 68 points. Success state of the CapsNet in them were determined in comparative and human-side evaluations. As it is also important to have a safe, sustainable Deep Learning model, the XAI views over input images were observed accordingly. That was for understanding if the model considers correct regions to look for point localizations. For the x-ray images in <a ref-type=\"fig\" anchor=\"fig17\" class=\"fulltext-link\">Figure 17</a>, the corresponding CAM outputs and value-impact visualization are shown in <a ref-type=\"fig\" anchor=\"fig18\" class=\"fulltext-link\">Figure 18</a>. Here, the CAM view (top) indicate which regions were considered while the CapsNet gives outputs for the 68 points of the vertebrae. On the other hand, the value-impact visualization (bottom) represents the angle value and the impact of each vertebra on this value (more impact tends to red color while less impact tends to green).\n<div class=\"figure figure-full\" id=\"fig18\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose18-3227763-large.gif\" data-fig-id=\"fig18\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose18-3227763-small.gif\" alt=\"FIGURE 18. - CAM view (top) and value-impact visualization (bottom) for the outcomes by the CapsNet model.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 18. </b><fig><p>CAM view (top) and value-impact visualization (bottom) for the outcomes by the CapsNet model.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p><p>Based on the <a ref-type=\"fig\" anchor=\"fig18\" class=\"fulltext-link\">Figure 18</a>, it is possible to express that the CapsNet model seems effective enough in focusing on true regions while detecting the points over the vertebrae. It was observed similar to all x-ray images in the dataset and there were not any signs for incorrect analyzes by the CapsNet model. In all x-ray images, regions for clear scoliosis cases were more seen in red color. It was understood that blue colored (lower) heat mappings were associated with the spine shape whereas colors towards higher heats (from green to yellow-orange-red) were with abnormal changes in spine shapes. Additionally, the value-impact visualization gave a better evaluation for how each vertebra was associated with the measured angle value(s). The visualizations in this manner were all correct during the applications. The system prepares this visualization by considering angle value(s) and the numerical CAM outcomes over the input x-ray image. With such a visualization, impact detections give idea about potential issues in different vertebra, as causing butterfly effect in the measured angle value(s). Eventually, three layers of trustworthiness: interpretable vertebrae detections, explainable CAM views, and the special value-impact visualization are provided so that the system sustainability may be tracked. The application outcomes showed that use of the related components/layers improved the value of the system in terms of being trustworthy.</p><p>Except from the CapsNet model, the treatment planning by the Fuzzy Logic was evaluated by 10 physiotherapists, by feeding the system with some old treatment plans completed before for 50 different patients. Before the exact human-side evaluations, the related patient parameters were tried to see if the system outputs matched with the old plans. It was reported by the physiotherapists that the system was totally accurate in terms of days but there were 7 different values of sets and repetitions. The different values were with only +1 or −1 so the Fuzzy Logic inferencing were acceptable for further applications.</p><p><a ref-type=\"table\" anchor=\"table4\" class=\"fulltext-link\">Table 4</a> shows angle measurements, Schroth definitions, and treatment plans done by the system for 10 different patients. These patients were with different genders (5 males and 5 females respectively) and unique height, weight, age values. As an example, <a ref-type=\"fig\" anchor=\"fig19\" class=\"fulltext-link\">Figure 19</a> represents the Fuzzy Logic visualization for the patient 1.<div class=\"figure figure-full table\" id=\"table4\"><div class=\"figcaption\"><b class=\"title\">TABLE 4 </b>\nSystem Outcomes for 10 Different Patients</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t4-3227763-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t4-3227763-small.gif\" alt=\"Table 4- &#10;System Outcomes for 10 Different Patients\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div>\n<div class=\"figure figure-full\" id=\"fig19\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose19-3227763-large.gif\" data-fig-id=\"fig19\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose19-3227763-small.gif\" alt=\"FIGURE 19. - The Fuzzy Logic inferencing for the patient 1.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 19. </b><fig><p>The Fuzzy Logic inferencing for the patient 1.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p><p>The findings in <a ref-type=\"table\" anchor=\"table4\" class=\"fulltext-link\">Table 4</a> were all correct according to old plans. They were also approved again by 10 physiotherapists. It is remarkable that the physiotherapists found the system accurate enough in terms of determining light or heavy exercise plans.</p><p>For evaluating the Fuzzy Logic planning more, some parameters for the past patients were simulated as changed in time. After changing some parameters, the outcomes for treatment plans were observed. <a ref-type=\"table\" anchor=\"table5\" class=\"fulltext-link\">Table 5</a> views some simulated parameters and the resulting plans (Changes are in bold style and green color for positive, red color for negative updates).<div class=\"figure figure-full table\" id=\"table5\"><div class=\"figcaption\"><b class=\"title\">TABLE 5 </b>\nSome Simulations for the Patients</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t5-3227763-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t5-3227763-small.gif\" alt=\"Table 5- &#10;Some Simulations for the Patients\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p><p>According to the physiotherapists, the simulation outcomes were correct in terms of the updated plans. Responses for especially changed angle values were appreciated by the physiotherapists. Increased angle values caused more intense treatments while the parameters changed in time (i.e. a child’s height or weight for everybody) caused partly positively and negatively updated plans. Similarly, with the increased age, a stable scoliosis case resulted negatively updated plan. Changes for age, height or weight were considered as positive or negative by the physiotherapists, according to a patient’s current well-being or developmental needs.</p></div><div class=\"section_2\" id=\"sec5b\"><h3>B. Comparative Evaluation for Measurement</h3><p>The previous findings are with the trained CapsNet model and the stable decision support system. Another evaluation work done synchronously was the comparative evaluation for Cobb angle measurement. In this way, it was aimed to determine the state of the CapsNet model against some competitors from the literature. The CapsNet model was compared with a total of ten models from the literature: ConvNet <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_5b\">[74]</a>, BoostNet <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_5b\">[74]</a>, ResNet-50 <a ref-type=\"bibr\" anchor=\"ref75\" id=\"context_ref_75_5b\">[75]</a>, EfficientNet-b7 <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_5b\">[77]</a>, U-Net <a ref-type=\"bibr\" anchor=\"ref78\" id=\"context_ref_78_5b\">[78]</a>, CNN <a ref-type=\"bibr\" anchor=\"ref79\" id=\"context_ref_79_5b\">[79]</a>, ESNN <a ref-type=\"bibr\" anchor=\"ref80\" id=\"context_ref_80_5b\">[80]</a>, DCNN <a ref-type=\"bibr\" anchor=\"ref81\" id=\"context_ref_81_5b\">[81]</a>, ResNet-18 <a ref-type=\"bibr\" anchor=\"ref82\" id=\"context_ref_82_5b\">[82]</a>, and DenseNet-201 <a ref-type=\"bibr\" anchor=\"ref82\" id=\"context_ref_82_5b\">[82]</a>. These models were chosen because of their effectiveness and timeliness. In the evaluation flow, all competitive models were built with their reported designs (including even feature extraction methods if existing) in the associated studies <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_5b\">[74]</a>, <a ref-type=\"bibr\" anchor=\"ref75\" id=\"context_ref_75_5b\">[75]</a>, <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_5b\">[77]</a>, <a ref-type=\"bibr\" anchor=\"ref78\" id=\"context_ref_78_5b\">[78]</a>, <a ref-type=\"bibr\" anchor=\"ref79\" id=\"context_ref_79_5b\">[79]</a>, <a ref-type=\"bibr\" anchor=\"ref80\" id=\"context_ref_80_5b\">[80]</a>, <a ref-type=\"bibr\" anchor=\"ref81\" id=\"context_ref_81_5b\">[81]</a>, <a ref-type=\"bibr\" anchor=\"ref82\" id=\"context_ref_82_5b\">[82]</a>. Although some models were used for different problems in their original studies, their reported designs were adapted to the problem/dataset in this study. All models used the same training and test data formations from the dataset-16 (in this study). The evaluation was done in an AAEON Jetson Nano BOXER system (model no: 8221AI-B1-1111) and all models were run 50 times in a total of 50.000 iterations of training (with Adam and learning rate 0.001) with 5-fold cross validation process. In each run, training and test datasets included 400, and 100 images respectively. In every run, the images were chosen randomly from the dataset-16. <a ref-type=\"fig\" anchor=\"fig20\" class=\"fulltext-link\">Figure 20</a> shows the training set <i>MSE</i> loss graphic for the average performance by the CapsNet model.\n<div class=\"figure figure-full\" id=\"fig20\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose20-3227763-large.gif\" data-fig-id=\"fig20\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose20-3227763-small.gif\" alt=\"FIGURE 20. - Training set MSE loss graphic for the average performance by the CapsNet model in 50 runs of 50.000 iterations.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 20. </b><fig><p>Training set <i>MSE</i> loss graphic for the average performance by the CapsNet model in 50 runs of 50.000 iterations.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p><p>The comparisons were made not only in terms of spine detections or classifications, but also in terms of the measurement of each model. It is very important to meet the comparison processes with known metrics. For this reason, two metrics: Mean Square of Error (<i>MSE</i>) and Pearson Correlation Coefficient (<i>PCC</i>: <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\rho$\n</tex-math></inline-formula>) were used. For each model, <a ref-type=\"table\" anchor=\"table6\" class=\"fulltext-link\">Table 6</a> shows average MSE and <i>PCC</i> (<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\rho$\n</tex-math></inline-formula>) obtained for training and test datasets (the best findings of <i>MSE</i> are in bold style).<div class=\"figure figure-full table\" id=\"table6\"><div class=\"figcaption\"><b class=\"title\">TABLE 6 </b>\nComparison of the Findings Regarding Spine Detection</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t6-3227763-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t6-3227763-small.gif\" alt=\"Table 6- &#10;Comparison of the Findings Regarding Spine Detection\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p><p><a ref-type=\"table\" anchor=\"table6\" class=\"fulltext-link\">Table 6</a> points that the CapsNet model in this study showed better outcomes in terms of average <i>MSE</i> and <i>PCC</i> (<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\rho$\n</tex-math></inline-formula>) values. It was followed by DenseNet-201, and ResNet-50 respectively. ResNet-50 is the only model, which is in top three but from a study two years ago. Except from that, the remaining ranks are dominated by the models from 2022.</p><p>In the comparison of the measurement results, four different angle differences (differences between model measurements and manual measurements) were taken into account. In this context, the Measurement Performance Score (<i>MPS</i>/<a ref-type=\"disp-formula\" anchor=\"deqn2\" href=\"#deqn2\" class=\"fulltext-link\">Eq. 2</a>) with a weighted sum where 100 points were shared in four levels of differences was defined. In the <i>MPS</i>, each difference in angles is represented by a letter (A: the difference below 3°, B: the difference below 5°, C: the difference equal to 5° or below 10°, and D: the difference equal to 10° or equal to and below 15°). More angles are with lower weights.<disp-formula id=\"deqn2\" class=\"display-formula\"><tex-math notation=\"LaTeX\">\\begin{align*} MPS = (A \\ast 0.6) + (B \\ast 0.25) + (C \\ast 0.1) + (D \\ast 0.05) \\\\{}\\tag{2}\\end{align*}\n</tex-math><span class=\"formula\"><span class=\"link\">View Source</span><img aria-describedby=\"qtip-0\" style=\"display:inline;\" title=\"Right-click on figure or equation for MathML and additional features.\" data-hasqtip=\"0\" class=\"qtooltip moreInfo\" alt=\"Right-click on figure for MathML and additional features.\" src=\"/assets/img/icon.support.gif\" border=\"0\" height=\"20\" width=\"24\"/><span class=\"tex tex2jax_ignore\" style=\"display:none;\">\\begin{align*} MPS = (A \\ast 0.6) + (B \\ast 0.25) + (C \\ast 0.1) + (D \\ast 0.05) \\\\{}\\tag{2}\\end{align*}\n</span></span></disp-formula></p><p>In addition to these findings, <a ref-type=\"table\" anchor=\"table7\" class=\"fulltext-link\">Table 7</a> shows the findings for the <i>MPS</i> (the best <i>MPS</i> is in bold style). That <i>MPS</i> evaluation was critical for understanding the success of each model in Cobb angle measurements. The <i>MPS</i> calculation was done for the test dataset (100 images), and the average value for 50 runs was found. For clear <i>MPS</i>, average differences were rounded.<div class=\"figure figure-full table\" id=\"table7\"><div class=\"figcaption\"><b class=\"title\">TABLE 7 </b>\nComparison of Differences in Cobb Measurement Findings</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t7-3227763-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t7-3227763-small.gif\" alt=\"Table 7- &#10;Comparison of Differences in Cobb Measurement Findings\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p><p>As <a ref-type=\"table\" anchor=\"table7\" class=\"fulltext-link\">Table 7</a> points, the CapsNet model achieved the highest <i>MPS</i>. It was followed by DenseNet-201, and ESNN. As different from the spine detection findings, ESNN was better than ResNet-50 in angle measurement. That may be because of the hybrid feature extraction capabilities (LBP and 1DCNN) in ESNN.</p><p>Because the images in this study are automatically defined with Schroth definitions (T-Left, T-Right, L-Left… etc.), all the models were compared according to their classification performance as well. After the measurement phase, the models were allowed to define the scoliosis cases. For evaluation purposes, average findings (for 50-run) of the chosen metrics were considered for the test dataset (100 images). In this context, the following metrics were used in accordance with multi-class classification findings <a ref-type=\"bibr\" anchor=\"ref88\" id=\"context_ref_88_5b\">[88]</a>, <a ref-type=\"bibr\" anchor=\"ref89\" id=\"context_ref_89_5b\">[89]</a>, <a ref-type=\"disp-formula\" anchor=\"deqn3-deqn7\" href=\"#deqn3-deqn7\" class=\"fulltext-link\">(3)–(7)</a>, as shown at the bottom of the next page, <disp-formula id=\"deqn3-deqn7\" class=\"display-formula\"><tex-math notation=\"LaTeX\">\\begin{align*} Accuracy=&amp;\\frac {tp+tn}{tp+tn+fp+fn} \\tag{3}\\\\ MacroAveragePrecision=&amp;\\frac {\\sum \\nolimits _{c=1}^{Cl} \\frac {tp_{c}}{tp_{c}+{fp}_{c}}}{Cl} \\tag{4}\\\\ MacroAverageRecall=&amp;\\frac {\\sum \\nolimits _{c=1}^{Cl} \\frac {tp_{c}}{tp_{c}+{fn}_{c}}}{Cl} \\tag{5}\\\\ MacroF1Score=&amp;2\\ast \\left ({\\frac {\\mathrm {MacroAveragePrecision \\ast MacroAverageRecall}}{{\\mathrm {MacroAveragePrecision}}^{-1}\\mathrm {+ }{\\mathrm {MacroAverageRecall}}^{-1}} }\\right) \\tag{6}\\\\ MicroF1Score=&amp;\\frac {\\sum \\nolimits _{c=1}^{Cl} {tp}_{c}}{GrandTotal_{c}}\\tag{7}\\end{align*}\n</tex-math><span class=\"formula\"><span class=\"link\">View Source</span><img aria-describedby=\"qtip-0\" style=\"display:inline;\" title=\"Right-click on figure or equation for MathML and additional features.\" data-hasqtip=\"0\" class=\"qtooltip moreInfo\" alt=\"Right-click on figure for MathML and additional features.\" src=\"/assets/img/icon.support.gif\" border=\"0\" height=\"20\" width=\"24\"/><span class=\"tex tex2jax_ignore\" style=\"display:none;\">\\begin{align*} Accuracy=&amp;\\frac {tp+tn}{tp+tn+fp+fn} \\tag{3}\\\\ MacroAveragePrecision=&amp;\\frac {\\sum \\nolimits _{c=1}^{Cl} \\frac {tp_{c}}{tp_{c}+{fp}_{c}}}{Cl} \\tag{4}\\\\ MacroAverageRecall=&amp;\\frac {\\sum \\nolimits _{c=1}^{Cl} \\frac {tp_{c}}{tp_{c}+{fn}_{c}}}{Cl} \\tag{5}\\\\ MacroF1Score=&amp;2\\ast \\left ({\\frac {\\mathrm {MacroAveragePrecision \\ast MacroAverageRecall}}{{\\mathrm {MacroAveragePrecision}}^{-1}\\mathrm {+ }{\\mathrm {MacroAverageRecall}}^{-1}} }\\right) \\tag{6}\\\\ MicroF1Score=&amp;\\frac {\\sum \\nolimits _{c=1}^{Cl} {tp}_{c}}{GrandTotal_{c}}\\tag{7}\\end{align*}\n</span></span></disp-formula> where <i>tp</i> is for total number of true positives, <i>tn</i> is for total number of true negatives, <i>fp</i> is for total number of false positives, and <i>fn</i> is for total number of false negatives. Also, <i>Cl</i> stands for total number of classes while <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$c$\n</tex-math></inline-formula> is for the specific class index. Finally, <i>GrandTotal</i> is for the total predictions through rows and columns (considering confusion matrix) for the associated class.</p><p><a ref-type=\"table\" anchor=\"table8\" class=\"fulltext-link\">Table 8</a> shows average multi-class classification findings (the best findings are in bold style). Next, <a ref-type=\"fig\" anchor=\"fig21\" class=\"fulltext-link\">Figure 21</a> represents a graphical view for the findings in <a ref-type=\"table\" anchor=\"table8\" class=\"fulltext-link\">Table 8</a>.<div class=\"figure figure-full table\" id=\"table8\"><div class=\"figcaption\"><b class=\"title\">TABLE 8 </b>\nComparison of the Findings Regarding Classification of scoliosis</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t8-3227763-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t8-3227763-small.gif\" alt=\"Table 8- &#10;Comparison of the Findings Regarding Classification of scoliosis\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div>\n<div class=\"figure figure-full\" id=\"fig21\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose21-3227763-large.gif\" data-fig-id=\"fig21\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose21-3227763-small.gif\" alt=\"FIGURE 21. - Graphical view for the comparative classification findings.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 21. </b><fig><p>Graphical view for the comparative classification findings.</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p><p>As it can be seen from <a ref-type=\"table\" anchor=\"table8\" class=\"fulltext-link\">Table 8</a>, the CapsNet model in this study resulted better accuracy than other models. It also had the highest findings for all metrics. The high <i>Macro F1Score</i> means it had good classification for all classes. In terms of accuracy, the CapsNet was followed by DenseNet-201, and ResNet-50 respectively. DenseNet-201 had the same <i>Macro Average Precision</i> finding with the CapsNet. Because every test data corresponds to exactly one class, <i>Micro F1 Score</i> was always equal to the <i>Accuracy</i> in the case of this study.</p><p>In addition to the classification findings by the CapsNet model, <a ref-type=\"fig\" anchor=\"fig22\" class=\"fulltext-link\">Figure 22</a> shows the confusion matrix for the average performance.\n<div class=\"figure figure-full\" id=\"fig22\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose22-3227763-large.gif\" data-fig-id=\"fig22\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose22-3227763-small.gif\" alt=\"FIGURE 22. - Confusion matrix for the average performance by the CapsNet model (for the test dataset).\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 22. </b><fig><p>Confusion matrix for the average performance by the CapsNet model (for the test dataset).</p></fig></div><p class=\"links\"><a href=\"/document/9975279/all-figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec5c\"><h3>C. Human-Side Evaluation of the System</h3><p>After passing through two previous synchronous evaluation works, the decision support system was used by 10 physiotherapists during the treatments for 10 patients. This evaluation was about use of the system in real scenarios to get human-side feedback. It was three months to finish all treatments. The 10 patients included 5 males, 5 females, as 2 children, 2 adolescents, 4 adults, and 2 old people. They were not associated with the patients whose old treatment plans were evaluated before (<a ref-type=\"table\" anchor=\"table4\" class=\"fulltext-link\">Table 4</a>). During that evaluation work, the physiotherapists had the chance to evaluate the system in terms of diagnosis, treatment planning, general performance, trustworthiness/safety (XAI), tracking the patients, and further usage. They were first asked to give responses to a survey. Additionally, some findings from the interview work were gathered. On the other hand, the patients, who knew that they were receiving AI-assisted treatment, evaluated the treatment process (therefore the system) with a survey work. For the survey works, the evaluations were done via Likert Scale-based responses.</p><p><a ref-type=\"table\" anchor=\"table9\" class=\"fulltext-link\">Table 9</a> shows the statements and the received responses for the physiotherapists’ survey.<div class=\"figure figure-full table\" id=\"table9\"><div class=\"figcaption\"><b class=\"title\">TABLE 9 </b>\nFindings for the Physiotherapists’ Survey</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t9-3227763-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t9-3227763-small.gif\" alt=\"Table 9- &#10;Findings for the Physiotherapists’ Survey\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p><p>According to <a ref-type=\"table\" anchor=\"table9\" class=\"fulltext-link\">Table 9</a>, the physiotherapists were happy in terms of diagnosis of scoliosis, Cobb angle measurements, and the taken decisions by the system (There were no negative response for the related statements). According to the responses for statement 4 and 5, the system was found trustworthy enough. These points also that the interpretable views and XAI features were effective to track the system trustworthiness and safety. The physiotherapists were happy about also treatment plans and the feedback by the patients. The system was found also usable as well as understandable, and its running performance was not bad, according to responses by the physiotherapists.</p><p>The interview work was done after the physiotherapists used the system one month more. They were asked to express their opinions regarding three aspects: the whole system, Deep Learning side (Cobb measurement and diagnosis), and the Fuzzy Logic side (treatment planning). The interview questions were shaped according to specific feedback requirements for each aspect. That was for catching some more specific feedback for separate effects by automated diagnosis as well as treatment planning. Some questions were for getting answers that may briefly classified with <b>‘Yes’</b>, <b>‘No’</b>, or <b>‘Not Sure’</b> feedback. On the other hand, some questions were for revealing some reasons for using the system and different components. After analyzing the long interview responses, the reasons were found to be classified with the words:\n<ul style=\"list-style-type:disc\"><li><p><b>‘Time Saving’:</b> The system achieves time saving.</p></li><li><p><b>‘Cost Saving’:</b> The system achieves saving in costs.</p></li><li><p><b>‘Practicality’:</b> The system allows practical solutions.</p></li><li><p><b>‘Educational’:</b> The Fuzzy Logic system may be used for educational purposes.</p></li><li><p><b>‘Tracking’:</b> The system or the component is effective for patient tracking.</p></li><li><p><b>‘Confirmation’:</b> The system or the component is effective for confirming manual diagnosis or treatment.</p></li><li><p><b>‘AI Support’:</b> The system is valuable with the AI support inside it.</p></li><li><p><b>‘Accurate Diagnosis’:</b> The system has accurate diagnosis.</p></li><li><p><b>‘Accurate Treatment’:</b> The system has accurate treatment (planning).</p></li></ul></p><p>The related words were just brief meaning of long interview comments and used effectively for getting remarkable findings.</p><p><a ref-type=\"table\" anchor=\"table10\" class=\"fulltext-link\">Table 10</a> represents the interview questions and view of the responses by each physiotherapist. Different response words are with different colors to reflect a visual picture for the interview outcomes.<div class=\"figure figure-full table\" id=\"table10\"><div class=\"figcaption\"><b class=\"title\">TABLE 10 </b>\nFindings for the Interview Work Done With the Physiotherapists</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t10-3227763-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t10-3227763-small.gif\" alt=\"Table 10- &#10;Findings for the Interview Work Done With the Physiotherapists\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p><p><a ref-type=\"table\" anchor=\"table10\" class=\"fulltext-link\">Table 10</a> generally points remarkable and interesting human perspectives on the developed system. It was thought that the system is effective in terms of ensuring better diagnosis/treatment, saving time, and saving costs. However, it was also seen that especially Fuzzy Logic component was found to be effective for even educational purposes. That was same also for the Deep Learning-based diagnosis (CapsNet) according to a few physiotherapists. Furthermore, the interview revealed again the physiotherapists want to see practicality in their works. Also, it was seen that they want to be confirmed/supported by an advanced technology, track the patients (with the support by technology), and of course get accurate diagnosis and treatment. On the other hand, the physiotherapists generally agree that this study may be extended and additional studies may be done. Physiotherapists think that the scoliosis have multiple, sometimes mysterious reasons that can be always studied through different perspectives. Finally, all physiotherapists agree on the AI support value in the system.</p><p>The other side of the human-side evaluation included patients with the survey work. <a ref-type=\"table\" anchor=\"table11\" class=\"fulltext-link\">Table 11</a> shows the statements and the responses for the patients’ survey work.<div class=\"figure figure-full table\" id=\"table11\"><div class=\"figcaption\"><b class=\"title\">TABLE 11 </b>\nFindings for the Patients’ Survey</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t11-3227763-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975279/kose.t11-3227763-small.gif\" alt=\"Table 11- &#10;Findings for the Patients’ Survey\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p><p><a ref-type=\"table\" anchor=\"table11\" class=\"fulltext-link\">Table 11</a> findings show that the patients were satisfied in terms of the applied treatment plans. It is critical that the plans determined by the decision support system did not force the patients and make them feeling tired. According to the patient responses, there were no changes done by the physiotherapist, meaning that the physiotherapists trusted to decisions made by the system.</p></div></div>\n<div class=\"section\" id=\"sec6\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION VI.</div><h2>Discussion</h2></div><p>When the all research is considered widely, it can be said that the study reached to positive results and the developed system received positive feedback generally. By making some connections to the literature as well, more additional discussions can be made as follows:\n<ul style=\"list-style-type:disc\"><li><p>The study has shown the effectiveness of AI to build comprehensive decision support systems for specific medical problems. Here, the Deep Learning models are great tools to deal with medical images and process such data in detail for accurate, automated decision-support.</p></li><li><p>In the literature, studies such as <a ref-type=\"bibr\" anchor=\"ref47\" id=\"context_ref_47_6\">[47]</a>, <a ref-type=\"bibr\" anchor=\"ref56\" id=\"context_ref_56_6\">[56]</a>, <a ref-type=\"bibr\" anchor=\"ref58\" id=\"context_ref_58_6\">[58]</a>, <a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_6\">[70]</a>, <a ref-type=\"bibr\" anchor=\"ref71\" id=\"context_ref_71_6\">[71]</a>, <a ref-type=\"bibr\" anchor=\"ref72\" id=\"context_ref_72_6\">[72]</a>, and <a ref-type=\"bibr\" anchor=\"ref79\" id=\"context_ref_79_6\">[79]</a> used CNN models. There is also use of DNN as done by <a ref-type=\"bibr\" anchor=\"ref57\" id=\"context_ref_57_6\">[57]</a>. Following these, recent studies such as <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_6\">[74]</a>, <a ref-type=\"bibr\" anchor=\"ref75\" id=\"context_ref_75_6\">[75]</a>, <a ref-type=\"bibr\" anchor=\"ref76\" id=\"context_ref_76_6\">[76]</a>, <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_6\">[77]</a>, <a ref-type=\"bibr\" anchor=\"ref78\" id=\"context_ref_78_6\">[78]</a>, <a ref-type=\"bibr\" anchor=\"ref81\" id=\"context_ref_81_6\">[81]</a>, and <a ref-type=\"bibr\" anchor=\"ref82\" id=\"context_ref_82_6\">[82]</a> considered specific variations of the CNN (ConvNet, BoostNet, EfficientNet-b7, U-Net, DCNN, DenseNet-201… etc.). However, it seems that especially recent models are with bigger structures. On the other hand, this study achieved positive results by using an interpretable and explainable, trustworthy CapsNet model. It is critical that the used CapsNet model provided better results than recent models of <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_6\">[74]</a>, <a ref-type=\"bibr\" anchor=\"ref75\" id=\"context_ref_75_6\">[75]</a>, <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_6\">[77]</a>, <a ref-type=\"bibr\" anchor=\"ref78\" id=\"context_ref_78_6\">[78]</a>, <a ref-type=\"bibr\" anchor=\"ref79\" id=\"context_ref_79_6\">[79]</a>, <a ref-type=\"bibr\" anchor=\"ref80\" id=\"context_ref_80_6\">[80]</a>, <a ref-type=\"bibr\" anchor=\"ref81\" id=\"context_ref_81_6\">[81]</a>, and <a ref-type=\"bibr\" anchor=\"ref82\" id=\"context_ref_82_6\">[82]</a>.</p></li><li><p>This study provided a general decision support framework by building a hybrid approach with CapsNet and Fuzzy Logic. When the literature is examined, it can be seen that research works focused on specific solutions for scoliosis. Studies such as <a ref-type=\"bibr\" anchor=\"ref47\" id=\"context_ref_47_6\">[47]</a>, <a ref-type=\"bibr\" anchor=\"ref56\" id=\"context_ref_56_6\">[56]</a>, <a ref-type=\"bibr\" anchor=\"ref57\" id=\"context_ref_57_6\">[57]</a>, <a ref-type=\"bibr\" anchor=\"ref68\" id=\"context_ref_68_6\">[68]</a>, <a ref-type=\"bibr\" anchor=\"ref73\" id=\"context_ref_73_6\">[73]</a>, and <a ref-type=\"bibr\" anchor=\"ref75\" id=\"context_ref_75_6\">[75]</a> are remarkable as they aimed Cobb angle measurement and comparisons with human-side values. Even, the study <a ref-type=\"bibr\" anchor=\"ref65\" id=\"context_ref_65_6\">[65]</a> performed just angle measurements. So, the decision support system provided here is one step ahead of alternative studies by confirming accurate measurements by Deep Learning, successful outcomes in terms of diagnosis, and ensuring a patient-specific treatment planning, which has not been done yet (to the best of the authors’ knowledge).</p></li><li><p>It is remarkable that studies such as <a ref-type=\"bibr\" anchor=\"ref66\" id=\"context_ref_66_6\">[66]</a> and <a ref-type=\"bibr\" anchor=\"ref67\" id=\"context_ref_67_6\">[67]</a> followed the Lenke method for classifying the scoliosis cases. Except from angle measurement works, such classification studies are critical for diagnosis and treatment cases. As different, this study worked with the Schroth method and achieved a direct physical exercise planning, as taking some more steps to the patient.</p></li><li><p>The Fuzzy Logic model used in this study was just a simple touch but it allowed achieving accurate enough exercise plans done automatically for target patients. In such physical exercise plans, treatment days or sets may play vital role in terms of individual well-being. So, this study followed that motivation to build the related solution. In detail, the Fuzzy Logic responses as well as simulation outcomes for past patients were found remarkable for determining careful exercises. Although it was a simple approach, one interesting result was that the physiotherapists found the Fuzzy Logic component as an educational and practical tool for treatment planning. They also found that tracking patients with the combined outputs by CapsNet and Fuzzy Logic was valuable in getting an effective tool and saving time.</p></li><li><p>This study is important in terms of evaluating the developed solution with both physiotherapists and patients in real-world cases. Just before these, the system components were evaluated from also alternative perspectives. The human-side evaluations were critical to have many feedback in terms of effectiveness, usability, and even trustworthiness (interpretable aspects and XAI) of such complete diagnosis-treatment tool. As a result of positive responses, the system was found not only valuable, practical, effective, time/cost saver or confirmatory but also trustworthy. In addition to needs for practicality, time/cost saving… etc., ensuring a trustworthy decision support system is an urgent need nowadays. So, this study has a critical outcome in this manner.</p></li></ul></p><div class=\"section_2\" id=\"sec6a\"><h3>A. Research Gaps and Suggestions</h3><p>Following the performed research, it is still possible to express some research gaps for this study. These gaps may be accepted as also suggestions for interested researchers:\n<ul style=\"list-style-type:disc\"><li><p>The study included the use of a specific dataset including x-ray images. So, additional use of the system in more datasets will result additional confidence in the results. In alternative studies, different datasets including scoliosis cases with diversity (i.e. age, gender, locations of patients, life style, habits) may be tested accordingly. Also, alternative Machine/Deep Learning models, and decision support systems may be applied to different scoliosis datasets.</p></li><li><p>Use of the system was with physiotherapists and patients living in Isparta city of Turkey. So, the system may be applied in different locations to see if the human-side perceptions and experiences differs. Furthermore, total number of people for evaluations may be increased, too. In this way, more data from patients’ experiences can be collected. Also, alternative studies may find interesting results for different physiotherapists and patients. Because each physiotherapist’s past experiences may affect priorities for using AI support in scoliosis diagnosis-treatment. On the other hand, patients with different characteristics and habits may give specific feedback for applications with AI.</p></li><li><p>This study aimed to plan treatments via only Schroth method (That’s an important motivation factor of this study). But alternative systems with a different method (Lenke, Dobomed, Lyonnaise, Side Shift… etc.) or even multiple methods may be considered for new studies. Such studies may include detailed evaluation works to see which treatment method can be used effectively in AI setup.</p></li><li><p>The study used Fuzzy Logic to determine exercise details by considering height, weight and age values. In order to determine a more specific treatment flow, more data from a patient may be used. So, the current solution may be extended with more variables, updated membership functions and rules. Also, the Fuzzy Logic may suggest same sets of exercises for the patients with different life style, past health issues… etc. In alternative studies, more complicated patient data may be used to extend the determination of exercises.</p></li><li><p>In this study, automated treatment planning was made according to only scoliosis exercises. That was thought as a practical solution for physiotherapists. However, alternative studies including use of different treatment ways or tools may be done in the context of automated AI support.</p></li><li><p>The cases including surgery level, at which exercises are not enough, or analysis works for a surgery are out of the scope of this study. So, alternative studies may focus on AI-based applications regarding surgeries in critical scoliosis levels.</p></li><li><p>In the decision support system of this study, a specific CapsNet model was used to detect scoliosis cases. Although the model showed effective findings, it is still possible to test alternative architectures, parameters to see if there is a room for improving the results more. Alternative studies may include use of different Deep Learning models or including additional optimizations (using i.e. different hyper parameter optimization methods or intelligent optimization algorithms) for new research in terms of scoliosis diagnosis. Similarly, automated treatment plannings may be done with alternative techniques.</p></li></ul></p></div></div>\n<div class=\"section\" id=\"sec7\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION VII.</div><h2>Conclusion</h2></div><p>This study introduced a decision support system, which aims diagnosis and treatment planning of scoliosis. As it is a serious disease with individual treatment differences, physiotherapists need to measure curvature angles and plan some physical exercises for treatment flow. At this point, an automated system is a very effective tool to help them. The decision support system developed in this study included a CapsNet model, as a Deep Learning-based solution for automated Cobb angle measurement. In addition to that, the system was also built over the Schroth method, which is a widely used treatment planning. The system was also supported with a Fuzzy Logic model to create patient-specific physical exercise plans by considering the angle values as well as patients’ age, height, and weight parameters. In order to ensure a safe, trustworthy decision-making tool, the CapsNet was supported with interpretable views and XAI extensions by using the CAM. In terms of the applications and the performed evaluation works, it was seen that the system is effective enough in both diagnosis and treatment planning of scoliosis. In comparative evaluations, the CapsNet model showed better outcomes than the competitive models from the literature. Domination of the CapsNet was seen in the findings for not only automated measurement but also for differences with the original angle values, and multi-class classification performance. Additionally, the Fuzzy Logic model was evaluated as positive in treatment planning for past cases and some changed situations simulated specifically. Finally, a total of 10 physiotherapists gave positive feedback in terms of the survey work asking about experiences regarding the real use of the system for 10 patients. Also, the interview work for the physiotherapists confirmed and revealed more details about the system and the employed components. On the other hand, the 10 patients were positive about the treatments planned by the system. With its additional efforts in terms of the research, the authors think that this study gave remarkable, recent outcomes for the literature of AI for scoliosis. More specifically, it also had some novelties in terms of Schroth method usage, hybrid decision support system development, and alternative evaluations. Furthermore, the study also gives positive signs for further research on medical image-oriented studies, and different diseases requiring physical exercises and expert decision-support in treatment planning.</p><p>Following to that study, the authors have already motivated in some future works. It is certain that additional studies will be done by considering the research gaps indicated under the previous section. In addition to that, there will be more works on the same system to apply it in more cases with new patient data. Also, it was planned to include more patient parameters in both diagnosis and treatment planning stages, to see if there will be remarkable differences in outcomes. Finally, the design of the system will be modified with alternative Deep Learning models, supportive Machine Learning and rule-based techniques, and some more tracking features to improve functional capabilities.</p></div>\n<div class=\"section\" id=\"sec8\"><div class=\"header article-hdr\"><h2>Conflict of Interest</h2></div><p>None of the authors have a conflict of interest to disclose.</p></div>\n</div></div></response>\n"
}