{
    "abstract": "Flying networks, composed of Unmanned Aerial Vehicles (UAVs) acting as mobile Base Stations and Access Points, have emerged to provide on-demand wireless connectivity, especially due to their positioning capability. Still, existing solutions are focused on improving aggregate network performance using a best-effort approach. This may compromise the use of multiple services with different performan...",
    "articleNumber": "9975290",
    "articleTitle": "An Algorithm for Placing and Allocating Communications Resources Based on Slicing-Aware Flying Access and Backhaul Networks",
    "authors": [
        {
            "preferredName": "André Coelho",
            "normalizedName": "A. Coelho",
            "firstName": "André",
            "lastName": "Coelho",
            "searchablePreferredName": "André Coelho"
        },
        {
            "preferredName": "João Rodrigues",
            "normalizedName": "J. Rodrigues",
            "firstName": "João",
            "lastName": "Rodrigues",
            "searchablePreferredName": "João Rodrigues"
        },
        {
            "preferredName": "Helder Fontes",
            "normalizedName": "H. Fontes",
            "firstName": "Helder",
            "lastName": "Fontes",
            "searchablePreferredName": "Helder Fontes"
        },
        {
            "preferredName": "Rui Campos",
            "normalizedName": "R. Campos",
            "firstName": "Rui",
            "lastName": "Campos",
            "searchablePreferredName": "Rui Campos"
        },
        {
            "preferredName": "Manuel Ricardo",
            "normalizedName": "M. Ricardo",
            "firstName": "Manuel",
            "lastName": "Ricardo",
            "searchablePreferredName": "Manuel Ricardo"
        }
    ],
    "doi": "10.1109/ACCESS.2022.3227653",
    "publicationTitle": "IEEE Access",
    "publicationYear": "2022",
    "publicationVolume": null,
    "publicationIssue": null,
    "volume": "10",
    "issue": null,
    "documentLink": "/document/9975290/",
    "xml": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<response><accessType>CCBY - IEEE is not the copyright holder of this material. Please follow the instructions via https://creativecommons.org/licenses/by/4.0/ to obtain full-text articles and stipulations in the API documentation.</accessType><div id=\"BodyWrapper\" class=\"ArticlePage\" xmlns:ieee=\"http://www.ieeexplore.ieee.org\"><div id=\"article\">\n<div class=\"section\" id=\"sec1\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION I.</div><h2>Introduction</h2></div><p>Network slicing emerged as a key technique to enable the coexistence of multiple virtual networks on top of a shared physical communications infrastructure, while supporting different services with heterogeneous Quality of Service (QoS) levels <a ref-type=\"bibr\" anchor=\"ref1\" id=\"context_ref_1_1\">[1]</a>. The concept allows that Mobile Network Operators lease portions of the communications resources that compose their network infrastructure, including data centers, cell sites, and fronthaul and backhaul networks, to Service Providers or Virtual Mobile Network Operators which offer services to their customers, acting as network users, as depicted in <a ref-type=\"fig\" anchor=\"fig1\" class=\"fulltext-link\">Fig. 1</a>.\n<div class=\"figure figure-full\" id=\"fig1\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh1-3227653-large.gif\" data-fig-id=\"fig1\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh1-3227653-small.gif\" alt=\"FIGURE 1. - Flying network, composed of Unmanned Aerial Vehicles (UAVs), used by a Mobile Network Operator to provide network slices to a Service Provider that offers services to ground users in target geographical locations [2].\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 1. </b><fig><p>Flying network, composed of Unmanned Aerial Vehicles (UAVs), used by a Mobile Network Operator to provide network slices to a Service Provider that offers services to ground users in target geographical locations <a ref-type=\"bibr\" anchor=\"ref2\" id=\"context_ref_2_1\">[2]</a>.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div></p><p>Network slices are characterized at a high-level in the form of a Service Level Agreement (SLA), which is established between Service Providers and Mobile Network Operators. An SLA specifies the service requirements for a network slice including QoS levels, number of users served, and geographical locations covered <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_1\">[3]</a>. Network slicing allows to reduce costs by avoiding the need for permanently assigned communications resources, from the radio access network to the core network, while enabling flexibility, scalability, and sustainability in the management of the communications infrastructures over time <a ref-type=\"bibr\" anchor=\"ref4\" id=\"context_ref_4_1\">[4]</a>.</p><p>The literature on network slicing has been mainly focused on ensuring fairness and efficient resource management, while meeting targeted service requirements. Yet, a fixed communications infrastructure is typically assumed <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_1\">[3]</a>, which may not be feasible in scenarios characterized by limited network resources or high dynamics. The use of flexible wireless networks, capable of providing coverage and communications resources on-demand, is a promising approach for Mobile Network Operators which may be able to meet the Service Providers requirements in a myriad of scenarios.</p><p>In disaster management scenarios, such as forest fires, the first responders require reliable, mission-critical communications, while a best-effort wireless service may be provided to the victims. In crowded scenarios, such as outdoor festivities, wireless connectivity with different QoS requirements must be ensured for the staff, the media, and the spectators. Nowadays, these scenarios are addressed by Mobile Network Operators using network overprovisioning with fixed and mobile Base Stations (Cell-on-Wheels concept <a ref-type=\"bibr\" anchor=\"ref5\" id=\"context_ref_5_1\">[5]</a>). However, they may collapse, fail to provide sufficient wireless coverage, or lack the required communications resources. Moreover, the unpredictability associated to the number of users and their mobility may degrade the QoS offered.</p><p>Unmanned Aerial Vehicles (UAVs), acting as mobile Base Stations and Access Points that form flying networks, have emerged as an adequate solution to provide wireless coverage and communications resources on-demand. Still, the literature has been focused on best-effort approaches that aim at enhancing the area covered, the number of users served, and the aggregate QoS offered.</p><p>In order to enable slicing-aware flying networks, we have proposed the SLICER algorithm in <a ref-type=\"bibr\" anchor=\"ref2\" id=\"context_ref_2_1\">[2]</a>. SLICER allows to minimize the cost of deploying a slicing-aware flying network by determining the minimum number of UAVs required to meet the QoS levels offered by multiple network slices made available in given geographical locations. However, SLICER is focused on the access network only, overlooking the backhaul network design. In order to enable the coverage extension from a remote Base Station or Access Point, while meeting the requirements of the network slices to be offered to the ground users, the placement of UAVs acting as network gateways and the allocation of communications resources in a multi-hop architecture have to be carefully defined.</p><p>The main contribution of this article is SurFABle, an algorithm that makes the joint placement and allocation of communications resources in Slicing-aware Flying Access and Backhaul networks. SurFABle allows the joint computation of the amount of communications resources needed, namely the number of UAVs acting as Flying Access Points (FAPs) and Flying Gateways (FGWs), and their placement in 3D space. The resulting flying access and backhaul network extends radio coverage using a multi-hop architecture and offers multiple network slices with target QoS levels to ground users located in given geographical areas. The performance evaluation when SurFABle is used was carried out by means of ns-3 <a ref-type=\"bibr\" anchor=\"ref6\" id=\"context_ref_6_1\">[6]</a> simulations and an experimental testbed.</p><p>The rest of this article is organized as follows. <a ref-type=\"sec\" anchor=\"sec2\" class=\"fulltext-link\">Section II</a> presents the related work. <a ref-type=\"sec\" anchor=\"sec3\" class=\"fulltext-link\">Section III</a> contains the system model and problem formulation. <a ref-type=\"sec\" anchor=\"sec4\" class=\"fulltext-link\">Section IV</a> describes the SurFABle algorithm. <a ref-type=\"sec\" anchor=\"sec5\" class=\"fulltext-link\">Section V</a> refers to the performance evaluation when the SurFABle algorithm is used. <a ref-type=\"sec\" anchor=\"sec6\" class=\"fulltext-link\">Section VI</a> discusses the design and performance of the SurFABle algorithm. Finally, <a ref-type=\"sec\" anchor=\"sec7\" class=\"fulltext-link\">Section VII</a> points out the main conclusions and future work.</p></div>\n<div class=\"section\" id=\"sec2\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION II.</div><h2>Related Work</h2></div><p>The 3 <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$^{\\mathrm{ rd}}$\n</tex-math></inline-formula> Generation Partnership Project (3GPP) defines network slice as a logical network that provides specific network capabilities and target performance requirements, such as throughput and delay <a ref-type=\"bibr\" anchor=\"ref1\" id=\"context_ref_1_2\">[1]</a>. The 3GPP standardization process on network slicing has been approached in <a ref-type=\"bibr\" anchor=\"ref7\" id=\"context_ref_7_2\">[7]</a>, while key principles, enabling technologies, and open research challenges related to network slicing have been envisioned in <a ref-type=\"bibr\" anchor=\"ref8\" id=\"context_ref_8_2\">[8]</a>. In these works, network slicing has been considered a major enabler for 5G networks, but the provisioning of network slices on-demand and the usage of UAVs to ensure a reconfigurable wireless network have not been envisioned. Multiple approaches have been proposed in the literature to allow for QoS guarantees in wireless networks. A reference example has been introduced by IEEE 802.11e by means of traffic prioritization. On the one hand, IEEE 802.11e provides the same QoS to flows associated with the same traffic type, by adopting four QoS classes implemented by different network queues <a ref-type=\"bibr\" anchor=\"ref9\" id=\"context_ref_9_2\">[9]</a>. On the other hand, it may be unable to meet QoS guarantees in some scenarios, if the capacity of the wireless links is not enough or the network configuration employed is not adequately defined. For these reasons, IEEE 802.11e does not provide high enough scalability and the flexibility to meet the QoS levels of different network slices, especially when the number and type of network slices increase.</p><p>In <a ref-type=\"bibr\" anchor=\"ref10\" id=\"context_ref_10_2\">[10]</a>, network slicing has been formulated as an optimization problem that considers backhaul network capacity, available storage, and achievable bandwidth. However, a single Base Station in a fixed position has been considered. The placement of the Base Station in suitable positions, according to the network slice requirements, has not been addressed. Isolation, scalability, and efficiency have also been research challenges addressed in the literature, especially when it comes to maximizing resource utilization and minimizing costs <a ref-type=\"bibr\" anchor=\"ref11\" id=\"context_ref_11_2\">[11]</a>. In such work, multiple Base Stations have been considered, but their positioning in suitable positions has not been studied too. Due to the large number of variables involved, network slicing problems are very complex and typically solved using either optimization <a ref-type=\"bibr\" anchor=\"ref12\" id=\"context_ref_12_2\">[12]</a>, game theory <a ref-type=\"bibr\" anchor=\"ref13\" id=\"context_ref_13_2\">[13]</a>, evolutionary and heuristic algorithms <a ref-type=\"bibr\" anchor=\"ref14\" id=\"context_ref_14_2\">[14]</a>, <a ref-type=\"bibr\" anchor=\"ref15\" id=\"context_ref_15_2\">[15]</a>, and machine learning techniques <a ref-type=\"bibr\" anchor=\"ref16\" id=\"context_ref_16_2\">[16]</a>. Providing network slices taking into account wireless coverage and the traffic demand requirements of the radio access network is a problem that has been addressed in <a ref-type=\"bibr\" anchor=\"ref17\" id=\"context_ref_17_2\">[17]</a>, <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_2\">[3]</a> and <a ref-type=\"bibr\" anchor=\"ref4\" id=\"context_ref_4_2\">[4]</a>. Still, in all these works, a fixed wireless communications infrastructure has been considered, and the joint placement and allocation of communications resources on-demand has not been addressed.</p><p>When there is no wireless network infrastructure available or there is a need to enhance the coverage and capacity of existing networks, flying networks made up of UAVs acting as mobile Base Stations and Access Points have been described as an adequate solution <a ref-type=\"bibr\" anchor=\"ref18\" id=\"context_ref_18_2\">[18]</a>, <a ref-type=\"bibr\" anchor=\"ref19\" id=\"context_ref_19_2\">[19]</a>, <a ref-type=\"bibr\" anchor=\"ref20\" id=\"context_ref_20_2\">[20]</a>, <a ref-type=\"bibr\" anchor=\"ref21\" id=\"context_ref_21_2\">[21]</a>. For that purpose, different UAV placement algorithms have been proposed, in order to improve the QoS offered <a ref-type=\"bibr\" anchor=\"ref22\" id=\"context_ref_22_2\">[22]</a>, <a ref-type=\"bibr\" anchor=\"ref23\" id=\"context_ref_23_2\">[23]</a> or maximize the coverage and the number of served users <a ref-type=\"bibr\" anchor=\"ref24\" id=\"context_ref_24_2\">[24]</a>, <a ref-type=\"bibr\" anchor=\"ref25\" id=\"context_ref_25_2\">[25]</a>. However, the state of the art solutions typically lie on a best-effort approach. Also, the joint UAV placement and allocation of communications resources for enabling the usage of multiple services with heterogeneous QoS requirements has not been addressed for multiple UAVs so far.</p><p>In <a ref-type=\"bibr\" anchor=\"ref26\" id=\"context_ref_26_2\">[26]</a>, a flying network composed of a High-Altitude Platform (HAP) and Low Altitude Platforms (LAPs) has been proposed to extend wireless coverage and improve network performance; this solution allows to maximize the aggregate data rate by optimizing the height of LAPs, the transmission power of ground users, and the spectrum allocated to HAP, LAPs, and ground users. However, it does not allow to meet heterogeneous QoS requirements. In addition, since only the altitude component is considered, the placement computed for the HAP may reduce the QoS offered in practice and imply the usage of more radio resources when compared with a solution that defines a suitable placement in 3D. In <a ref-type=\"bibr\" anchor=\"ref27\" id=\"context_ref_27_2\">[27]</a>, the UAV placement has been optimized to improve the users’ satisfaction when using different services. It has been designed to provide different network slices, but the authors have been focused on maximizing the aggregate network performance for each network slice without considering target QoS guarantees. An on-demand density-aware 3D UAV placement algorithm has been proposed in <a ref-type=\"bibr\" anchor=\"ref28\" id=\"context_ref_28_2\">[28]</a>, in order to meet heterogeneous QoS levels. It guarantees target data rate values, while providing wireless coverage to as many ground users as possible. However, it only considers one UAV, which may limit the scalability of the proposed solution.</p><p>When it comes to use UAVs for providing on-demand network slices, the literature has been focused on improving energy efficiency, fair coverage, and resource allocation efficiency, but does not address the joint placement and allocation of communications resources <a ref-type=\"bibr\" anchor=\"ref29\" id=\"context_ref_29_2\">[29]</a>. In this context, <a ref-type=\"bibr\" anchor=\"ref29\" id=\"context_ref_29_2\">[29]</a> has employed two independent optimization problems to maximize the data rates achieved by the User Equipment (UE) and minimize the UAVs’ transmission power. A coverage-aware geometric placement approach for a UAV that offers wireless connectivity to ground users has been proposed in <a ref-type=\"bibr\" anchor=\"ref30\" id=\"context_ref_30_2\">[30]</a>, taking into account the UAV’s altitude, cell size, and antenna’s beamwidth. However, such solution is intended to use cases that only require two network slices, where a single UAV is deployed to maximize the average data rate of the ground users that belong to the enhanced Mobile Broadband (eMBB) network slice, while wireless coverage is provided to the ground users associated with the massive Machine-Type Communications (mMTC) network slice. In order to provide the ground users with an eMBB slice and ensure an Ultra-Reliable and Low-Latency Communications (URLLC) network slice for the UAV control, a distributed learning and optimization strategy has been proposed in <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_2\">[31]</a>. Still, these works have been focused on ensuring aggregate QoS guarantees and are unable to meet heterogeneous QoS levels for different flows associated with the same traffic type. Moreover, the joint placement and allocation of communications resources considering multiple UAVs has not been addressed.</p><p>In <a ref-type=\"bibr\" anchor=\"ref32\" id=\"context_ref_32_2\">[32]</a>, a slicing-aware multi-Drone Small Cell (DSC) network has been proposed to minimize the resource usage and meet differentiated QoS guarantees. A joint optimization problem has been formulated to place the DSCs and define suitable device associations. Still, the work has been focused on the access network only and a fixed altitude has been considered to reduce the problem complexity, which may limit the quality of the solutions obtained. In <a ref-type=\"bibr\" anchor=\"ref33\" id=\"context_ref_33_2\">[33]</a>, the authors have introduced the problem of Progressive Network Recovery (PNR). PNR is associated with the reallocation and replacement of communications resources, made by Mobile Network Operators when failures affect the network infrastructure, so that the network slice requirements are meet. The approach proposed to obtain the recovery sequence has considered existing nodes and available connections between them. We envision that the use of UAVs able to provide on-demand resources within the Radio Access Network (RAN) may be considered to improve efficiency and ensure performance guarantees in PNR. In <a ref-type=\"bibr\" anchor=\"ref34\" id=\"context_ref_34_2\">[34]</a>, a UAV has been used as a relay to enable URLLC between a Base Station and a UE with Line-of-Sight compromised due to an obstacle between them, while an algorithm has been proposed to define the bandwidth allocation and UAV placement. Besides ensuring a single URLLC network slice using only one UAV, the iterative nature of the proposed algorithm conduces to approximate solutions only. An optimization-based approach to maximize the average data rate and minimize transmission power, while meeting the requirements of a URLLC-based network slice using a single UAV, has been proposed in <a ref-type=\"bibr\" anchor=\"ref35\" id=\"context_ref_35_2\">[35]</a>.</p><p>The synergy between Artificial Intelligence (AI) and Machine Learning (ML) with network slicing has also been envisioned in the literature <a ref-type=\"bibr\" anchor=\"ref36\" id=\"context_ref_36_2\">[36]</a>. On the one hand, AI and ML techniques have been proposed to manage the network slices’ lifecycle, including preparation, planning, and operation. On the other hand, network slicing has been proposed to enable the usage of different AI services, while ensuring efficient resource management. Resource management using reinforcement learning (RL) and Deep RL algorithms has been presented in <a ref-type=\"bibr\" anchor=\"ref37\" id=\"context_ref_37_2\">[37]</a> and <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_2\">[38]</a>, where different approaches, according to the optimization objective and use cases, have been analyzed, including for UAV networks. The authors have raised scalability and practicability challenges of applying RL and Deep RL techniques within this context, especially regarding the high volume of data, massive number of devices, and variable network size, which are exacerbated due to the centralized approach typically employed by these techniques. In <a ref-type=\"bibr\" anchor=\"ref39\" id=\"context_ref_39_2\">[39]</a>, Machine Learning techniques have been used for predicting resource requirements according to the network traffic load, in order to reduce the number of resources to be allocated and reduce costs. The main disadvantage of the proposed techniques is associated with the time complexity in fitting, especially for large data sets; this motivates the design of heuristic-based solutions with less complexity. In <a ref-type=\"bibr\" anchor=\"ref40\" id=\"context_ref_40_2\">[40]</a>, user association and wireless resource sharing in UAV networks have been addressed, in order to maximize the total profit of Service Providers, while satisfying the QoS constraints of mobile users and taking into account the resource constraints of the UAVs deployed by Mobile Network Operators. Due to the NP-hard nature of the optimization problem formulated, the authors have decomposed the user’s association and resource sharing into two problems, which may compromise the quality of the solutions obtained when compared with a joint optimization approach.</p><p>Overall, the use of UAVs has been widely envisioned in the literature as a key component of emerging wireless networks. In 3GPP Release 16’s Integrated Access and Backhaul (IAB) concept, UAVs have been proposed for establishing backhaul networks, taking advantage of spectral resources made available by fixed Base Stations <a ref-type=\"bibr\" anchor=\"ref41\" id=\"context_ref_41_2\">[41]</a>. In <a ref-type=\"bibr\" anchor=\"ref42\" id=\"context_ref_42_2\">[42]</a>, the potential of UAV networks compared with terrestrial networks has been emphasized as an enabler for URLLC communications in 6G networks, especially due to their improved channel quality conditions, lower error probability, and higher channel reliability <a ref-type=\"bibr\" anchor=\"ref43\" id=\"context_ref_43_2\">[43]</a>. When it comes to network slicing in flying networks, the literature has been mostly focused on UAVs that act as clients of Mobile Network Operators’ infrastructures <a ref-type=\"bibr\" anchor=\"ref44\" id=\"context_ref_44_2\">[44]</a>. In a complementary way, our research has been envisioning the integration of UAVs into telecommunications infrastructures as communications resources that can be deployed anywhere, anytime, in order to meet the heterogeneous QoS requirements of any number and type of network slices, using a shared airborne wireless communications infrastructure. This also represents a step forward with respect to our previous works. On the one hand, for flying networks in general we have proposed novel traffic-aware UAV placement <a ref-type=\"bibr\" anchor=\"ref45\" id=\"context_ref_45_2\">[45]</a>, centralized routing <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_2\">[46]</a>, and proactive queue management <a ref-type=\"bibr\" anchor=\"ref47\" id=\"context_ref_47_2\">[47]</a> algorithms that improve the aggregate QoS offered using a best-effort based approach. On the other hand, for slicing-aware flying networks, in <a ref-type=\"bibr\" anchor=\"ref2\" id=\"context_ref_2_2\">[2]</a> we have proposed SLICER, an algorithm that allows the computation of the minimum number of UAVs, their 3D positions, and the amount of communications resources to be provided in different geographical areas where network slices with target QoS levels must be made available. Yet, SLICER has been only focused on the FAPs providing wireless connectivity to the ground users. The evolution of SLICER for multi-hop flying networks allowing wireless coverage extension, while enabling the joint placement and allocation of FAPs and FGWs on-demand, has not been addressed so far. Moreover, the performance achieved with SLICER has been assessed using network simulations only. Evaluating the proposed concept using an experimental testbed represents a step forward.</p></div>\n<div class=\"section\" id=\"sec3\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION III.</div><h2>System Model and Problem Formulation</h2></div><p>The flying access and backhaul network is assumed to be organized into a two-tier architecture, as depicted in <a ref-type=\"fig\" anchor=\"fig2\" class=\"fulltext-link\">Fig. 2</a>. This architecture is designed to take advantage of short-range wireless links that provide wireless channels with high bandwidth and low inter-flow interference. Two types of UAVs compose the flying access and backhaul network: 1) the FAPs, which provide coverage-aware network slices to the ground users; and 2) the FGWs, which forward the traffic to/from the Internet using broadband wireless links, while preserving the QoS guarantees of the network slices offered by the FAPs to the ground users. The first tier consists of the access network, which is composed of the FAPs, and the second tier consists of the backhaul network, composed of FGWs. The main notation used to formulate our problem is presented in <a ref-type=\"table\" anchor=\"table1\" class=\"fulltext-link\">Table 1</a>.<div class=\"figure figure-full table\" id=\"table1\"><div class=\"figcaption\"><b class=\"title\">TABLE 1 </b>\nMain notation used to formulate the problem addressed by this article.</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh.t1-3227653-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh.t1-3227653-small.gif\" alt=\"Table 1- &#10;Main notation used to formulate the problem addressed by this article.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div>\n<div class=\"figure figure-full\" id=\"fig2\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh2-3227653-large.gif\" data-fig-id=\"fig2\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh2-3227653-small.gif\" alt=\"FIGURE 2. - Slicing-aware flying access and backhaul network composed of Unmanned Aerial Vehicles (UAVs). The Flying Access Points (FAPs), in the first tier, provide a wireless access network to the ground users, while the Flying Gateways (FGWs), in the second tier, establish a wireless backhaul network with the FAPs and forward the traffic to/from the Internet. The UAV placement and communications resources allocation are jointly computed in a Central Station, deployed in the Cloud or at the Edge of the flying access and backhaul network.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 2. </b><fig><p>Slicing-aware flying access and backhaul network composed of Unmanned Aerial Vehicles (UAVs). The Flying Access Points (FAPs), in the first tier, provide a wireless access network to the ground users, while the Flying Gateways (FGWs), in the second tier, establish a wireless backhaul network with the FAPs and forward the traffic to/from the Internet. The UAV placement and communications resources allocation are jointly computed in a Central Station, deployed in the Cloud or at the Edge of the flying access and backhaul network.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div></p><p>At the discrete time instant <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$t_{k} = k \\cdot \\Delta t, k \\in \\mathbb {N}_{0}$\n</tex-math></inline-formula>, where <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\Delta t \\gg {\\mathrm {1~ \\text {s}}}$\n</tex-math></inline-formula>, the flying access and backhaul network can be reconfigured. Let <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v \\in V$\n</tex-math></inline-formula> represent a communications node, being it a UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u \\in U$\n</tex-math></inline-formula> or a ground user <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$r \\in R$\n</tex-math></inline-formula> positioned within a cuboid <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$C$\n</tex-math></inline-formula> with dimensions <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$X$\n</tex-math></inline-formula> long, <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$Y$\n</tex-math></inline-formula> wide, and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$Z$\n</tex-math></inline-formula> high, as depicted in <a ref-type=\"fig\" anchor=\"fig3\" class=\"fulltext-link\">Fig. 3</a>. UAVs <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$U \\subset V$\n</tex-math></inline-formula> and ground users <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$R \\subset V$\n</tex-math></inline-formula>.\n<div class=\"figure figure-full\" id=\"fig3\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh3ab-3227653-large.gif\" data-fig-id=\"fig3\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh3ab-3227653-small.gif\" alt=\"FIGURE 3. - Illustrative networking scenario (3D representation on the left-hand side) composed of multiple ground users (blue squares) served by a flying access and backhaul network composed of a FAP (green star) and a FGW (orange circle). The ground users are associated with two network slices &#10;$s \\in S$&#10; made available in different subareas &#10;$a \\in A^{s}$&#10; at the base of cuboid &#10;$C$&#10; (2D representation on the right-hand side).\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 3. </b><fig><p>Illustrative networking scenario (3D representation on the left-hand side) composed of multiple ground users (blue squares) served by a flying access and backhaul network composed of a FAP (green star) and a FGW (orange circle). The ground users are associated with two network slices <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula> made available in different subareas <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a \\in A^{s}$\n</tex-math></inline-formula> at the base of cuboid <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$C$\n</tex-math></inline-formula> (2D representation on the right-hand side).</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div></p><p>Cuboid <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$C$\n</tex-math></inline-formula> is subdivided into a set of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$N$\n</tex-math></inline-formula> equal and smaller fixed-size subcuboids, where <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$n \\in N$\n</tex-math></inline-formula> represents a subcuboid in which center a UAV may be located (cf. left-hand side of <a ref-type=\"fig\" anchor=\"fig3\" class=\"fulltext-link\">Fig. 3</a>). Let <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$P_{u}=(x_{u}, y_{u}, z_{u})$\n</tex-math></inline-formula> represent the position of UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u \\in U$\n</tex-math></inline-formula>. When used, UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> can act as a FAP <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$f$\n</tex-math></inline-formula>, which is responsible for providing wireless connectivity to ground users located at the base of cuboid <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$C$\n</tex-math></inline-formula>, or as a FGW <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$g$\n</tex-math></inline-formula>, which is used to forward the traffic between the FAPs and the Internet. Let <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$U^{f}$\n</tex-math></inline-formula> represent the set of FAPs and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$U^{g}$\n</tex-math></inline-formula> represent the set of FGWs. Consequently, the FAP <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$f$\n</tex-math></inline-formula> belongs to the subset <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$U^{f} \\subset U$\n</tex-math></inline-formula>, whereas the FGW <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$g$\n</tex-math></inline-formula> belongs to the subset <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$U^{g} \\subset U$\n</tex-math></inline-formula>. UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> has available a total number of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$W_{u}$\n</tex-math></inline-formula> wireless channels with constant bandwidth <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$B$\n</tex-math></inline-formula>, in <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~ \\text {Hz}}$\n</tex-math></inline-formula>. We assume that <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$B$\n</tex-math></inline-formula> is the minimum channel bandwidth block per wireless channel that can be used to carry traffic and depends on the technology employed. The base of cuboid <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$C$\n</tex-math></inline-formula> is subdivided into a given number of subareas of fixed size (cf. right-hand side of <a ref-type=\"fig\" anchor=\"fig3\" class=\"fulltext-link\">Fig. 3</a>). Let <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a \\in A$\n</tex-math></inline-formula> represent a subarea, where <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$A$\n</tex-math></inline-formula> is the set of subareas that compose the base of the cuboid <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$C$\n</tex-math></inline-formula>. Subarea <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a \\in A$\n</tex-math></inline-formula> is centered at <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$P_{a} = (x_{a}, y_{a}, 0)$\n</tex-math></inline-formula>, where there may be one ground user at maximum.</p><p>The wireless channel between the UAVs themselves and the UAVs and the ground users is modeled by the Free-space Path Loss model. We assume the wireless channel is symmetric. The power <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$P_{R_{u,v}}$\n</tex-math></inline-formula> received at communications node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v$\n</tex-math></inline-formula> from UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula>, in <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~dBm}$\n</tex-math></inline-formula>, is given by <a ref-type=\"disp-formula\" anchor=\"deqn1-deqn2\" href=\"#deqn1-deqn2\" class=\"fulltext-link\">(1)</a>, where <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$P_{T_{u}}$\n</tex-math></inline-formula> is the transmission power of UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula>, in <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~dBm}$\n</tex-math></inline-formula>, and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$G_{T_{u}}$\n</tex-math></inline-formula> and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$G_{R_{v}}$\n</tex-math></inline-formula> are respectively the antenna gains of UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> and node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v$\n</tex-math></inline-formula>, in <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~dBi}$\n</tex-math></inline-formula>. The path loss component <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$P_{L_{u,v}}$\n</tex-math></inline-formula>, in <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~ \\text {dB}}$\n</tex-math></inline-formula>, is computed by means of <a ref-type=\"disp-formula\" anchor=\"deqn1-deqn2\" href=\"#deqn1-deqn2\" class=\"fulltext-link\">(2)</a>, where <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$d_{u,v}$\n</tex-math></inline-formula> is the Euclidean distance between UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> and node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v$\n</tex-math></inline-formula>, in meters, <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$f_{u}$\n</tex-math></inline-formula> is the carrier frequency used by UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula>, in <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~ \\text {Hz}}$\n</tex-math></inline-formula>, and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$c$\n</tex-math></inline-formula> is the speed of light in vacuum, in <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~ \\text {m}/ \\text {s}}$\n</tex-math></inline-formula>.<disp-formula id=\"deqn1-deqn2\" class=\"display-formula\"><tex-math notation=\"LaTeX\">\\begin{align*} P_{R_{u,v}}=&amp;P_{T_{u}} + G_{T_{u}} + G_{R_{v}} - P_{L_{u,v}} \\tag{1}\\\\ P_{L_{u,v}}=&amp;20 \\cdot log_{10}(d_{u,v}) + 20 \\cdot log_{10}(f_{u}) + \\\\&amp;+\\, 20 \\cdot log_{10}\\left ({\\frac {4 \\cdot \\pi }{c}}\\right) \\tag{2}\\end{align*}\n</tex-math><span class=\"formula\"><span class=\"link\">View Source</span><img aria-describedby=\"qtip-0\" style=\"display:inline;\" title=\"Right-click on figure or equation for MathML and additional features.\" data-hasqtip=\"0\" class=\"qtooltip moreInfo\" alt=\"Right-click on figure for MathML and additional features.\" src=\"/assets/img/icon.support.gif\" border=\"0\" height=\"20\" width=\"24\"/><span class=\"tex tex2jax_ignore\" style=\"display:none;\">\\begin{align*} P_{R_{u,v}}=&amp;P_{T_{u}} + G_{T_{u}} + G_{R_{v}} - P_{L_{u,v}} \\tag{1}\\\\ P_{L_{u,v}}=&amp;20 \\cdot log_{10}(d_{u,v}) + 20 \\cdot log_{10}(f_{u}) + \\\\&amp;+\\, 20 \\cdot log_{10}\\left ({\\frac {4 \\cdot \\pi }{c}}\\right) \\tag{2}\\end{align*}\n</span></span></disp-formula></p><p>The Signal-to-Noise Ratio (SNR) measured at node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v$\n</tex-math></inline-formula> from UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula>, in <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~ \\text {dB}}$\n</tex-math></inline-formula>, is given by <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$SNR_{u,v} = P_{R_{u,v}} - P_{N_{u,v}}$\n</tex-math></inline-formula>, where <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$P_{N_{u,v}}$\n</tex-math></inline-formula> is the noise power, in <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~dBm}$\n</tex-math></inline-formula>, which we assume to be constant for the channel bandwidth <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$B$\n</tex-math></inline-formula>. The capacity provided by each wireless channel is equal to the data rate associated with the Modulation and Coding Scheme (<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$MCS_{u,v}$\n</tex-math></inline-formula>) index used for the wireless link established between UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> and node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v$\n</tex-math></inline-formula>. The use of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$MCS_{u,v}$\n</tex-math></inline-formula> imposes a minimum <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$SNR_{u,v}$\n</tex-math></inline-formula>, considering a constant noise power <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$P_{N_{u,v}}$\n</tex-math></inline-formula>.</p><p>The number of independent wireless channels provided by UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> to node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v$\n</tex-math></inline-formula> at time instant <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$t_{k}$\n</tex-math></inline-formula> is denoted by <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$w_{u,v}(t_{k})$\n</tex-math></inline-formula>. <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$w_{u,v}(t_{k})$\n</tex-math></inline-formula> must be lower than or equal to the total number <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$W_{u}$\n</tex-math></inline-formula> of wireless channels available at UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula>, as defined in <a ref-type=\"disp-formula\" anchor=\"deqn3\" href=\"#deqn3\" class=\"fulltext-link\">(3)</a>.<disp-formula id=\"deqn3\" class=\"display-formula\"><tex-math notation=\"LaTeX\">\\begin{equation*} \\sum _{v \\in V} w_{u,v}(t_{k}) \\leq W_{u}, \\forall u \\in U \\tag{3}\\end{equation*}\n</tex-math><span class=\"formula\"><span class=\"link\">View Source</span><img aria-describedby=\"qtip-0\" style=\"display:inline;\" title=\"Right-click on figure or equation for MathML and additional features.\" data-hasqtip=\"0\" class=\"qtooltip moreInfo\" alt=\"Right-click on figure for MathML and additional features.\" src=\"/assets/img/icon.support.gif\" border=\"0\" height=\"20\" width=\"24\"/><span class=\"tex tex2jax_ignore\" style=\"display:none;\">\\begin{equation*} \\sum _{v \\in V} w_{u,v}(t_{k}) \\leq W_{u}, \\forall u \\in U \\tag{3}\\end{equation*}\n</span></span></disp-formula></p><p>The number of UAVs providing resources to each node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v \\in V$\n</tex-math></inline-formula> at time instant <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$t_{k}$\n</tex-math></inline-formula> is denoted by <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$K_{u,v}(t_{k})$\n</tex-math></inline-formula>. We assume that node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v \\in V$\n</tex-math></inline-formula> is served by one and only one UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula>, as stated in <a ref-type=\"disp-formula\" anchor=\"deqn4\" href=\"#deqn4\" class=\"fulltext-link\">(4)</a>.<disp-formula id=\"deqn4\" class=\"display-formula\"><tex-math notation=\"LaTeX\">\\begin{equation*} K_{u,v}(t_{k}) = 1, \\forall u \\in U, \\forall v \\in V \\tag{4}\\end{equation*}\n</tex-math><span class=\"formula\"><span class=\"link\">View Source</span><img aria-describedby=\"qtip-0\" style=\"display:inline;\" title=\"Right-click on figure or equation for MathML and additional features.\" data-hasqtip=\"0\" class=\"qtooltip moreInfo\" alt=\"Right-click on figure for MathML and additional features.\" src=\"/assets/img/icon.support.gif\" border=\"0\" height=\"20\" width=\"24\"/><span class=\"tex tex2jax_ignore\" style=\"display:none;\">\\begin{equation*} K_{u,v}(t_{k}) = 1, \\forall u \\in U, \\forall v \\in V \\tag{4}\\end{equation*}\n</span></span></disp-formula></p><p>The indicator function <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$1_{u}(t_{k})$\n</tex-math></inline-formula>, defined in <a ref-type=\"disp-formula\" anchor=\"deqn5\" href=\"#deqn5\" class=\"fulltext-link\">(5)</a>, denotes whether UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> serves any node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v\\in V$\n</tex-math></inline-formula> at time instant <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$t_{k}$\n</tex-math></inline-formula>.<disp-formula id=\"deqn5\" class=\"display-formula\"><tex-math notation=\"LaTeX\">\\begin{align*} 1_{u}(t_{k}) = \\begin{cases} 1, &amp; \\quad \\textrm {if } \\sum _{v \\in V} w_{u,v} (t_{k}) &gt; 0\\\\ 0, &amp; \\quad \\textrm {otherwise} \\end{cases} \\tag{5}\\end{align*}\n</tex-math><span class=\"formula\"><span class=\"link\">View Source</span><img aria-describedby=\"qtip-0\" style=\"display:inline;\" title=\"Right-click on figure or equation for MathML and additional features.\" data-hasqtip=\"0\" class=\"qtooltip moreInfo\" alt=\"Right-click on figure for MathML and additional features.\" src=\"/assets/img/icon.support.gif\" border=\"0\" height=\"20\" width=\"24\"/><span class=\"tex tex2jax_ignore\" style=\"display:none;\">\\begin{align*} 1_{u}(t_{k}) = \\begin{cases} 1, &amp; \\quad \\textrm {if } \\sum _{v \\in V} w_{u,v} (t_{k}) &gt; 0\\\\ 0, &amp; \\quad \\textrm {otherwise} \\end{cases} \\tag{5}\\end{align*}\n</span></span></disp-formula></p><p>Let us consider that a Service Provider rents a set of network slices from a Mobile Network Operator, in order to offer online services to the ground users located in area <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$A$\n</tex-math></inline-formula>, as depicted in <a ref-type=\"fig\" anchor=\"fig3\" class=\"fulltext-link\">Fig. 3</a>. Let <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula> represent a network slice, where <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$S$\n</tex-math></inline-formula> is the set of network slices. We assume that each subarea <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a\\in A$\n</tex-math></inline-formula>, occupied by a ground user in its center, is associated with a single network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s$\n</tex-math></inline-formula>, but a network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s$\n</tex-math></inline-formula> can cover multiple subareas <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a \\in A$\n</tex-math></inline-formula>. As such, network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s$\n</tex-math></inline-formula> enables the use of a service made available in area <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$A^{s} \\subset A$\n</tex-math></inline-formula>. The area <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$A^{s}$\n</tex-math></inline-formula> associated with network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s$\n</tex-math></inline-formula> is the union of a set of fixed-size subareas <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a \\in A$\n</tex-math></inline-formula>. Let <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$r_{a}$\n</tex-math></inline-formula> represent the ground user located in the center of area <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a \\in A^{s}$\n</tex-math></inline-formula>. In turn, <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v \\in V^{s}$\n</tex-math></inline-formula> represents a communications node (ground user or UAV) that either uses or provides communications resources to network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>.</p><p>The average traffic demand enabled in subarea <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a \\in A^{s}$\n</tex-math></inline-formula> by network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s$\n</tex-math></inline-formula> is <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$T^{s}$\n</tex-math></inline-formula>. As such, for each node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v \\in V^{s}$\n</tex-math></inline-formula>, the average data rate when served by a given UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> must be higher than or equal to the average data rate <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$T^{s}$\n</tex-math></inline-formula> demanded by network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s$\n</tex-math></inline-formula>, as given by <a ref-type=\"disp-formula\" anchor=\"deqn6\" href=\"#deqn6\" class=\"fulltext-link\">(6)</a>. <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$c_{u,v} (t_{k})$\n</tex-math></inline-formula> represents the bidirectional network capacity provided by a wireless channel with constant channel bandwidth <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$B$\n</tex-math></inline-formula>, in terms of the amount of bit/s carried between UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> and node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v$\n</tex-math></inline-formula>.<disp-formula id=\"deqn6\" class=\"display-formula\"><tex-math notation=\"LaTeX\">\\begin{equation*} \\sum _{u \\in U} c_{u,v}(t_{k}) \\cdot w_{u,v} (t_{k}) \\geq T^{s}, \\forall v \\in V^{s}, \\forall s \\in S \\tag{6}\\end{equation*}\n</tex-math><span class=\"formula\"><span class=\"link\">View Source</span><img aria-describedby=\"qtip-0\" style=\"display:inline;\" title=\"Right-click on figure or equation for MathML and additional features.\" data-hasqtip=\"0\" class=\"qtooltip moreInfo\" alt=\"Right-click on figure for MathML and additional features.\" src=\"/assets/img/icon.support.gif\" border=\"0\" height=\"20\" width=\"24\"/><span class=\"tex tex2jax_ignore\" style=\"display:none;\">\\begin{equation*} \\sum _{u \\in U} c_{u,v}(t_{k}) \\cdot w_{u,v} (t_{k}) \\geq T^{s}, \\forall v \\in V^{s}, \\forall s \\in S \\tag{6}\\end{equation*}\n</span></span></disp-formula></p><p>The relation between the minimum <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$SNR_{u,v}$\n</tex-math></inline-formula> from UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> measured in node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v \\in V^{s}$\n</tex-math></inline-formula> required for using <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$MCS_{u,v}$\n</tex-math></inline-formula> is considered, taking into account target Bit Error Rate (BER) values according to the requirements of network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s$\n</tex-math></inline-formula>. For improved reliability, higher SNR values must be ensured so that a lower BER is achieved <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_3\">[48]</a>. For illustrative purposes, BER equal to 10 <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$^{\\mathrm{ -10}}$\n</tex-math></inline-formula> is considered for a URLLC network slice type, while BER equal to 10 <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$^{\\mathrm{ -5}}$\n</tex-math></inline-formula> is employed for an eMBB network slice type. The relation between <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$SNR_{u,v}$\n</tex-math></inline-formula> and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$MCS_{u,v}$\n</tex-math></inline-formula> for different target BER values is presented in <a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">Fig. 4</a>, considering the IEEE 802.11ac standard, <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {800~ \\text {n} \\text {s} }$\n</tex-math></inline-formula> Guard Interval (GI), <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> channel bandwidth, and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~dBm}$\n</tex-math></inline-formula> transmission power. The minimum <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$SNR_{u,v}$\n</tex-math></inline-formula> required to use each <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$MCS_{u,v}$\n</tex-math></inline-formula> index was obtained by means of ns-3 simulations, considering node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v$\n</tex-math></inline-formula> generating UDP Poisson traffic towards UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula>. For each target BER value, an ns-3 simulation run, in which the UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> was moving away from the node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v$\n</tex-math></inline-formula>, was carried out. The successively increased Euclidean distance between UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> and node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v$\n</tex-math></inline-formula> led to the degradation of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$SNR_{u,v}$\n</tex-math></inline-formula> and induced the selection of suitable <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$MCS_{u,v}$\n</tex-math></inline-formula> indexes. This allowed establishing the relationship between different <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$SNR_{u,v}$\n</tex-math></inline-formula> values and the <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$MCS_{u,v}$\n</tex-math></inline-formula> indexes selected for each targeted BER value. The <i>IdealWifiManager</i> mechanism of ns-3 was used as the Medium Access Control (MAC) automatic rate selection mechanism, since it allows to configure target BER values. The wireless link established between node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v$\n</tex-math></inline-formula> and UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> was modeled by the Free-space Path Loss model.\n<div class=\"figure figure-full\" id=\"fig4\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh4-3227653-large.gif\" data-fig-id=\"fig4\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh4-3227653-small.gif\" alt=\"FIGURE 4. - Wireless channel capacity modeled by linear regressions between the SNR and the data rate associated to the IEEE 802.11ac MCS indexes, considering 20 MHz channel bandwidth.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 4. </b><fig><p>Wireless channel capacity modeled by linear regressions between the SNR and the data rate associated to the IEEE 802.11ac MCS indexes, considering 20 MHz channel bandwidth.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div></p><p>Since the relation between <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$SNR_{u,v}$\n</tex-math></inline-formula> and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$MCS_{u,v}$\n</tex-math></inline-formula> is stepwise (cf. solid blue lines in <a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">Fig. 4</a>), making the problem intractable and complex to solve mathematically, we modeled it as a continuous function using a linear regression (cf. dashed black lines in <a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">Fig. 4</a>), which is a function that closely fits the data. <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$c_{u,v} (t_{k})$\n</tex-math></inline-formula> changes according to the location of node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v\\in V^{s}$\n</tex-math></inline-formula> and the position of UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula>, since both influence <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$SNR_{u,v}$\n</tex-math></inline-formula>.</p><p>For the node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v \\in V^{s}$\n</tex-math></inline-formula>, the traffic being forwarded by UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> is modeled by an M/D/1 queue <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$Q_{u,v}$\n</tex-math></inline-formula> (Poisson arrival, deterministic service time, 1 server) <a ref-type=\"bibr\" anchor=\"ref49\" id=\"context_ref_49_3\">[49]</a>. Traffic arrives at queue <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$Q_{u,v}$\n</tex-math></inline-formula> with arrival rate <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\lambda _{u,v}$\n</tex-math></inline-formula> packet/s and is served with a service rate <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mu _{u,v}$\n</tex-math></inline-formula> packet/s. The average delay <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$D_{u,v}(t_{k})$\n</tex-math></inline-formula> of a packet generated by node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v\\in V^{s}$\n</tex-math></inline-formula> at time instant <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$t_{k}$\n</tex-math></inline-formula> is computed using <a ref-type=\"disp-formula\" anchor=\"deqn7\" href=\"#deqn7\" class=\"fulltext-link\">(7)</a>.<disp-formula id=\"deqn7\" class=\"display-formula\"><tex-math notation=\"LaTeX\">\\begin{align*}&amp;\\hspace {-.5pc} D_{u,v}(t_{k}) = \\frac {1}{\\mu _{u,v}} \\cdot \\frac {\\rho _{u,v}}{2 \\cdot \\mu _{u,v} \\cdot (1-\\rho _{u,v})} \\cdot 1_{u}(t_{k}), \\\\&amp;\\forall u \\in U, \\forall v \\in V^{s}, \\forall s \\in S \\tag{7}\\end{align*}\n</tex-math><span class=\"formula\"><span class=\"link\">View Source</span><img aria-describedby=\"qtip-0\" style=\"display:inline;\" title=\"Right-click on figure or equation for MathML and additional features.\" data-hasqtip=\"0\" class=\"qtooltip moreInfo\" alt=\"Right-click on figure for MathML and additional features.\" src=\"/assets/img/icon.support.gif\" border=\"0\" height=\"20\" width=\"24\"/><span class=\"tex tex2jax_ignore\" style=\"display:none;\">\\begin{align*}&amp;\\hspace {-.5pc} D_{u,v}(t_{k}) = \\frac {1}{\\mu _{u,v}} \\cdot \\frac {\\rho _{u,v}}{2 \\cdot \\mu _{u,v} \\cdot (1-\\rho _{u,v})} \\cdot 1_{u}(t_{k}), \\\\&amp;\\forall u \\in U, \\forall v \\in V^{s}, \\forall s \\in S \\tag{7}\\end{align*}\n</span></span></disp-formula> where:</p><p><inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\rho _{u,v} = \\frac {\\lambda _{u,v}}{\\mu _{u,v}} &lt; 1$\n</tex-math></inline-formula>, <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\lambda _{u,v} \\neq 0, \\forall u \\in U, \\forall v \\in V^{s}, \\forall s \\in S$\n</tex-math></inline-formula></p><p><inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mu _{u,v} = \\sum _{u \\in U} c_{u,v} \\cdot w_{u,v}, \\forall v \\in V^{s}$\n</tex-math></inline-formula>, <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\forall s \\in S$\n</tex-math></inline-formula></p><p>For each node <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$v \\in V^{s}$\n</tex-math></inline-formula>, the average packet delay when served by a given UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> must be lower than or equal to the maximum average packet delay <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$H^{s}$\n</tex-math></inline-formula> associated with network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s$\n</tex-math></inline-formula>, as given by <a ref-type=\"disp-formula\" anchor=\"deqn8\" href=\"#deqn8\" class=\"fulltext-link\">(8)</a>.<disp-formula id=\"deqn8\" class=\"display-formula\"><tex-math notation=\"LaTeX\">\\begin{equation*} D_{u,v} \\cdot 1_{u}(t_{k}) \\leq H^{s}, \\forall u \\in U, \\forall v \\in V^{s}, \\forall s \\in S \\tag{8}\\end{equation*}\n</tex-math><span class=\"formula\"><span class=\"link\">View Source</span><img aria-describedby=\"qtip-0\" style=\"display:inline;\" title=\"Right-click on figure or equation for MathML and additional features.\" data-hasqtip=\"0\" class=\"qtooltip moreInfo\" alt=\"Right-click on figure for MathML and additional features.\" src=\"/assets/img/icon.support.gif\" border=\"0\" height=\"20\" width=\"24\"/><span class=\"tex tex2jax_ignore\" style=\"display:none;\">\\begin{equation*} D_{u,v} \\cdot 1_{u}(t_{k}) \\leq H^{s}, \\forall u \\in U, \\forall v \\in V^{s}, \\forall s \\in S \\tag{8}\\end{equation*}\n</span></span></disp-formula></p><p>Herein, we consider average QoS values for illustrative purposes, but an SLA established with a Mobile Network Operator can also refer maximum values (e.g., the longest packet delay among all packet delay values) or median values (e.g., 50 <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$^{\\mathrm{ th}}$\n</tex-math></inline-formula> percentile of the frequency distribution of packet delays) <a ref-type=\"bibr\" anchor=\"ref50\" id=\"context_ref_50_3\">[50]</a>.</p><p>The problem addressed by this article consists in minimizing the cost of deploying a slicing-aware flying access and backhaul network able to meet the coverage and QoS levels of any network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>, including a minimum average data rate <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$T^{s}$\n</tex-math></inline-formula> and a maximum average packet delay <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$H^{s}$\n</tex-math></inline-formula>. Solving this problem includes determining the minimum number of UAVs to use, including FAPs and FGWs, their 3D positions, and the number of wireless channels they provide. We assume that there is a set of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$N$\n</tex-math></inline-formula> predefined 3D positions where potential UAVs are placed. Placing a FAP <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$f \\in U^{f}$\n</tex-math></inline-formula> at <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$P_{u}$\n</tex-math></inline-formula>, at time instant <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$t_{k}$\n</tex-math></inline-formula>, has a fixed cost <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$F^{f}$\n</tex-math></inline-formula>, where <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$F^{f}$\n</tex-math></inline-formula> is a constant associated with the usage of FAP <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$f$\n</tex-math></inline-formula>. Similarly, placing a FGW <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$g \\in U^{g}$\n</tex-math></inline-formula> at <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$P_{u}$\n</tex-math></inline-formula>, at time instant <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$t_{k}$\n</tex-math></inline-formula>, has a fixed cost <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$F^{g}$\n</tex-math></inline-formula>, where <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$F^{g}$\n</tex-math></inline-formula> is a constant associated with the usage of FGW <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$g$\n</tex-math></inline-formula>. The costs <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$F^{f}$\n</tex-math></inline-formula> and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$F^{g}$\n</tex-math></inline-formula> may be defined according to multiple criteria, such as the cost of the hardware carried on board the UAV, the type of UAV (FAP or FGW), and the operating cost of each UAV. The solution aims at ensuring that each FAP provides sufficient communications resources to meet the requirements of the ground users served, each associated with a given network slice. In turn, the communications resources provided by each FAP must also be made available in the wireless link established between the FAP and the corresponding FGW, in order to meet the QoS requirements associated with each network slice in the access and backhaul networks.</p><p>Accomplishing a slicing-aware flying access and backhaul network involves multiple research challenges, including: 1) meeting the different QoS levels of multiple network slices on top of a shared physical wireless network infrastructure; 2) determining the minimum number of UAVs required and their placement, in order to simultaneously provide coverage with minimum targeted SNR values to multiple network slices made available in different geographical areas; and 3) achieving a global admissible solution for the placement and allocation of communications resources, formulated as an optimization problem, in a time compliant with the network reconfiguration period, while ensuring the minimum number of UAVs and wireless channels required to meet the QoS levels of multiple network slices.</p><p>Our optimization problem, including the objective function, is defined in <a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9)</a>. <disp-formula id=\"deqn9a-deqn9i\" class=\"display-formula\"><tex-math notation=\"LaTeX\">\\begin{align*}&amp;\\hspace {-.5pc}\\!\\underset {{w_{g,f}(t_{k}), 1_{g}(t_{k}), w_{f,r_{a}}(t_{k}), 1_{f}(t_{k})}} {\\textrm {minimize}} \\sum _{g \\in U^{g}} F^{g} \\cdot 1_{g}(t_{k}) \\!\\!\\!\\!\\! \\\\&amp;\\qquad \\qquad \\qquad + \\sum _{f \\in U^{f}} F^{f} \\cdot 1_{f}(t_{k}), \\forall a \\in A \\tag{9a}\\\\&amp;\\qquad \\!\\textrm {subject to:} ~\\sum _{f \\in U^{f}} w_{g,f}(t_{k}) \\leq W_{g}, \\forall g \\in U^{g} \\tag{9b}\\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} \\sum _{g \\in U^{g}} c_{g,f}(t_{k}) \\cdot w_{g,f} (t_{k}) \\!\\geq \\! c_{f,r_{a}}(t_{k}) \\cdot w_{f,r_{a}} (t_{k}), \\!\\!\\!\\!\\! \\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} \\forall f \\in U^{f}, \\forall a \\in A^{s}, \\forall s \\in S \\tag{9c}\\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} K_{g,f}(t_{k}) = 1, \\forall g \\in U^{g}, \\forall f \\in U^{f} \\tag{9d}\\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} \\sum _{a \\in A^{s}} w_{f,r_{a}}(t_{k}) \\leq W_{f}, \\forall f \\in U^{f} \\tag{9e}\\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} \\sum _{f \\in U^{f}} c_{f,r_{a}}(t_{k}) \\cdot w_{f,r_{a}} (t_{k}) \\geq T^{s}, \\forall a \\in A^{s},\\!\\!\\!\\!\\! \\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~}\\forall s \\in S \\tag{9f}\\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} K_{f,r_{a}}(t_{k}) = 1, \\forall f \\in U^{f}, \\forall a \\in A^{s}, \\forall s \\in S \\tag{9g}\\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} D_{f,r_{a}} \\cdot 1_{f}(t_{k}) + D_{g,f} \\cdot 1_{g}(t_{k}) \\!\\leq \\! H^{s}, \\forall f \\!\\in \\! U^{f},\\!\\!\\!\\!\\!\\! \\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} \\forall g \\in U^{g}, \\forall a \\in A^{s}, \\forall s \\in S \\tag{9h}\\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} 1_{f}(t_{k}) + 1_{g}(t_{k}) \\leq 1, \\forall f \\in U^{f}, \\forall g \\in U^{g} \\tag{9i}\\end{align*}\n</tex-math><span class=\"formula\"><span class=\"link\">View Source</span><img aria-describedby=\"qtip-0\" style=\"display:inline;\" title=\"Right-click on figure or equation for MathML and additional features.\" data-hasqtip=\"0\" class=\"qtooltip moreInfo\" alt=\"Right-click on figure for MathML and additional features.\" src=\"/assets/img/icon.support.gif\" border=\"0\" height=\"20\" width=\"24\"/><span class=\"tex tex2jax_ignore\" style=\"display:none;\">\\begin{align*}&amp;\\hspace {-.5pc}\\!\\underset {{w_{g,f}(t_{k}), 1_{g}(t_{k}), w_{f,r_{a}}(t_{k}), 1_{f}(t_{k})}} {\\textrm {minimize}} \\sum _{g \\in U^{g}} F^{g} \\cdot 1_{g}(t_{k}) \\!\\!\\!\\!\\! \\\\&amp;\\qquad \\qquad \\qquad + \\sum _{f \\in U^{f}} F^{f} \\cdot 1_{f}(t_{k}), \\forall a \\in A \\tag{9a}\\\\&amp;\\qquad \\!\\textrm {subject to:} ~\\sum _{f \\in U^{f}} w_{g,f}(t_{k}) \\leq W_{g}, \\forall g \\in U^{g} \\tag{9b}\\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} \\sum _{g \\in U^{g}} c_{g,f}(t_{k}) \\cdot w_{g,f} (t_{k}) \\!\\geq \\! c_{f,r_{a}}(t_{k}) \\cdot w_{f,r_{a}} (t_{k}), \\!\\!\\!\\!\\! \\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} \\forall f \\in U^{f}, \\forall a \\in A^{s}, \\forall s \\in S \\tag{9c}\\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} K_{g,f}(t_{k}) = 1, \\forall g \\in U^{g}, \\forall f \\in U^{f} \\tag{9d}\\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} \\sum _{a \\in A^{s}} w_{f,r_{a}}(t_{k}) \\leq W_{f}, \\forall f \\in U^{f} \\tag{9e}\\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} \\sum _{f \\in U^{f}} c_{f,r_{a}}(t_{k}) \\cdot w_{f,r_{a}} (t_{k}) \\geq T^{s}, \\forall a \\in A^{s},\\!\\!\\!\\!\\! \\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~}\\forall s \\in S \\tag{9f}\\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} K_{f,r_{a}}(t_{k}) = 1, \\forall f \\in U^{f}, \\forall a \\in A^{s}, \\forall s \\in S \\tag{9g}\\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} D_{f,r_{a}} \\cdot 1_{f}(t_{k}) + D_{g,f} \\cdot 1_{g}(t_{k}) \\!\\leq \\! H^{s}, \\forall f \\!\\in \\! U^{f},\\!\\!\\!\\!\\!\\! \\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} \\forall g \\in U^{g}, \\forall a \\in A^{s}, \\forall s \\in S \\tag{9h}\\\\&amp;\\hphantom {\\qquad \\!\\textrm {subject to:} ~} 1_{f}(t_{k}) + 1_{g}(t_{k}) \\leq 1, \\forall f \\in U^{f}, \\forall g \\in U^{g} \\tag{9i}\\end{align*}\n</span></span></disp-formula></p><p>In optimization problem <a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9)</a>, the objective function <a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9a)</a> minimizes the overall cost of deploying a slicing-aware flying access and backhaul network, which consists of the sum of the costs associated with the FGWs and FAPs used at any time instant <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$t_{k}$\n</tex-math></inline-formula>. Solving the problem includes identifying the potential UAVs to actually use and their role (whether FAP or FGW) in the slicing-aware flying access and backhaul network, considering the following constraints at any time instant <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$t_{k}$\n</tex-math></inline-formula>: \n<ul style=\"list-style-type:disc\"><li><p><a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9b)</a> ensures that the number of wireless channels provided by FGW <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$g$\n</tex-math></inline-formula> to FAP <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$f$\n</tex-math></inline-formula> is lower than or equal to the total number of wireless channels available at FGW <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$g$\n</tex-math></inline-formula>.</p></li><li><p><a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9c)</a> ensures that the capacity, in bit/s, of the wireless links established between FGW <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$g$\n</tex-math></inline-formula> and FAP <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$f$\n</tex-math></inline-formula> is higher than or equal to the capacity, in bit/s, of the wireless link established between FAP <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$f$\n</tex-math></inline-formula> and the ground user in the center of subarea <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a \\in A^{s}$\n</tex-math></inline-formula>, in order to meet the QoS requirements of the network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>.</p></li><li><p><a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9d)</a> ensures that FAP <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$f$\n</tex-math></inline-formula> is served by one and only one FGW <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$g$\n</tex-math></inline-formula>.</p></li><li><p><a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9e)</a> ensures that the number of wireless channels provided by FAP <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$f$\n</tex-math></inline-formula> to the ground user in the center of subarea <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a \\in A^{s}$\n</tex-math></inline-formula> is lower than or equal to the total number of wireless channels available at FAP <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$f$\n</tex-math></inline-formula>.</p></li><li><p><a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9f)</a> ensures that the capacity, in bit/s, of the wireless links established between FAP <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$f$\n</tex-math></inline-formula> and the ground user in the center of subarea <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a \\in A^{s}$\n</tex-math></inline-formula> is higher than or equal to the minimum average data rate enabled by network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>.</p></li><li><p><a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9g)</a> ensures that the ground user in the center of subarea <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a \\in A^{s}$\n</tex-math></inline-formula> is served by one and only one FAP <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$f$\n</tex-math></inline-formula>.</p></li><li><p><a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9h)</a> ensures that the average packet delay, in seconds, carried between the ground user in the center of subarea <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a \\in A^{s}$\n</tex-math></inline-formula> and FGW <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$g$\n</tex-math></inline-formula>, through FAP <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$f$\n</tex-math></inline-formula>, is lower than or equal to the maximum average packet delay enabled by network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>.</p></li><li><p><a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9i)</a> ensures that a potential UAV <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$u$\n</tex-math></inline-formula> can only perform the role of FAP or FGW at the same time.</p></li></ul></p><p>The objective function <a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9a)</a> allows to minimize the number of UAVs used, since we are focused on minimizing the cost of deploying a slicing-aware flying access and backhaul network. In order to improve the spectral efficiency, the objective function can be evolved as future research to optimize the number of wireless channels used by UAV.</p></div>\n<div class=\"section\" id=\"sec4\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION IV.</div><h2>SurFABle ALGORITHM</h2></div><p>In order to place and allocate communications resources in slicing-aware flying access and backhaul networks, we propose the SurFABle algorithm. SurFABle is intended to run in a Central Station deployed in the Cloud or at the Edge of the flying access and backhaul network. The Central Station is in charge of sending the up-to-date UAV positions and network configuration computed by SurFABle. The FAPs and the FGWs position and reconfigure themselves based on the information received. For exchanging data between the Central Station and the UAVs, an out-of-band long-range wireless channel (e.g., based on IEEE 802.11ah) is used. It allows for an always-on control link, even when the flying access and backhaul network is being reconfigured, and avoids introducing overhead in the access and backhaul network. The design of the out-of-band wireless communications solution is beyond the scope of this article.</p><p>Inspired by the capacitated facility location problem <a ref-type=\"bibr\" anchor=\"ref51\" id=\"context_ref_51_4\">[51]</a>, a classical optimization problem that aims at selecting the best among potential locations for a factory or warehouse, SurFABle initially represents the venue where UAVs can be deployed as a cuboid <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$C$\n</tex-math></inline-formula> (step 1 of <a ref-type=\"algorithm\" anchor=\"alg1\" class=\"fulltext-link\">Algorithm 1</a>). Cuboid <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$C$\n</tex-math></inline-formula> is divided into a set of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$N$\n</tex-math></inline-formula> smaller subcuboids, each associated with a potential UAV deployed at <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$P_{u}$\n</tex-math></inline-formula> (step 2), and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$M$\n</tex-math></inline-formula> ground subareas (step 3), each occupied by a ground user in the central position. Any potential UAV is suitable to act as a real FAP or FGW, if it is part of the final solution determined by SurFABle. Each ground user is associated with a known traffic demand, in bit/s, and a maximum average packet delay, in seconds, both of which are values associated with the SLA of a given network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>.<div class=\"algorithm\" id=\"alg1\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION Algorithm 1</div><h2>SurFABle – Slicing-aware Flying Access and Backhaul Network</h2></div><p><b>Input:</b></p><p>\n<ol><li><p>Venue dimensions (<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~ \\text {m}^{3}}$\n</tex-math></inline-formula>)</p></li><li><p>Number of wireless channels and channel bandwidth (<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~ \\text {Hz}}$\n</tex-math></inline-formula>) available per potential UAV</p></li><li><p>User density (<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~users/ \\text {m}^{2}}$\n</tex-math></inline-formula>) per network slice</p></li><li><p>Traffic demand (<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~bit/ \\text {s}}$\n</tex-math></inline-formula>) per network slice</p></li><li><p>Maximum packet delay (<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~ \\text {s}}$\n</tex-math></inline-formula>) per network slice</p></li></ol></p><p><b>Output:</b></p><p>\n<ol><li><p>FAPs and FGWs positions (3D Cartesian coordinates)</p></li><li><p>Number of wireless channels provided by each FAP and FGW</p></li><li><p>Association between FGWs, FAPs and ground users served</p></li></ol></p><p><b>Steps:</b></p><p>Represent the venue as a cuboid <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$C$\n</tex-math></inline-formula></p><p>Discretize cuboid <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$C$\n</tex-math></inline-formula> into <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$N$\n</tex-math></inline-formula> subcuboids centered at <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$P_{u}$\n</tex-math></inline-formula></p><p>Discretize base of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$C$\n</tex-math></inline-formula> into <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$M$\n</tex-math></inline-formula> subareas <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a \\in A$\n</tex-math></inline-formula></p><p>Compute <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$SNR_{u,v}$\n</tex-math></inline-formula> for the wireless link available between the potential UAVs themselves and between the potential UAVs and the ground users</p><p>Compute the network capacity <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$c_{u,v}$\n</tex-math></inline-formula> that each potential UAV can provide using the available wireless links</p><p>Solve optimization problem <a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9)</a> using a state of the art solver</p><p>Assign wireless channels</p></div></p><p>In order to solve the problem, SurFABle calculates the SNR of the wireless links that can be established between each potential UAV and the ground user in the center of each subarea <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a\\in A^{s}$\n</tex-math></inline-formula>, as well as between the potential UAVs themselves (step 4). Then, it calculates the network capacity that can be achieved when using the minimum channel bandwidth block that each potential UAV can provide (step 5). The minimum channel bandwidth block is a configuration parameter that can be specified whether in terms of the number of Orthogonal Frequency-Division Multiple Access (OFDMA) Resource Units (RUs) for IEEE 802.11ax or 5G New Radio (NR), or in terms of the number of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> wireless channels for IEEE 802.11.</p><p>SurFABle uses a state of the art solver to identify the potential UAVs to actually use, their role in the flying access and backhaul network, whether FAP or FGW, and the number of wireless channels to be made available by each UAV. Each potential UAV has a given cost and a limited number of wireless channels available. The objective is to minimize the cost of deploying a slicing-aware flying access and backhaul network. The solver must simultaneously ensure that 1) each network slice’s SLA is met and 2) the capacity of each UAV in terms of the total number of wireless channels available is not exceeded (step 6).</p><p>The Gurobi <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$^{\\mathrm{ TM}}$\n</tex-math></inline-formula> <a ref-type=\"bibr\" anchor=\"ref52\" id=\"context_ref_52_4\">[52]</a> optimizer is used in the current version of SurFABle. A cost of 1000 and a set of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$8 \\times {\\mathrm {20\\,\\, \\text {M} \\text {Hz} }}$\n</tex-math></inline-formula> wireless channels per potential UAV, which enable a total channel bandwidth of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {160~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula>, were considered. As shown in <a ref-type=\"fig\" anchor=\"fig3\" class=\"fulltext-link\">Fig. 3</a>, the resulting solution determined by SurFABle consists of the UAVs acting as FAPs or FGWs, which are associated with a known 3D location, and the number of wireless channels that they must provide to each subarea. When a potential UAV does not provide resources to any of the subareas, its cost is zero, and it is not used in the flying access and backhaul network.</p><p>As a precise network resource allocation is not possible in some technologies, such as IEEE 802.11, where the channel bandwidth must be an integer multiple of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula>, SurFABle allocates resources employing a heuristic-based channel assignment approach (step 7). This channel assignment approach also allows for a reduction in the overall bandwidth used while ensuring the QoS guarantees. To that end, each wireless channel is assigned to as many subareas as possible, in order to reduce the overall bandwidth used by sharing the available spectral resources. The channel bandwidth allocated to each subarea is computed by multiplying the number of wireless channels derived from the optimization problem <a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9)</a> with the minimum channel bandwidth block enabled by the technology used. <a ref-type=\"fig\" anchor=\"fig5\" class=\"fulltext-link\">Fig. 5</a> shows an illustrative example for a network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>. Without the channel assignment approach employed by the SurFABle algorithm, the total bandwidth required is <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {140~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula>, as shown in <a ref-type=\"fig\" anchor=\"fig5\" class=\"fulltext-link\">Fig. 5a</a>. This baseline channel assignment approach takes into account different <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> wireless channels assigned to each subarea <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a\\in A^{s}$\n</tex-math></inline-formula>. The higher the number of subareas <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a\\in A^{s}$\n</tex-math></inline-formula> the higher the total channel bandwidth required– each row in <a ref-type=\"fig\" anchor=\"fig5\" class=\"fulltext-link\">Fig. 5a</a> corresponds to a subarea <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a\\in A^{s}$\n</tex-math></inline-formula>. However, because the bandwidth used for each subarea <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a\\in A^{s}$\n</tex-math></inline-formula> is far from the full channel bandwidth available, this baseline channel assignment approach has a reduced spectral efficiency. With SurFABle’s channel assignment, the total bandwidth used is reduced to <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {100~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula>. This is accomplished by using the maximum available bandwidth of each wireless channel while assigning the same wireless channel to the maximum number of subareas <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a\\in A^{s}$\n</tex-math></inline-formula>, as shown in <a ref-type=\"fig\" anchor=\"fig5\" class=\"fulltext-link\">Fig. 5b</a>.\n<div class=\"figure figure-full\" id=\"fig5\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh5-3227653-large.gif\" data-fig-id=\"fig5\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh5-3227653-small.gif\" alt=\"FIGURE 5. - Resource allocation performed by SurFABle, considering the minimum channel bandwidth block equal to 20 MHz [2].\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 5. </b><fig><p>Resource allocation performed by SurFABle, considering the minimum channel bandwidth block equal to 20 MHz <a ref-type=\"bibr\" anchor=\"ref2\" id=\"context_ref_2_4\">[2]</a>.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div></p><p>The forwarding tables of the FAPs, used to exchange data traffic between the ground users and the assigned FGW in a two-hop architecture, are defined by the RedeFINE routing protocol <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_4\">[46]</a>. Finally, the flying access and backhaul network is reconfigured accordingly.</p><p>The spatial component of the problem solved by SurFABle is related with the number of communications resources to allocate to each subarea. For that purpose, we consider that each ground user, placed in the center of a given subarea <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a\\in A^{s}$\n</tex-math></inline-formula>, represents the aggregate traffic generated within that subarea. We considered this approach since we assume the SLA established between a Service Provider and a Mobile Network Operator includes information on the number of users per area unit, in user/m <sup>2</sup>. Moreover, a precise location of the ground users is typically not known and can include some deviations between the expected and the real positions over time. The discretization of the space into subareas allows to overcome these challenges, and it can be fine-tuned according to multiple criteria; this aspect is left for future work.</p><p>Regarding the spectrum component, SurFABle was designed with recently released and emerging wireless technologies in mind, such as 5G NR and IEEE 802.11ax, in which the number of spectral resources is expressed as the number of RUs, called generically as wireless channels herein. This allows to accurately allocate the number of wireless channels computed by SurFABle using minimum channel bandwidth, since each RU is typically characterized by a few kHz of channel bandwidth. The smaller the bandwidth of the available channels the more efficient SurFABle is, since it allows to reduce the underused spectrum per wireless channel. When legacy technologies such as IEEE 802.11 are used, which do not allow to define a precise channel bandwidth per subarea, the channel assignment approach employed by SurFABle allows to reduce the overall bandwidth required. This makes SurFABle agnostic to the technology used by the flying access and backhaul network.</p></div>\n<div class=\"section\" id=\"sec5\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION V.</div><h2>Performance Evaluation</h2></div><p>The performance evaluation of the SurFABle algorithm is described in this section. Firstly, we explain the evaluation methodology. Secondly, we characterize the networking scenarios and the state of the art counterparts considered. Thirdly, we present and discuss the ns-3 simulation results. Fourthly, we detail the experimental setup. Fifthly, we present and discuss the experimental results.</p><div class=\"section_2\" id=\"sec5a\"><h3>A. Methodology</h3><p>A theoretical performance evaluation requires many simplifications, due to the high complexity of the problem addressed by this article. It potentially leads to unrealistic results. For this reason, the performance evaluation of the SurFABle algorithm was carried out by means of ns-3 simulations and an experimental testbed. On the one hand, the ns-3 simulations allow to evaluate the performance of SurFABle in complex networking scenarios, characterized by high variability regarding the communications nodes’ positions and network configurations. The ns-3 simulator <a ref-type=\"bibr\" anchor=\"ref6\" id=\"context_ref_6_5a\">[6]</a> was chosen due to a) its accurate models for wireless networks that lead to realistic results and b) its wide acceptance by the scientific community. On the other hand, the experimental testbed allows to validate in the real-world the results obtained by means of ns-3 simulations for representative networking scenarios.</p><p>The performance evaluation considers three performance metrics: \n<ul style=\"list-style-type:disc\"><li><p><b>Throughput:</b> the average number of bits received per second by the sink application at the FGWs, in bit/s.</p></li><li><p><b>Packet Delivery Ratio (PDR):</b> the average ratio between the number of packets received by the sink application at the FGWs and the number of packets generated by the source application at the ground users.</p></li><li><p><b>Delay:</b> the average time interval since the packets are generated by the source application at the ground users until they reach the sink application at the FGWs. It includes queuing, transmission, and propagation delays.</p></li></ul> The average values of throughput, packet delivery ratio (PDR), and packet delay for each network slice were measured every second for each performed experiment. The results are represented by means of the Cumulative Distribution Function (CDF) for the packet delay and by the complementary CDF (CCDF) for the throughput and PDR. The CDF <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$F(x)$\n</tex-math></inline-formula> represents the percentage of samples for which the delay is lower than or equal to <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$x$\n</tex-math></inline-formula>, while the CCDF <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$F'(x)$\n</tex-math></inline-formula> represents the percentage of samples for which the throughput and PDR are higher than <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$x$\n</tex-math></inline-formula>.</p></div><div class=\"section_2\" id=\"sec5b\"><h3>B. Networking Scenarios</h3><p>Three sets of networking scenarios were considered: 1) five scenarios composed of 5 ground users; 2) five scenarios composed of 20 ground users; and 3) five scenarios composed of 40 ground users. In all networking scenarios, each ground user was randomly associated to a network slice type (whether eMBB or URLLC) and randomly positioned on the ground of a venue with dimensions up to <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$X= {\\mathrm {100\\,\\, \\text {m}}}$\n</tex-math></inline-formula>, <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$Y= {\\mathrm {100\\,\\, \\text {m}}}$\n</tex-math></inline-formula>, <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$Z= {\\mathrm {20\\,\\, \\text {m}}}$\n</tex-math></inline-formula>. The number of subareas was determined by taking into account the occupation of the base of the cuboid <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$C$\n</tex-math></inline-formula> (area <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$A$\n</tex-math></inline-formula>) equal to 5%, 20%, and 40% of the total area available. Each ground user was identified by a traffic demand <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$T^{s}$\n</tex-math></inline-formula> equal to <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {4~Mbit/s}$\n</tex-math></inline-formula>, <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {8~Mbit/s}$\n</tex-math></inline-formula> or <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~Mbit/s}$\n</tex-math></inline-formula>, which correspond to respectively 5%, 10%, and 25% of the data rate associated with the highest MCS index for <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> channel bandwidth, <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {800~ \\text {n} \\text {s} }$\n</tex-math></inline-formula> Guard Interval, and single spatial stream wireless links (<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {78~Mbit/s}$\n</tex-math></inline-formula>). In the ns-3 simulations, we assumed <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$BER^{eMBB} = 10 {^{\\mathrm{ -5}}}$\n</tex-math></inline-formula> and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$BER^{URLLC} = 10 {^{\\mathrm{ -10}}}$\n</tex-math></inline-formula>, which define the minimum SNR values required for transmitting a frame using any MCS index with the network configuration employed.</p><p>We consider that each networking scenario is composed of static ground users, each representing the aggregate traffic generated within the subarea it is placed. Each networking scenario corresponds to a snapshot of the flying access and backhaul network at <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$t_{k} = k \\cdot \\Delta t, k \\in \\mathbb {N}_{0}$\n</tex-math></inline-formula>, where the network reconfiguration period is <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\Delta t \\gg {\\mathrm {1~ \\text {s}}}$\n</tex-math></inline-formula>. In a real-world deployment, each network reconfiguration entails solving the problem again to find an up-to-date solution. <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\Delta t$\n</tex-math></inline-formula> is a networking scenario parameter that can be adjusted to achieve a trade-off between the stability of the flying access and backhaul network, the performance requirements defined by the SLAs of the network slices offered, and the time required to determine a suitable solution for the placement and allocation of communications resources.</p><p>The details regarding the network configurations employed in the evaluation using ns-3 simulations and the experimental testbed are presented in <a ref-type=\"table\" anchor=\"table2\" class=\"fulltext-link\">Table 2</a>.<div class=\"figure figure-full table\" id=\"table2\"><div class=\"figcaption\"><b class=\"title\">TABLE 2 </b>\nNetworking parameters used in the evaluation of the SurFABle algorithm. IEEE 802.11 was used due to its ubiquity, cost-effectiveness, and the flexibility it offers for evaluating network performance in both simulation and experimentation, using the same exact conditions. Yet, the problem formulation and SurFABle are agnostic to the technology used.</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh.t2-3227653-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh.t2-3227653-small.gif\" alt=\"Table 2- &#10;Networking parameters used in the evaluation of the SurFABle algorithm. IEEE 802.11 was used due to its ubiquity, cost-effectiveness, and the flexibility it offers for evaluating network performance in both simulation and experimentation, using the same exact conditions. Yet, the problem formulation and SurFABle are agnostic to the technology used.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p><p>Two network slice types were considered: \n<ul style=\"list-style-type:disc\"><li><p><b>eMBB network slice</b>, designed to enable the use of rich-media applications (e.g., video streaming) with an average throughput of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~Mbit/s}$\n</tex-math></inline-formula> per ground user (subarea) and an average delay up to <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {100~ \\text {m} \\text {s} }$\n</tex-math></inline-formula>.</p></li><li><p><b>URLLC network slice</b>, designed to enable the use of mission-critical applications (e.g., communications for first-responders) with an average throughput of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {4~Mbit/s}$\n</tex-math></inline-formula> (evaluation using ns-3 and the experimental testbed), and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {8~Mbit/s}$\n</tex-math></inline-formula> (evaluation in ns-3 only) per ground user (subarea) and average delay up to <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {10~ \\text {m} \\text {s} }$\n</tex-math></inline-formula>.</p></li></ul></p><p>The lower target throughput values (<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {4~Mbit/s}$\n</tex-math></inline-formula>) considered in the joint evaluation in ns-3 and in the experimental testbed were due to the reduced channel bandwidth enabled by the hardware used in the testbed. This motivated the definition of less demanding throughput requirements to reach at least one possible solution for the networking scenarios employed. It is worth noting that this does not compromise the validity of the performance evaluation carried out, since the same exact conditions were considered in the networking scenarios subject to joint evaluation in ns-3 and using the testbed.</p><p>The two types of network slices were defined to take into account networking performance requirements imposed by representative applications. Yet, the optimization problem formulated in <a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9)</a> and the SurFABle algorithm are valid for any number and type of network slices, as well as different network performance requirements. This is a step forward with respect to the literature, such as the approach used by IEEE 802.11e, which provides four different QoS classes only, according to the traffic type, but does not allow to ensure different QoS guarantees for traffic flows of the same type.</p></div><div class=\"section_2\" id=\"sec5c\"><h3>C. State of the Art Counterparts</h3><p>We considered three state of the art counterparts in the performance evaluation. All the state of the art counterparts ensure that each used UAV provides network resources only to subareas that belong to the same network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula> so that resource isolation is guaranteed. This ensures that each network slice represents an independent network in practice.</p><p>The following state of the art counterparts were considered: \n<ul style=\"list-style-type:disc\"><li><p><b><i>k</i>-means clustering.</b> This approach allows providing each subarea with at least the same amount of channel bandwidth calculated by SurFABle. However, it defines a non QoS-aware placement for the FAPs. This potentially leads to wireless links not having a high enough SNR to allow for a network capacity capable of accommodating the offered traffic. Moreover, it requires as many UAVs as the number of clusters of subareas formed. This state of the art counterpart aims at showing that the independent allocation and placement of communications resources does not allow meeting the targeted performance requirements and leads to a greater amount of communications resources needed.</p><p>First, the <i>k</i>-means clustering algorithm defines <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\left |{ K }\\right |$\n</tex-math></inline-formula> random positions as clusters’ centroids. Then, it assigns each subarea <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a\\in A^{s}$\n</tex-math></inline-formula> to the nearest cluster by calculating distances to clusters’ centroids. After that, it determines the up-to-date cluster’s centroid by computing the average position among the assigned subareas, which is the position where a FAP must be placed, at <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {10~ \\text {m}}$\n</tex-math></inline-formula> altitude– since the height of the cuboid <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$C$\n</tex-math></inline-formula> considered for deploying the UAVs is <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~ \\text {m}}$\n</tex-math></inline-formula>, in the <inline-formula id=\"\"><tex-math notation=\"LaTeX\">${k}$\n</tex-math></inline-formula>-means clustering algorithm we considered the FAPs, in the first tier, are placed at <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {10~ \\text {m}}$\n</tex-math></inline-formula> altitude, while the FGWs, in the second tier, can be placed up to <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~ \\text {m}}$\n</tex-math></inline-formula> altitude.</p><p>Each FAP must provide the cluster’s subareas with the minimum channel bandwidth computed by SurFABle for the same exact subareas, using up to <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {160~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> channel bandwidth. When any FAP does not have enough channel bandwidth available, <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\left |{ K }\\right |$\n</tex-math></inline-formula>, initially set to 1, is successively increased by 1 and the <inline-formula id=\"\"><tex-math notation=\"LaTeX\">${k}$\n</tex-math></inline-formula>-means clustering algorithm is run again until all FAPs are able to provide the required channel bandwidth. The algorithm is run independently for each network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>, in order to ensure resource isolation. As such, the number of clusters (<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\left |{ K }\\right |$\n</tex-math></inline-formula>) can be different for each network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>.</p><p>After the placement of the FAPs is determined by means of the <inline-formula id=\"\"><tex-math notation=\"LaTeX\">${k}$\n</tex-math></inline-formula>-means clustering algorithm, the GateWay Placement (GWP) algorithm <a ref-type=\"bibr\" anchor=\"ref53\" id=\"context_ref_53_5c\">[53]</a> is used to determine the placement of a FGW serving all the FAPs associated with the same network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>. GWP enables wireless links between the FAPs and the FGW with high enough capacity to accommodate the traffic forwarded by the FAPs. Each FGW is configured with <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {160~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> channel bandwidth, which is the maximum channel bandwidth enabled by legacy IEEE standards. In this solution each UAV serves a single network slice. GWP implies the use of a single FGW for each network slice; independently allocating and placing communications resources to the access and backhaul networks increases the number of UAVs used.</p></li><li><p>Geometric center. This state of the art counterpart provides an independent network for the ground users that belong to each network slice. It aims at showing that a best-effort coverage-aware service may be insufficient to meet the requirements associated with each network slice, especially when the placement of the UAVs does not ensure a high enough SNR value for each subarea and the amount of communications resources is insufficient to meet the targeted performance requirements.</p><p>This state of the art counterpart uses one FAP and one FGW for each network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>, placed in the geometric center of all subareas <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$a\\in A^{s}$\n</tex-math></inline-formula>. For each network slice, the FAP is hovering at altitude of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {10~ \\text {m}}$\n</tex-math></inline-formula>, while the FGW is hovering exactly above the FAP at altitude of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~ \\text {m}}$\n</tex-math></inline-formula>. The FAPs make available a wireless channel with the minimum channel bandwidth computed by SurFABle, while the FGW provides the maximum possible channel bandwidth in IEEE 802.11, equal to <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {160~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula>. From the communications perspective, placing a UAV at the geometric center of all ground users that belong to the same network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula> allows maximizing the SNR offered to them.</p></li><li><p>Per network slice QoS-aware. This counterpart approach aims at showing that allocating and placing communications resources to each network slice independently implies using more communications resources than making the joint placement and allocation of communications resources to multiple network slices, as SurFABle does.</p><p>The per network slice QoS-aware approach considers that the SurFABle algorithm runs independently for each network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>. As such, it provides the exact amount of communications resources required for each network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>, while not sharing communications resources among different network slices. In the same way as the geometric center approach, it provides an independent network for each network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>; however, this solution is aware of the QoS requirements associated with each network slice <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$s \\in S$\n</tex-math></inline-formula>.</p></li></ul></p><p>It must be noted that the slicing-aware approach employed by SurFABle is achieved using different wireless channels with channel bandwidth equal to <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> (minimum channel bandwidth block allowed in IEEE 802.11). As such, considering an illustrative example where a channel bandwidth of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {60~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> is required to serve the ground users, SurFABle uses three wireless channels of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula>, totaling <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {60~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula>. On the other hand, since the <inline-formula id=\"\"><tex-math notation=\"LaTeX\">${k}$\n</tex-math></inline-formula>-means clustering and geometric center approaches use a single wireless channel per UAV, a channel bandwidth of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {80~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> is required, because it is not possible to configure a channel bandwidth of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {60~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> in IEEE 802.11. For this reason, the <inline-formula id=\"\"><tex-math notation=\"LaTeX\">${k}$\n</tex-math></inline-formula>-means and geometric center approaches tend to use more communications resources than the SurFABle algorithm.</p></div><div class=\"section_2\" id=\"sec5d\"><h3>D. Simulation Results</h3><p>The simulation results considering UDP traffic are presented in <a ref-type=\"fig\" anchor=\"fig6\" class=\"fulltext-link\">Fig. 6</a>, <a ref-type=\"fig\" anchor=\"fig7\" class=\"fulltext-link\">Fig. 7</a>, and <a ref-type=\"fig\" anchor=\"fig8\" class=\"fulltext-link\">Fig. 8</a>, whereas the simulation results for TCP traffic are presented in <a ref-type=\"fig\" anchor=\"fig9\" class=\"fulltext-link\">Fig. 9</a>, <a ref-type=\"fig\" anchor=\"fig10\" class=\"fulltext-link\">Fig. 10</a>, and <a ref-type=\"fig\" anchor=\"fig11\" class=\"fulltext-link\">Fig. 11</a>. They demonstrate that SurFABle (represented by the green circle and square markers) enables meeting the target QoS levels associated with the eMBB (<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~Mbit/s}$\n</tex-math></inline-formula>) and URLLC (<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {8~Mbit/s}$\n</tex-math></inline-formula>) network slices. For 5 subareas and UDP traffic, all solutions allow meeting the target QoS levels (cf. <a ref-type=\"fig\" anchor=\"fig6\" class=\"fulltext-link\">Fig. 6</a>), especially due to the low demand in terms of communications resources that characterize these scenarios. For this reason, the <inline-formula id=\"\"><tex-math notation=\"LaTeX\">${k}$\n</tex-math></inline-formula>-means clustering (represented by the yellow plus and orange crossed markers) and geometric center (represented by the reddish asterisk and star markers) approaches over-provision communications resources, enabling delay lower than <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {0.6~ \\text {m} \\text {s} }$\n</tex-math></inline-formula>. The network performance achieved when using <inline-formula id=\"\"><tex-math notation=\"LaTeX\">${k}$\n</tex-math></inline-formula>-means clustering and geometric center degrades significantly for TCP traffic when considering 5 subareas (cf. <a ref-type=\"fig\" anchor=\"fig9\" class=\"fulltext-link\">Fig. 9</a>), and for UDP and TCP as the number of subareas increases (cf. <a ref-type=\"fig\" anchor=\"fig7\" class=\"fulltext-link\">Fig. 7</a>, <a ref-type=\"fig\" anchor=\"fig8\" class=\"fulltext-link\">Fig. 8</a>, <a ref-type=\"fig\" anchor=\"fig10\" class=\"fulltext-link\">Fig. 10</a>, and <a ref-type=\"fig\" anchor=\"fig11\" class=\"fulltext-link\">Fig. 11</a>). On the one hand, the increase in the number of subareas leads to a greater demand for communications resources. On the other hand, due to its congestion control mechanism, TCP dynamically adjusts the traffic offered to the Internet Protocol (IP) layer so that the channel is fully utilized but not saturated. This justifies the lower throughput, PDR, and delay measured when using the state of the art counterparts (cf. <a ref-type=\"fig\" anchor=\"fig9\" class=\"fulltext-link\">Fig. 9</a> to <a ref-type=\"fig\" anchor=\"fig11\" class=\"fulltext-link\">Fig. 11</a>). In turn, the per network slice QoS-aware approach (blue downward-pointing triangle and diamond markers) brings the network performance closer to SurFABle in all scenarios, at the expense of using more UAVs.\n<div class=\"figure figure-full\" id=\"fig6\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh6-3227653-large.gif\" data-fig-id=\"fig6\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh6-3227653-small.gif\" alt=\"FIGURE 6. - Simulation average performance results for five networking scenarios composed of 5 subareas randomly associated to URLLC (8 Mbit/s) and eMBB (20 Mbit/s) network slices, considering UDP Poisson traffic.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 6. </b><fig><p><b>Simulation</b> average performance results for five networking scenarios composed of <b>5 subareas</b> randomly associated to URLLC (8 Mbit/s) and eMBB (20 Mbit/s) network slices, considering <b>UDP</b> Poisson traffic.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div>\n<div class=\"figure figure-full\" id=\"fig7\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh7-3227653-large.gif\" data-fig-id=\"fig7\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh7-3227653-small.gif\" alt=\"FIGURE 7. - Simulation average performance results for five networking scenarios composed of 20 subareas randomly associated to URLLC (8 Mbit/s) and eMBB (20 Mbit/s) network slices, considering UDP Poisson traffic.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 7. </b><fig><p><b>Simulation</b> average performance results for five networking scenarios composed of <b>20 subareas</b> randomly associated to URLLC (8 Mbit/s) and eMBB (20 Mbit/s) network slices, considering <b>UDP</b> Poisson traffic.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div>\n<div class=\"figure figure-full\" id=\"fig8\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh8-3227653-large.gif\" data-fig-id=\"fig8\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh8-3227653-small.gif\" alt=\"FIGURE 8. - Simulation average performance results for five networking scenarios composed of 40 subareas randomly associated to URLLC (8 Mbit/s) and eMBB (20 Mbit/s) network slices, considering UDP Poisson traffic.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 8. </b><fig><p><b>Simulation</b> average performance results for five networking scenarios composed of <b>40 subareas</b> randomly associated to URLLC (8 Mbit/s) and eMBB (20 Mbit/s) network slices, considering <b>UDP</b> Poisson traffic.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div>\n<div class=\"figure figure-full\" id=\"fig9\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh9-3227653-large.gif\" data-fig-id=\"fig9\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh9-3227653-small.gif\" alt=\"FIGURE 9. - Simulation average performance results for five networking scenarios composed of 5 subareas randomly associated to URLLC (8 Mbit/s) and eMBB (20 Mbit/s) network slices, considering TCP traffic.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 9. </b><fig><p><b>Simulation</b> average performance results for five networking scenarios composed of <b>5 subareas</b> randomly associated to URLLC (8 Mbit/s) and eMBB (20 Mbit/s) network slices, considering <b>TCP</b> traffic.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div>\n<div class=\"figure figure-full\" id=\"fig10\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh10-3227653-large.gif\" data-fig-id=\"fig10\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh10-3227653-small.gif\" alt=\"FIGURE 10. - Simulation average performance results for five networking scenarios composed of 20 subareas randomly associated to URLLC (8 Mbit/s) and eMBB (20 Mbit/s) network slices, considering TCP traffic.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 10. </b><fig><p><b>Simulation</b> average performance results for five networking scenarios composed of <b>20 subareas</b> randomly associated to URLLC (8 Mbit/s) and eMBB (20 Mbit/s) network slices, considering <b>TCP</b> traffic.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div>\n<div class=\"figure figure-full\" id=\"fig11\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh11-3227653-large.gif\" data-fig-id=\"fig11\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh11-3227653-small.gif\" alt=\"FIGURE 11. - Simulation average performance results for five networking scenarios composed of 40 subareas randomly associated to URLLC (8 Mbit/s) and eMBB (20 Mbit/s) network slices, considering TCP traffic.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 11. </b><fig><p><b>Simulation</b> average performance results for five networking scenarios composed of <b>40 subareas</b> randomly associated to URLLC (8 Mbit/s) and eMBB (20 Mbit/s) network slices, considering <b>TCP</b> traffic.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div></p><p>When comparing the solutions in terms of average bandwidth and number of UAVs used (cf. <a ref-type=\"fig\" anchor=\"fig12\" class=\"fulltext-link\">Fig. 12</a>), the results show that SurFABle (represented by the green horizontal line) uses only two UAVs (one FAP plus one FGW) and requires the least amount of channel bandwidth. This is achieved by ensuring a suitable placement for the FAPs and FGWs, and the allocation of multiple wireless channels with the minimum channel bandwidth block available (<inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> in IEEE 802.11), which allows for reducing the wasted channel bandwidth per wireless channel. On the other hand, although the geometric center approach (represented by the red diagonal line) uses twice the number of UAVs (two FAPs plus two FGWs) with respect to SurFABle– <a ref-type=\"fig\" anchor=\"fig12\" class=\"fulltext-link\">Fig. 12</a>, the network performance is significantly degraded as the number of subareas grows, as observed in the performance results from <a ref-type=\"fig\" anchor=\"fig6\" class=\"fulltext-link\">Fig. 6</a> to <a ref-type=\"fig\" anchor=\"fig11\" class=\"fulltext-link\">Fig. 11</a>. The <inline-formula id=\"\"><tex-math notation=\"LaTeX\">${k}$\n</tex-math></inline-formula>-means clustering algorithm (represented by the orange vertical line in <a ref-type=\"fig\" anchor=\"fig12\" class=\"fulltext-link\">Fig. 12</a>) defines a non-QoS aware placement for the FAPs. Even though it uses the highest number of UAVs and channel bandwidth, this does not result in better network performance. From the communications perspective, the <inline-formula id=\"\"><tex-math notation=\"LaTeX\">${k}$\n</tex-math></inline-formula>-means clustering algorithm provides the same SNR to all subareas within the same cluster, but it does not guarantee target SNR values, due to its non QoS-aware placement approach. As such, the wireless links may not have the minimum SNR necessary to induce the MCS indexes capable of meeting the targeted performance requirements in some networking scenarios. Moreover, the channel bandwidth calculated using SurFABle, which considers the joint placement and allocation of communications resources, is insufficient to achieve a network capacity high enough to accommodate the traffic offered when the independent resource allocation and placement made by the <inline-formula id=\"\"><tex-math notation=\"LaTeX\">${k}$\n</tex-math></inline-formula>-means clustering algorithm is employed. The problem is exacerbated because the wireless channel made available by each FAP is not shared among subareas that belong to different clusters, which leads to wasted bandwidth in underused wireless channels. The performance degradation observed when employing the <inline-formula id=\"\"><tex-math notation=\"LaTeX\">${k}$\n</tex-math></inline-formula>-means and geometric center approaches is overcome by the per network slice QoS-aware approach– <a ref-type=\"fig\" anchor=\"fig7\" class=\"fulltext-link\">Fig. 7</a> to <a ref-type=\"fig\" anchor=\"fig11\" class=\"fulltext-link\">Fig. 11</a>. It uses the SurFABle algorithm to compute the amount of channel bandwidth and placement of the UAVs for each network slice independently. However, the independent placement and allocation of communications resources employed by the per network slice QoS-aware approach results in four UAVs required (cf. blue wave line in <a ref-type=\"fig\" anchor=\"fig12\" class=\"fulltext-link\">Fig. 12b</a>)– twice as many UAVs when compared to SurFABle, which employs a slicing-aware approach.\n<div class=\"figure figure-full\" id=\"fig12\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh12-3227653-large.gif\" data-fig-id=\"fig12\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh12-3227653-small.gif\" alt=\"FIGURE 12. - Average bandwidth and number of UAVs used in networking scenarios composed of 5, 20, and 40 subareas randomly associated to URLLC (8 Mbit/s) and eMBB (20 Mbit/s) network slices, including 95% confidence intervals.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 12. </b><fig><p>Average bandwidth and number of UAVs used in networking scenarios composed of 5, 20, and 40 subareas randomly associated to URLLC (8 Mbit/s) and eMBB (20 Mbit/s) network slices, including 95% confidence intervals.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div></p><p>Despite the reduced amount of communications resources used, SurFABle allows achieving higher network performance. This is attained by ensuring a suitable placement of the FAPs and FGWs, and the allocation of a given number of channels with the minimum channel bandwidth block possible for the wireless communications technology employed (multiples of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> in the case of IEEE 802.11). This represents a significant advantage when compared with approaches that aim at improving the aggregate network performance offered, as the geometric center approach. The geometric center approach assigns to all subareas of each network slice a single wireless channel with up to <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {160~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> bandwidth, which is not enough in some networking scenarios and lead to underused channel bandwidth in others.</p></div><div class=\"section_2\" id=\"sec5e\"><h3>E. Experimental Setup</h3><p>The performance achieved when using the SurFABle algorithm was also evaluated by means of an experimental testbed. The ground users’ communications nodes consisted of <i>Raspberry Pi</i> devices running the <i>Raspberry Pi</i> Operating System (OS) <a ref-type=\"bibr\" anchor=\"ref54\" id=\"context_ref_54_5e\">[54]</a>, each equipped with a <i>Panda Wireless N600</i> <a ref-type=\"bibr\" anchor=\"ref55\" id=\"context_ref_55_5e\">[55]</a> IEEE 802.11 Network Interface Card (NIC) connected through Universal Serial Bus (USB); the NICs were configured in Infrastructure mode as IEEE 802.11 Stations (STAs). Each FAP consisted of a <i>TP-Link TL-WR902AC v3</i> <a ref-type=\"bibr\" anchor=\"ref56\" id=\"context_ref_56_5e\">[56]</a> IEEE 802.11 Access Point (AP) with two built-in independent NICs, running the <i>OpenWrt</i> Operating System (OS) <a ref-type=\"bibr\" anchor=\"ref57\" id=\"context_ref_57_5e\">[57]</a>. All the communications nodes were able to operate at <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {2.4~ \\text {G} \\text {Hz} }$\n</tex-math></inline-formula> and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {5~ \\text {G} \\text {Hz} }$\n</tex-math></inline-formula>. The <i>Raspberry Pi</i> devices were selected due to their cost-effectiveness and portability. In addition, the <i>TP-Link TL-WR902AC v3</i> <a ref-type=\"bibr\" anchor=\"ref56\" id=\"context_ref_56_5e\">[56]</a> AP model was selected due to its low weight, small dimensions, and low power consumption, which make it suitable to be used as a FAP. The experimental testbed is depicted in <a ref-type=\"fig\" anchor=\"fig13\" class=\"fulltext-link\">Fig. 13</a>. The network configuration parameters of the experimental testbed are presented in <a ref-type=\"table\" anchor=\"table2\" class=\"fulltext-link\">Table 2</a>.</p><p>Without loss of generality, we carried out the performance evaluation of SurFABle in the real-world using an access network composed of ground communications nodes only, in order to rule out the challenges associated with scalability and logistics that a greater number of communications nodes in a more complex network would require. Line-of-Sight between the communications nodes was ensured, in order to reproduce the Free-space Path Loss model considered in the theoretical system modeling.\n<div class=\"figure figure-full\" id=\"fig13\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh13-3227653-large.gif\" data-fig-id=\"fig13\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh13-3227653-small.gif\" alt=\"FIGURE 13. - Ground users’ communications nodes deployed in the experimental testbed.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 13. </b><fig><p>Ground users’ communications nodes deployed in the experimental testbed.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec5f\"><h3>F. Experimental Results</h3><p>In order to evaluate the performance achieved when using the SurFABle algorithm, the wireless channel was first modeled in terms of the data rate achieved for different SNR values, as described in <a ref-type=\"sec\" anchor=\"sec5f1\" class=\"fulltext-link\">Section V-F1</a>. Then, the network performance was assessed in terms of throughput, PDR, and delay, considering five networking scenarios composed of five static ground users’ communications nodes, as presented in <a ref-type=\"sec\" anchor=\"sec5f2\" class=\"fulltext-link\">Section V-F2</a>. The <i>iPerf3</i> tool <a ref-type=\"bibr\" anchor=\"ref58\" id=\"context_ref_58_5f\">[58]</a> was used to 1) generate UDP Constant Bit Rate (CBR) traffic from the ground users’ communications nodes towards the FAPs and 2) measure the throughput and PDR. The <i>ping</i> tool <a ref-type=\"bibr\" anchor=\"ref59\" id=\"context_ref_59_5f\">[59]</a> was used to measure the Round-Trip Time (RTT); herein, we assume that the delay is equal to half the measured RTT, since we assume symmetric wireless links. The Internet Control Message Protocol (ICMP) packets of <i>ping</i> were generated with a periodicity of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {100~ \\text {m} \\text {s} }$\n</tex-math></inline-formula>, with no other traffic being exchanged simultaneously in the network.</p><div class=\"section_2\" id=\"sec5f1\"><h4>1) Channel Modeling</h4><p>In order to determine the data rate achieved in practice for different SNR values, experimental measurements were performed for different distances between a ground user and a FAP. The measurements were carried out using two ground communications nodes in Line-of-Sight at different distances from each other, as presented in the data labels of <a ref-type=\"fig\" anchor=\"fig14\" class=\"fulltext-link\">Fig. 14</a>.\n<div class=\"figure figure-full\" id=\"fig14\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh14-3227653-large.gif\" data-fig-id=\"fig14\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh14-3227653-small.gif\" alt=\"FIGURE 14. - Experimental wireless channel capacity modeled by linear regressions between SNR and data rates obtained in practice. The data labels at each marker refer to the Euclidean distances, in meters, between the sender and the receiver considered in the experimental measurements.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 14. </b><fig><p>Experimental wireless channel capacity modeled by linear regressions between SNR and data rates obtained in practice. The data labels at each marker refer to the Euclidean distances, in meters, between the sender and the receiver considered in the experimental measurements.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div></p><p>Considering the set of SNR values and experimental data rates measured, linear regressions, which closely fit the experimental data obtained, were plotted. The linear regressions allow to define a continuous function for modeling the stepwise relation between SNR and the MCS indexes. This allowed to compute the data rate expected in practice for different SNR values by means of the empirical function obtained. Multiple measurements were carried out in a low noise environment and in a noisier environment, which led to respectively: 1) a more optimistic linear regression (cf. <a ref-type=\"fig\" anchor=\"fig14\" class=\"fulltext-link\">Fig. 14a</a>), in which a lower SNR value is required to achieve a target data rate; and 2) a more pessimistic linear regression (cf. <a ref-type=\"fig\" anchor=\"fig14\" class=\"fulltext-link\">Fig. 14b</a>), which implies greater SNR values (1.6 dB margin) to achieve the same target data rate. The different conditions of the considered environments were due to the interference from neighboring networks. The obtained linear regressions, which represent a real-world model for the wireless channel, were considered by SurFABle (cf. step 5 in <a ref-type=\"algorithm\" anchor=\"alg1\" class=\"fulltext-link\">Algorithm 1</a>) to compute the joint placement and allocation of the communications resources in the networking scenarios considered in the performance assessment carried out using the experimental testbed. The more optimistic linear regression was considered for the eMBB network slice, due to its low demanding reliability requirements. On the other hand, the more pessimistic linear regression was considered for the URLLC network slice, in order to meet its greater reliability requirements.</p></div><div class=\"section_2\" id=\"sec5f2\"><h4>2) Performance Assessment</h4><p>The performance assessment considered five networking scenarios, each of them composed of five static ground users randomly positioned in a <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$X= {\\mathrm {40\\,\\, \\text {m}}}$\n</tex-math></inline-formula>, <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$Y= {\\mathrm {40\\,\\, \\text {m}}}$\n</tex-math></inline-formula> area. The ground users were randomly assigned to the URLLC and eMBB network slices. Each network slice consisted of a minimum of two ground users for each networking scenario. For the sake of reproducibility, the positions and network slice types associated with the ground users considered in the performance evaluation carried out using the experimental testbed are presented in <a ref-type=\"table\" anchor=\"table3\" class=\"fulltext-link\">Table 3</a>. The baseline solution considers a FAP placed in the geometric center of the positions of all the ground users that belong to the same network slice. In addition, it provides each network slice with the same channel bandwidth computed by SurFABle.<div class=\"figure figure-full table\" id=\"table3\"><div class=\"figcaption\"><b class=\"title\">TABLE 3 </b>\nPositions and network slice types associated with the ground users considered in the performance evaluation carried out using ns-3 and the experimental testbed.</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh.t3-3227653-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh.t3-3227653-small.gif\" alt=\"Table 3- &#10;Positions and network slice types associated with the ground users considered in the performance evaluation carried out using ns-3 and the experimental testbed.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p><p>Considering the access network only, the solution obtained with SurFABle consists of a single FAP for each network scenario, while the baseline uses two FAPs (one FAP for each network slice). The experimental results obtained in the networking scenarios that use a total of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {60~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {80~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> channel bandwidth are presented in <a ref-type=\"fig\" anchor=\"fig15\" class=\"fulltext-link\">Fig. 15</a> and <a ref-type=\"fig\" anchor=\"fig16\" class=\"fulltext-link\">Fig. 16</a>, respectively. The performance results obtained in simulation, considering the same exact conditions, are also presented for the SurFABle algorithm. While SurFABle and the baseline allow to meet the traffic demand of the URLLC network slice, with a slight degradation observed in the baseline (cf. 95 <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$^{\\mathrm{ th}}$\n</tex-math></inline-formula> percentile in <a ref-type=\"fig\" anchor=\"fig15\" class=\"fulltext-link\">Fig. 15a</a>, <a ref-type=\"fig\" anchor=\"fig15\" class=\"fulltext-link\">Fig. 15b</a>, <a ref-type=\"fig\" anchor=\"fig16\" class=\"fulltext-link\">Fig. 16a</a> and <a ref-type=\"fig\" anchor=\"fig16\" class=\"fulltext-link\">Fig. 16b</a>), the throughput and PDR are significantly degraded for the eMBB network slice, due to the greater traffic demand associated with this network slice. The baseline offers the same channel bandwidth as SurFABle, as well as twice as many UAVs, but the communications resources are not placed taking into account the QoS requirements of the network slices. Placing a FAP at the geometric center of the ground users that belong to the same network slice allows to provide the same SNR to each of them, but it is insufficient to ensure that the wireless links have high enough capacity to carry the offered traffic in some networking scenarios. On the other hand, the delay achieved with the baseline is lower than the delay measured when using SurFABle (cf. <a ref-type=\"fig\" anchor=\"fig15\" class=\"fulltext-link\">Fig. 15c</a> and <a ref-type=\"fig\" anchor=\"fig16\" class=\"fulltext-link\">Fig. 16c</a>). This is justified by the airtime fairness ensured by the Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA) mechanism of IEEE 802.11. In fact, when employing SurFABle, the ground users that belong to different network slices can be served by the same FAP. However, since the CSMA/CA mechanism assigns the same transmission opportunities to all the ground users that use the same wireless channel, in order to ensure fairness in the medium access, the ground users with a lower SNR value take longer to transmit the same amount of information. Moreover, it is worth mentioning that SurFABle ensures a minimum SNR and channel bandwidth to accommodate the traffic offered by each ground user. On the other hand, placing a FAP at the geometric center of the ground users associated to each network slice may lead to a higher SNR offered to some ground users and induce higher MCS indexes when compared with SurFABle, which ends up in a shorter transmission time enabled by the geometric center approach. However, it must be noted that SurFABle does not violate the QoS requirements associated with each network slice, as it was designed to.\n<div class=\"figure figure-full\" id=\"fig15\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh15-3227653-large.gif\" data-fig-id=\"fig15\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh15-3227653-small.gif\" alt=\"FIGURE 15. - Experimental and simulation average performance results for five networking scenarios composed of 5 subareas randomly associated to URLLC (4 Mbit/s) and eMBB (20 Mbit/s) network slices, considering UDP CBR traffic and 60 MHz channel bandwidth.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 15. </b><fig><p><b>Experimental and simulation</b> average performance results for five networking scenarios composed of <b>5 subareas</b> randomly associated to URLLC (4 Mbit/s) and eMBB (20 Mbit/s) network slices, considering <b>UDP</b> CBR traffic and <b>60 MHz</b> channel bandwidth.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div>\n<div class=\"figure figure-full\" id=\"fig16\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh16-3227653-large.gif\" data-fig-id=\"fig16\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975290/coelh16-3227653-small.gif\" alt=\"FIGURE 16. - Experimental and simulation average performance results for five networking scenarios composed of 5 subareas randomly associated to URLLC (4 Mbit/s) and eMBB (20 Mbit/s) network slices, considering UDP CBR traffic and 80 MHz channel bandwidth.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 16. </b><fig><p><b>Experimental and simulation</b> average performance results for five networking scenarios composed of <b>5 subareas</b> randomly associated to URLLC (4 Mbit/s) and eMBB (20 Mbit/s) network slices, considering <b>UDP</b> CBR traffic and <b>80 MHz</b> channel bandwidth.</p></fig></div><p class=\"links\"><a href=\"/document/9975290/all-figures\" class=\"all\">Show All</a></p></div></p><p>Considering the curves presented in <a ref-type=\"fig\" anchor=\"fig15\" class=\"fulltext-link\">Fig. 15</a> and <a ref-type=\"fig\" anchor=\"fig16\" class=\"fulltext-link\">Fig. 16</a>, the deviation between the ns-3 simulation (represented by the green circle and blue downward-pointing triangle markers) and experimental (represented by the green plus and blue square markers) results is negligible, especially for throughput (cf. <a ref-type=\"fig\" anchor=\"fig15\" class=\"fulltext-link\">Fig. 15a</a> and <a ref-type=\"fig\" anchor=\"fig16\" class=\"fulltext-link\">Fig. 16a</a>) and PDR (cf. <a ref-type=\"fig\" anchor=\"fig15\" class=\"fulltext-link\">Fig. 15b</a> and <a ref-type=\"fig\" anchor=\"fig16\" class=\"fulltext-link\">Fig. 16b</a>). When it comes to the delay metric (cf. <a ref-type=\"fig\" anchor=\"fig15\" class=\"fulltext-link\">Fig. 15c</a> and <a ref-type=\"fig\" anchor=\"fig16\" class=\"fulltext-link\">Fig. 16c</a>), the simulation results for the SurFABle algorithm are more optimistic than the experimental results. This may be justified by slightly differences between the simulation and experimental setup, including hardware particularities and associated computational delays. Moreover, as the <i>ping</i> tool was used, we assume that the delay is half of the RTT measured in practice. If the wireless links are asymmetric, this may explain the deviation observed. However, it is worth noting that the delay results are of the same order of magnitude and show that SurFABle does not violate the maximum average packet delay requirements associated with each network slice. Overall, the reduced deviation between the simulation and the experimental results demonstrates the accuracy of ns-3 for evaluating the performance of wireless networks and validates the performance evaluation carried out for multiple networking scenarios, whose results are presented from <a ref-type=\"fig\" anchor=\"fig6\" class=\"fulltext-link\">Fig. 6</a> to <a ref-type=\"fig\" anchor=\"fig11\" class=\"fulltext-link\">Fig. 11</a>.</p></div></div></div>\n<div class=\"section\" id=\"sec6\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION VI.</div><h2>Discussion</h2></div><p>This article presents SurFABle, an algorithm that allows the computation of the joint placement and allocation of communications resources in slicing-aware flying access and backhaul networks. In the SurFABle design, some theoretical assumptions were made to formulate and solve the problem.</p><p>First, the Free-space Path Loss model was used. This propagation model is commonly considered in the literature to characterize the wireless channel available between UAVs and ground users, due to the strong Line-of-Sight component induced by the UAV altitude <a ref-type=\"bibr\" anchor=\"ref45\" id=\"context_ref_45_6\">[45]</a>. The Free-space Path Loss model takes into account the 3D Euclidean distance between the UAVs and ground users for determining the received power. Moreover, since we assume the use of omnidirectional antennas, which conceptually radiate equal power in all directions, the influence of heterogeneous radiation patterns and the heading of the UAVs are not considered in this article. Yet, SurFABle is agnostic to the radio propagation model used. Different propagation models can be considered, according to the environment where the UAVs are deployed, the wireless communications technology used, and the network configuration employed.</p><p>In order to meet the reliability requirements of different network slices, SurFABle allows to consider different target BER values. This is depicted in <a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">Fig. 4</a>, in which the wireless channel capacity is modeled by different linear regressions. Although we consider target BER values in the system modeling, the performance evaluation presented in this article does not assess the reliability requirements achieved with SurFABle with an accuracy of 10 <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$^{\\mathrm{ -9}}$\n</tex-math></inline-formula>. The evaluation of the BER guarantees enabled by SurFABle is left for future work, since herein we are focused on ensuring throughput and delay guarantees.</p><p>On the one hand, the throughout requirements are ensured by allocating to all subareas an amount of communications resources that provide high enough capacity to accommodate the offered traffic. On the other hand, the delay requirements are met by defining the minimum possible queue size for the network capacity of the wireless channel available, considering the M/D/1 queueing model for simplicity. The M/D/1 queueing model takes into account that the data packets have constant size and independent inter-arrival times. The obtained results show that the M/D/1 queueing model allows meeting the performance requirements for both UDP and TCP traffic. Yet, SurFABle is agnostic to the queuing model used. Different queueing models can be considered, according to the traffic generated by the applications served by the network slices.</p><p>Requirements regarding traffic demand, in bit/s, and delay, in seconds, are considered by SurFABle for each network slice. These are important metrics from the network performance point of view, and they are fulfilled by ensuring minimum SNR values for the wireless links established, while defining suitable positions for the UAVs. It should be noted that the SNR experienced by the UAVs in real-world flying networks may present some difference with respect to the theoretical values considered by SurFABle, namely due to deviations in the location of ground users and interference experienced by the UAVs. This may affect network performance. To overcome the problem, the use of an SNR margin with respect to the theoretical values computed by means of the Free-space Path Loss model may be considered in practice. This aspect is left for future research. Moreover, SurFABle assumes that the wireless channel is symmetric. In networking scenarios with asymmetric wireless links, the lowest network capacity among the two directions should be considered.</p><p>For convenience, the performance evaluation of SurFABle presented herein considers legacy IEEE 802.11 standards (IEEE 802.11n and IEEE 802.11ac). From the spectral point of view, this represents a worst-case evaluation approach, due to the relatively high minimum channel bandwidth block of <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {20~ \\text {M} \\text {Hz} }$\n</tex-math></inline-formula> possible. It is worth mentioning the lower the minimum channel bandwidth block enabled by the technology used the higher the efficiency of SurFABle. This makes SurFABle especially suitable for OFDMA-based technologies, such as 5G NR and IEEE 802.11ax, which allow to assign a given number of channel bandwidth blocks of a few <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {~ \\text {k} \\text {Hz} }$\n</tex-math></inline-formula> to individual users in a more efficient manner. For these reasons, the results presented may be considered as a baseline for comparison with future research works that employ SurFABle in flying networks using more efficient wireless communications technologies.</p><p>Finally, in order to limit the number of admissible solutions when solving the optimization problem formulated in <a ref-type=\"disp-formula\" anchor=\"deqn9a-deqn9i\" href=\"#deqn9a-deqn9i\" class=\"fulltext-link\">(9)</a>, the 3D space where the UAVs can be placed is divided by SurFABle into <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$N$\n</tex-math></inline-formula> equal and small fixed-size subcuboids so that a solution is obtained in a timely manner, according to the network reconfiguration period. In its current version, the size assumed by SurFABle for each subcuboid takes into account that changing the position of a UAV a few meters has negligible impact on network performance in practice. The size of each subcuboid should decrease as the network performance requirements increase, in order to improve the accuracy of the solution obtained, at the expense of a longer time to solve the optimization problem. The subcuboid size is a configuration parameter, and can be changed according to the networking scenario and the requirements of the network slices considered.</p><p>When considering <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {10~ \\text {m}}$\n</tex-math></inline-formula> as the subcuboid size, the average time spent to solve the problem was <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$3.65 \\pm 0.76~\\mathrm {~ \\text {s}}$\n</tex-math></inline-formula> (95% confidence interval) considering five networking scenarios composed of 5 subareas (the least complex networking scenarios considered). For five networking scenarios composed of 40 subareas (the most complex networking scenarios considered), the average time spent by SurFABle increased to <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$54.12 \\pm 11.43~\\mathrm {~ \\text {s}}$\n</tex-math></inline-formula> (95% confidence interval). These results were achieved using an 11 <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$^{\\mathrm{ th}}$\n</tex-math></inline-formula> Generation Intel Ⓡ Core <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$^{\\mathrm{ TM}}$\n</tex-math></inline-formula> i5-1135G7 processor running at <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\mathrm {2.40~ \\text {G} \\text {Hz} }$\n</tex-math></inline-formula> with 16 GB of RAM, which could be deployed at the Edge of the flying access and backhaul network. This makes SurFABle suitable for use in the real-world, where the SLAs established between Service Providers and Mobile Network Operators are not expected to change from minute to minute, as we assumed for defining the flying network reconfiguration period <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\Delta t \\gg {\\mathrm {1~ \\text {s}}}$\n</tex-math></inline-formula>. The fine-tuning of the subcuboid size and <inline-formula id=\"\"><tex-math notation=\"LaTeX\">$\\Delta t$\n</tex-math></inline-formula> is beyond the scope of this article.</p><p>Despite the theoretical assumptions made, ns-3 enabled a realistic performance evaluation, carried out under different networking scenarios. The ns-3 simulator allows to take into account the stochastic characteristics of wireless networks and the behavior of representative traffic generation models by means of a packet-driven simulation approach. In the ns-3 simulations performed, we considered Poisson and CBR as the traffic generation models, taking into account the assumptions made in the system modeling; however, any other representative traffic generation models, which should be selected according to the characteristics of the traffic generated by the communications services and online applications to be served by the network slices, can be integrated into the SurFABle algorithm.</p><p>Regardless of the state of the art counterparts considered, the results obtained in the performance evaluation carried out show that SurFABle allows to meet the QoS levels associated with the network slices, using the minimum number of UAVs. Moreover, the performance evaluation carried out using the experimental testbed allows to confirm the results obtained by means of ns-3 simulations and validated the SurFABle algorithm in the real-world.</p><p>Although minimizing the energy consumption of the UAVs to improve the network lifetime is a relevant research challenge, it is beyond the scope of this article. As future work, we plan to evolve SurFABle to improve the energy efficiency of slicing-aware flying access and backhaul networks, building upon our previous research <a ref-type=\"bibr\" anchor=\"ref60\" id=\"context_ref_60_6\">[60]</a>, <a ref-type=\"bibr\" anchor=\"ref61\" id=\"context_ref_61_6\">[61]</a>.</p></div>\n<div class=\"section\" id=\"sec7\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION VII.</div><h2>Conclusion</h2></div><p>The challenges imposed to Mobile Network Operators have been exacerbated by the use of multiple services with different performance requirements. Even though network slicing has emerged in 5G networks to address the problem, allowing the use of different services on top of a shared network infrastructure, fixed Base Stations are typically considered to satisfy the requirements of network slices. This may not be feasible in scenarios characterized by limited network resources or high dynamics. Flying networks, made up of UAVs acting as mobile Base Stations and Access Points, have emerged as a means to provide on-demand wireless connectivity anywhere, anytime. However, they are typically designed to provide a best-effort communications service. We propose SurFABle, an algorithm that allows the joint computation of the amount of communications resources needed, namely the number of UAVs acting as Flying Access Points and Flying Gateways, and their positions in a flying access and backhaul network. The performance evaluation carried out by means of ns-3 simulations and an experimental testbed shows that SurFABle enables meeting heterogeneous QoS levels of multiple network slices using the minimum number of UAVs. This paves the way for sustainable flying access and backhaul networks.</p><p>As future work, we aim at improving the energy efficiency in slicing-aware flying access and backhaul networks. Instead of considering the UAVs hovering in fixed positions, we will define their trajectories and speed values that minimize the energy spent for the UAV propulsion, while meeting the performance requirements of different network slices. This will be a step forward with respect to the solutions proposed so far.</p></div>\n</div></div></response>\n"
}