{
    "abstract": "In today’s world, it is anticipated that DTw and IoRT will transform the idea of digital healthcare and advancement of it what was previously unknown. DTw is (physical or virtual) machines or computer-based models capable of mimicking or “twinning” the lives of actual entities such as objects, humans, or human-related features. Since the advent of digital and smart healthcare, the world has swiftl...",
    "articleNumber": "9975799",
    "articleTitle": "Toward IoRT Collaborative Digital Twin Technology Enabled Future Surgical Sector: Technical Innovations, Opportunities and Challenges",
    "authors": [
        {
            "preferredName": "Chetana Das",
            "normalizedName": "C. Das",
            "firstName": "Chetana",
            "lastName": "Das",
            "searchablePreferredName": "Chetana Das"
        },
        {
            "preferredName": "Anika Anis Mumu",
            "normalizedName": "A. A. Mumu",
            "firstName": "Anika Anis",
            "lastName": "Mumu",
            "searchablePreferredName": "Anika Anis Mumu"
        },
        {
            "preferredName": "Md. Firoj Ali",
            "normalizedName": "M. F. Ali",
            "firstName": "Md. Firoj",
            "lastName": "Ali",
            "searchablePreferredName": "Md. Firoj Ali"
        },
        {
            "preferredName": "Subrata K. Sarker",
            "normalizedName": "S. K. Sarker",
            "firstName": "Subrata K.",
            "lastName": "Sarker",
            "searchablePreferredName": "Subrata K. Sarker"
        },
        {
            "preferredName": "S. M. Muyeen",
            "normalizedName": "S. M. Muyeen",
            "firstName": "S. M.",
            "lastName": "Muyeen",
            "searchablePreferredName": "S. M. Muyeen"
        },
        {
            "preferredName": "Sajal K. Das",
            "normalizedName": "S. K. Das",
            "firstName": "Sajal K.",
            "lastName": "Das",
            "searchablePreferredName": "Sajal K. Das"
        },
        {
            "preferredName": "Prangon Das",
            "normalizedName": "P. Das",
            "firstName": "Prangon",
            "lastName": "Das",
            "searchablePreferredName": "Prangon Das"
        },
        {
            "preferredName": "Md. Mehedi Hasan",
            "normalizedName": "M. M. Hasan",
            "firstName": "Md. Mehedi",
            "lastName": "Hasan",
            "searchablePreferredName": "Md. Mehedi Hasan"
        },
        {
            "preferredName": "Zinat Tasneem",
            "normalizedName": "Z. Tasneem",
            "firstName": "Zinat",
            "lastName": "Tasneem",
            "searchablePreferredName": "Zinat Tasneem"
        },
        {
            "preferredName": "Md. Manirul Islam",
            "normalizedName": "M. M. Islam",
            "firstName": "Md. Manirul",
            "lastName": "Islam",
            "searchablePreferredName": "Md. Manirul Islam"
        },
        {
            "preferredName": "Md. Robiul Islam",
            "normalizedName": "M. R. Islam",
            "firstName": "Md. Robiul",
            "lastName": "Islam",
            "searchablePreferredName": "Md. Robiul Islam"
        },
        {
            "preferredName": "Faisal R. Badal",
            "normalizedName": "F. R. Badal",
            "firstName": "Faisal R.",
            "lastName": "Badal",
            "searchablePreferredName": "Faisal R. Badal"
        },
        {
            "preferredName": "Md. Hafiz Ahamed",
            "normalizedName": "M. H. Ahamed",
            "firstName": "Md. Hafiz",
            "lastName": "Ahamed",
            "searchablePreferredName": "Md. Hafiz Ahamed"
        },
        {
            "preferredName": "Sarafat Hussain Abhi",
            "normalizedName": "S. H. Abhi",
            "firstName": "Sarafat Hussain",
            "lastName": "Abhi",
            "searchablePreferredName": "Sarafat Hussain Abhi"
        }
    ],
    "doi": "10.1109/ACCESS.2022.3227644",
    "publicationTitle": "IEEE Access",
    "publicationYear": "2022",
    "publicationVolume": null,
    "publicationIssue": null,
    "volume": "10",
    "issue": null,
    "documentLink": "/document/9975799/",
    "xml": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<response><accessType>CCBY - IEEE is not the copyright holder of this material. Please follow the instructions via https://creativecommons.org/licenses/by/4.0/ to obtain full-text articles and stipulations in the API documentation.</accessType><div id=\"BodyWrapper\" class=\"ArticlePage\" xmlns:ieee=\"http://www.ieeexplore.ieee.org\"><div id=\"article\">\n<div class=\"section\" id=\"sec1\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION I.</div><h2>Introduction</h2></div><p>In this time of phenomenal growth in the service sector, health care is an important keystone and is a share of the economy. One of the key areas for technical innovation is the healthcare industry. The majority of the Western world’s aging population puts a significant financial load on healthcare systems. Technologies are considered to have a significant role in preserving the standard of healthcare and population health. Technology has made an impact on every aspect of human life in this immense universe. We only need to swipe our fingers to perform whatever action we choose. With the aid of technology and the internet, life is today safer and more convenient. There will surely be many robots in the near future <a ref-type=\"bibr\" anchor=\"ref1\" id=\"context_ref_1_1\">[1]</a>. This study focuses on the surgical areas of the hospital sector. By enabling the development of new digital models and decision support systems, digital twin technology is one of the new digital technologies that are on the rise and supporting digital transformation.</p><p>In essence, a digital twin is a real-time digital replica of a physical thing or procedure. Digital twins have effectively been revolutionized to change a variety of industries since the Internet of Things (IoT) boom since they are now affordable and efficient <a ref-type=\"bibr\" anchor=\"ref2\" id=\"context_ref_2_1\">[2]</a>. Considering the benefits that IoRT and DTw’s collaboration has brought to surgical fields in the future, this should come as no surprise. This review paper elaborates on how and why we would wish to think about digital twins and IoRT for upcoming surgical sectors. Examples of such technology include self-tracking applications that enable people to lead better lives and health monitoring technologies that enable remote treatment and may reduce the need for hospital visits. The IoRT collaborative digital twin technology (DTwT) is advertised as a technology that will allow individuals to take better care of their health more independently from current healthcare systems and is seen as a significant unique health technology for easing the load of growing healthcare expenditures. By measuring many aspects of a person’s health and lifestyle and treating patients who need it, DTwT promises to continuously update individualized models of people and their physiology. However, DTwTs are essentially identical to previous initiatives to digitize medical procedures <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_1\">[3]</a>.</p><p>Another new revolution in human history is the Internet of Robotic Things (IoRT). In simple terms, IoRT is a belief in which robots and other similar equipment gather crucial information from real life, do essential tasks, and then exchange this vital information through the internet. Robotics were exclusively employed manually in the prior period. However, this idea has altered recently. IoRT has grown in popularity among researchers during the last ten years. Although IoT is the main source of IoRT, however, it is not quite an IoT procedure. Additionally, IoRT offers many more options compared to IoT. The Internet of Things (IoT), artificial intelligence, cloud computing, edge computing, fifth-generation cellular networks (5G), wireless sensor networks, etc., are all advancing quickly and have most importantly in many spheres of life <a ref-type=\"bibr\" anchor=\"ref4\" id=\"context_ref_4_1\">[4]</a>. The integration of the physical and digital worlds is made possible by combining all of these technologies, which is a necessary trend to meet the market’s high demands and contract the complexity. The entire strategic potential of this integration is not, however, fully realized. There is still a long way to go in this integration process, and the most recent advancements concentrate on IoRT-based digital twins. Many businesses now include data, information, and analytical capabilities as part of their service offerings or are in the process of doing so. The digital twin notion has gained popularity recently, much like other digitization ideas like the internet of things (IoT), cloud computing, machine learning/artificial intelligence, and augmented reality. This study assesses the current state of digital twins as a subset of a larger family of digitization initiatives meant to improve current workflows and enable fresh services <a ref-type=\"bibr\" anchor=\"ref4\" id=\"context_ref_4_1\">[4]</a>.</p><div class=\"section_2\" id=\"sec1a\"><h3>A. Motivation and Contribution</h3><p>This paper mainly consists of a five-track for the surgical sector which can be achieved by collaborative work of both IoRT and digital twin technology. From the past few years after corona especially, we have seen that the surgical sector needs an evolution for a better and healthier life for human beings. By combining IoRT and digital twin technology we can construct a new process of treatment in which any human being from anywhere in the world can get better treatment from any county’s specialized surgeon. This new process also helps us to spread better treatment to the whole world. Furthermore, one of the main purposes of our study is to aid the sustainability goals of the ESG by implementing IoRT based Digital Twin Technology in surgical sector. Our paper meet them in great extent and we proposed the notion from a standpoint of environmental sustainability because the world has emerged and increasingly sustainable which able to construct a future free of pollution, cruelty, and threat for all individuals. The contributions are given below: \n<ul style=\"list-style-type:disc\"><li><p>Investigate the problems of conventional surgical sector: In this paper, we presented a study about the conventional surgical sector and noted some difficulties that can be improved by the integration of IoRT collaborative DTwT in the surgical paradigm.</p></li><li><p>Propose a technical framework for future surgical sector: We explored a next-generation model for the surgical system with the integration of a number of available spotlight technologies and proposed a technical framework combined with IoRT and DTwT for saving operation environment.</p></li><li><p>Study the trends of the proposed technical framework in surgical sector: In this paper, we listed the possible trends of the proposed framework in the future surgical sector and briefly explained how the proposed framework empowers the surgical sector to avoid the existing problems.</p></li><li><p>Explore the benefits of the proposed technical framework in the surgical sector: we highlighted some key benefits of the proposed IoRT-driven DTwT framework provided for the surgical domain.</p></li><li><p>Integration challenges and future direction: A list of challenges to integrating the proposed framework in the surgical sector is also discussed in this paper that could be a future scope for doing work in this arena.</p></li></ul></p><p>This paper focuses on the technology in which IoRT collaborated with DTwT. First of all the traditional surgery sector is discussed in the paper. After discussion, we can see there are lots of problems here that need to be solved for a better and healthier human life. A new technology combined with IoRT and DTwT will be able to solve these problems. This technology is broadly explained in the paper with its technical innovations, opportunities, and challenges. In general, we know that DTwT just creates the twin of a human body and IoRT only functions in robotics systems. But in our literature review, we propose a collaborative system with DTwT and IoRT which will be able to generate a safe and secure surgical structure. By using this technology, a great revolution in the medical sector can possibly to bring. Then people from anywhere in the world can receive treatment from any specialized surgeon in the whole world. Most importantly, the problems created by any pandemic for example corona also can be maintained by this technology.</p><p>The rest of the paper is organized as follows. In <a ref-type=\"sec\" anchor=\"sec2\" class=\"fulltext-link\">section 2</a>, a consolidated definition and description of the two fundamental concepts named IoRT and DTwT as well as their technological underpinnings is discussed. <a ref-type=\"sec\" anchor=\"sec3\" class=\"fulltext-link\">Section 3</a> then discusses the strategy and prospects for implementing IoRT-collaborated Digital Twins technology for future surgical applications. In <a ref-type=\"sec\" anchor=\"sec4\" class=\"fulltext-link\">section 4</a>, existing IoRT collaborative Digital Twin technology execution issues and potential directions for future development are examined. Concluding observations are included in <a ref-type=\"sec\" anchor=\"sec5\" class=\"fulltext-link\">Section 5</a>.</p></div></div>\n<div class=\"section\" id=\"sec2\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION II.</div><h2>Surgical Sector: Technical Framework</h2></div><p>Surgery is a branch of medical science in which a surgeon who specializes in a particular sector gives treatment or any kind of advice to the patients. This treatment or advice can be about any kind of physical injury or disease deformities. Treatment can be done by physical repair, removal, or, readjustment of body parts and tissues. It also includes cutting or slitting in the human body. Since the 16th century, surgery is a part of human civilization. But now there are actually a lot of changes in surgery by time evolution. In this part, the current situation of surgery will be discussed:</p><div class=\"section_2\" id=\"sec2a\"><h3>A. Diagnosis Process</h3><p>Diagnosis means the identification or discovery of any kind of illness in the human body. This process can be done by examination or inspection of the syndromes which the patient has. Generally, when any patient goes to a doctor or a specialist then the doctor or specialized gives tests to the patient according to his syndromes. These tests can be blood tests, X-rays, MRI, CT scans, electrocardiograms, etc. After receiving the test result doctor starts his treatment. In this treatment, the doctor also checks the patient’s medical history. A patient can need two types of surgery which is fully dependent on his disease diagnosis. One is emergency surgery and the other is elective surgery. In emergency surgery, the patient needs immediate treatment for his illness. On the other hand, the patient can wait for surgery and take the necessary pills for his recovery in elective surgery. According to the diagnosis process, surgery can be major or minor. Major surgery includes surgery that happens in the head, brain, chest, etc. The minor surgery is basically the elective surgery <a ref-type=\"bibr\" anchor=\"ref5\" id=\"context_ref_5_2a\">[5]</a>.</p></div><div class=\"section_2\" id=\"sec2b\"><h3>B. Traditional Equipment</h3><p>Mainly the diagnosis process fully depends on the examination of the patient’s illness. These examinations can be done by using different types of equipment. Doctors use different types of machines for the diagnosis process according to the patient’s syndromes. Some of them are given in <a ref-type=\"table\" anchor=\"table1\" class=\"fulltext-link\">table 1</a>:<div class=\"figure figure-full table\" id=\"table1\"><div class=\"figcaption\"><b class=\"title\">TABLE 1 </b>\nA list of equipment and their description used in the traditional surgical sector.</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee.t1-3227644-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee.t1-3227644-small.gif\" alt=\"Table 1- &#10;A list of equipment and their description used in the traditional surgical sector.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p></div><div class=\"section_2\" id=\"sec2c\"><h3>C. Existing Health Management</h3><p>There is patient health, nurse management, doctor’s distribution, etc in the health management sector. This existing management system is not that advanced. For this reason, people face so many problems in taking the necessary treatment. Sometimes, they fail to have treatment at the right time which causes a lot of losses to them. Not only this, but people also face problems after the surgery. Because then people need intensive care for them which is sometimes difficult to have in traditional management. Some of these problems with their existing process are given below:</p><div class=\"section_2\" id=\"sec2c1\"><h4>1) Patient’s Supervision</h4><p>In the traditional process, the patient’s health is a big issue. Because it is difficult to provide high-level medical treatment all over the country. Generally, rural people can’t get enough treatment according to their requirements. On the other hand, the machines which are used for patient treatment are not advanced enough. For example: \n<ul style=\"list-style-type:disc\"><li><p>Defibrillators: Defibrillators are the ones that are used to send an electric pulse to the human heart. These are used to operate a normal heartbeat. But sometimes, it is not that effective for the patient when it is too late.</p></li><li><p>Pacemaker: Pacemaker is called the artificial heart. It is generally put into the human body to control or run the heart. But if the pacemaker becomes displaced in the body then it causes death to the patient.</p></li><li><p>Dialysis machine: Dialysis machine is used for kidney diseases. Basically, this machine filters out unnecessary things from the blood and works exactly like a kidney. But it is a very time-consuming process for the patient.</p></li></ul></p></div><div class=\"section_2\" id=\"sec2c2\"><h4>2) Doctor and Staff Administration</h4><p>One of the main barriers in the traditional system is the number of doctors. The number of doctors is not sufficient in the ratio to the number of patients. One doctor needs to give treatment to a large number of people. For this reason, doctors can’t give proper attention to each patient. People need to wait for getting an appointment with the doctor. For this reason, people can’t have proper treatment at the proper time. This problem makes the traditional system weak. So, a new system needs to be created where robots or machines can do doctors’ jobs. Similarly, staff for example nurses, brothers, or sisters are also not enough in the traditional system. Robots can also be used in their places.</p></div><div class=\"section_2\" id=\"sec2c3\"><h4>3) Features of the Current Sector</h4><p>The features of the current sector are not good enough for healthier and better humankind. There are so many negative features that exist in this system. These negative features are needed to be changed which include (i) the ratio of the number of doctors to the number of patients, (ii) the high cost of any surgical treatment, (iii) vague analysis due to conventional machinery, (iv) Unsafe operating environment, (v) lack of physicians and specialists, (vi) telehealth problem, (vii) absence of operational interoperability, (Viii) issue of data security, (ix) poor medical service in the rural area and (x) ancient method of treatment.</p><p>To solve these problems, a new process or system is needed to be invented. This new system should be more advanced by using the new version of robots and machines. The system needs to be more computable and effective. This can be possible by enabling the collaboration of the fields of Internet of Things and Robotics <a ref-type=\"bibr\" anchor=\"ref7\" id=\"context_ref_7_2c3\">[7]</a>. In this technique, robots can automatically discover and correct faults in the current situation <a ref-type=\"bibr\" anchor=\"ref8\" id=\"context_ref_8_2c3\">[8]</a>. By this technique, we can do things from far away <a ref-type=\"bibr\" anchor=\"ref9\" id=\"context_ref_9_2c3\">[9]</a>.</p></div></div></div>\n<div class=\"section\" id=\"sec3\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION III.</div><h2>IoRT Collaborative DTwT: Technical Framework</h2></div><div class=\"section_2\" id=\"sec3a\"><h3>A. Internet Of Robotic Things (IoRT)</h3><div class=\"section_2\" id=\"sec3a1\"><h4>1) Overview Of IoRT</h4><p>The IoRT is an electrifying and dynamic exploration area. We can explain it as a concept where quick-witted devices can praepostor events, combine sensor data from numerous sources, apply intelligence to identify the best course of action and modify items in real life. Robots can be used as these quick-witted devices <a ref-type=\"bibr\" anchor=\"ref13\" id=\"context_ref_13_3a1\">[13]</a>. A robot is a machine that can perform a complex set of activities automatically, especially one that can be programmed by a computer <a ref-type=\"bibr\" anchor=\"ref14\" id=\"context_ref_14_3a1\">[14]</a>. Robotics is a long-standing field with several applications. Recently, this sector has passed its 60th years anniversary. It is slowly established as a result of realizations that these two areas had a lot of overlapping bases, and could greatly benefit from a focus on their combination <a ref-type=\"bibr\" anchor=\"ref15\" id=\"context_ref_15_3a1\">[15]</a>. These two must now be integrated with today’s modern society <a ref-type=\"bibr\" anchor=\"ref7\" id=\"context_ref_7_3a1\">[7]</a>. The IoRT main notion examines the combination of smart abode capabilities with sovereign robots. A smart abode can be elucidated as a smart chamber, smart industry or any kind of smart structure with all the necessary equipment <a ref-type=\"bibr\" anchor=\"ref16\" id=\"context_ref_16_3a1\">[16]</a>. The main function of a smart abode is the monitoring of conditions, technique,s and operation in a defined controlling location. IoRT is not the same as IoT assisted by robotics or IoT-operated robotics <a ref-type=\"bibr\" anchor=\"ref17\" id=\"context_ref_17_3a1\">[17]</a>. But, rather than that, it is an area of research, exploration, and an era in which computing power is applied to the physical environment. So it is far better than traditional robotics. We can see a comparison between IoRT and traditional robotics in <a ref-type=\"table\" anchor=\"table2\" class=\"fulltext-link\">table 2</a>. This versatile technique can be more effective with the help of digital twins for surgical operation <a ref-type=\"bibr\" anchor=\"ref18\" id=\"context_ref_18_3a1\">[18]</a>.<div class=\"figure figure-full table\" id=\"table2\"><div class=\"figcaption\"><b class=\"title\">TABLE 2 </b>\nComparison between IoRT and traditional robotics.</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee.t2-3227644-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee.t2-3227644-small.gif\" alt=\"Table 2- &#10;Comparison between IoRT and traditional robotics.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p></div><div class=\"section_2\" id=\"sec3a2\"><h4>2) IoRT Architect</h4><p>The fundamentals of IoRT can be divided into 4 layers <a ref-type=\"bibr\" anchor=\"ref19\" id=\"context_ref_19_3a2\">[19]</a>. They are (i) real-life components, (ii) examinations and control,(iii) network and communication, and (4) results. <a ref-type=\"fig\" anchor=\"fig1\" class=\"fulltext-link\">Fig. 1</a> shows the relation of the IoRT fundamentals and their role in making a complete IoRT network. The details explanation is as follows;\n<div class=\"figure figure-full\" id=\"fig1\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee1-3227644-large.gif\" data-fig-id=\"fig1\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee1-3227644-small.gif\" alt=\"FIGURE 1. - The architectural structure of IoRT.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 1. </b><fig><p>The architectural structure of IoRT.</p></fig></div><p class=\"links\"><a href=\"/document/9975799/all-figures\" class=\"all\">Show All</a></p></div></p><div class=\"section_2\" id=\"sec3a2a\"><h5>a: Primary Layer</h5><p>This is the first and foremost layer of the IoRT. Basically, this step consists of the real environment. But this real environment should be smart enough to cooperate with IoRT. To make any circumstance a smart abode we need smart machines that can communicate with the network. These machines can be any kind of robot, sensor, etc. For example thermocouples, RTDs, wind speed sensors, light-dependent resistors (ldr), photodiode photo-transistor, solar cells,s etc. Any kind of ordinary device or actuator which can perform operations can also be used in a smart abode. Mainly we need to choose according to operations that need to perform <a ref-type=\"bibr\" anchor=\"ref20\" id=\"context_ref_20_3a2a\">[20]</a>.</p></div><div class=\"section_2\" id=\"sec3a2b\"><h5>b: Secondary Layer</h5><p>The secondary layer of IoRT is examination and control. After creating the smart environment, which includes the required sensors and machines the selected operation can be done. When the operation is done then the robots or sensors examine the operation and control it according to the inputs which are given to it. After this process, the robots and sensors take data. So, this data can be used for further applications <a ref-type=\"bibr\" anchor=\"ref21\" id=\"context_ref_21_3a2b\">[21]</a>.</p></div><div class=\"section_2\" id=\"sec3a2c\"><h5>c: Network and Communication Layer</h5><p>Network and communication are the third part of IoRT. Assorted types of network connectivity options are provided here. Network connectivity options can be wired or wireless. These types of network elements can be divided into two parts. (1) Short-range communication technologies and (2) Medium-long-range communication technologies. Short-range communication technologies can be used for short areas. Here WiFi, Bluetooth Low Energy (BLE), 6LoWPAN, Broad Band Global Area Network (BGAN), etc. are examples of short-range communication technologies. Medium-long range communication technologies are used for medium or long areas. Using these technologies, the necessary data can provide over a long distance. Worldwide Interoperability for Microwave Access (WiMAX), Z-Wave, ZigBee <a ref-type=\"bibr\" anchor=\"ref20\" id=\"context_ref_20_3a2c\">[20]</a>, and Low Power Wide Area Networks (LoRA), etc. are a few examples of Medium-long range communication technologies. Besides these robotics systems prefer robot-specific service technologies such as RT (Robot Technology) middleware, Robot Operating System (ROS), Robot Service Network Protocol (RSNP), Open Robot/Resource interface for the Network (ORiN), CANOpen and open source ubiquitous network robot platform <a ref-type=\"bibr\" anchor=\"ref22\" id=\"context_ref_22_3a2c\">[22]</a>.</p></div><div class=\"section_2\" id=\"sec3a2d\"><h5>d: Output Layer</h5><p>Last but not least layer is the result. This step can also be addressed as the application layer. The prosecution and imposition of operation which is achieved and performed by integrated robots and sensors in the astute condition is the final result of IoRT. A summary of the details elements and layers of IoRT and their description is reported in <a ref-type=\"table\" anchor=\"table3\" class=\"fulltext-link\">table 3</a>.<div class=\"figure figure-full table\" id=\"table3\"><div class=\"figcaption\"><b class=\"title\">TABLE 3 </b>\nA summary about the details elements and layer of IoRT architecture.</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee.t3-3227644-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee.t3-3227644-small.gif\" alt=\"Table 3- &#10;A summary about the details elements and layer of IoRT architecture.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p></div></div><div class=\"section_2\" id=\"sec3a3\"><h4>3) Exceptional And Consequential View Of IoRT</h4><p>IoRT is far better than traditional robotics services. This can be explained by a comparative discussion between IoRT and traditional robotics which is given below: \n<ul style=\"list-style-type:disc\"><li><p>IoRT is more self-adaptive than traditional robotics <a ref-type=\"bibr\" anchor=\"ref23\" id=\"context_ref_23_3a3\">[23]</a>. In IoRT, the operation can be done without any human interaction but it is not possible in traditional robotics. A single robotic system is not enough to perform the whole process. So it needs to depend on other devices <a ref-type=\"bibr\" anchor=\"ref21\" id=\"context_ref_21_3a3\">[21]</a>.</p></li><li><p>IoRT has virtualized diversification. IoRT also supports could computing. Could robotics be added to this technique <a ref-type=\"bibr\" anchor=\"ref24\" id=\"context_ref_24_3a3\">[24]</a> ? Hence data can be stored for future applications <a ref-type=\"bibr\" anchor=\"ref25\" id=\"context_ref_25_3a3\">[25]</a>. Distance is not an issue for this. If the users want then they can see and control the operation from wherever he wants. It is impossible in traditional robotics systems <a ref-type=\"bibr\" anchor=\"ref26\" id=\"context_ref_26_3a3\">[26]</a>.</p></li><li><p>IoRT can addendum the traditional robotics service by adding new types of androids <a ref-type=\"bibr\" anchor=\"ref27\" id=\"context_ref_27_3a3\">[27]</a>. For example drones, butler-robot, etc. It can underpin and validates heterogeneous robotics. So, for this reason, each and every individual robot can have utterly different hardware architecture and software <a ref-type=\"bibr\" anchor=\"ref28\" id=\"context_ref_28_3a3\">[28]</a>.</p></li><li><p>IoRT mainly has composability of traditional robotics and network. For this reason, IoRT is capable of doing all the things which traditional robots can do <a ref-type=\"bibr\" anchor=\"ref29\" id=\"context_ref_29_3a3\">[29]</a> Moreover IoRT joins the internet to new forms of robots <a ref-type=\"bibr\" anchor=\"ref30\" id=\"context_ref_30_3a3\">[30]</a>. So the operation can be done more accurately. IoRT has more proficiency and efficiency than traditional robotics <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_3a3\">[31]</a>.</p></li></ul></p></div></div><div class=\"section_2\" id=\"sec3b\"><h3>B. Digital Twin Technology (DTwT)</h3><div class=\"section_2\" id=\"sec3b1\"><h4>1) Formation &amp; Evolution of DTwT</h4><p>The Digital twin generation is a very promising notion in this new virtual generation and the upward thrust of present technical problems, and it plays a pronounced role in the construction of a smart society <a ref-type=\"bibr\" anchor=\"ref32\" id=\"context_ref_32_3b1\">[32]</a>. The digital twin has a lot of potentials and is thought to have a lot of advantages. Though there is a record of the use of digital twins roughly twenty years ago via NASA during an APOLLO 13 rescue mission, it continues to conform and develop, and it is now used in a variety of sectors <a ref-type=\"bibr\" anchor=\"ref33\" id=\"context_ref_33_3b1\">[33]</a>. We will discover several condensed definitions of the digital twin. However, a few of them describe it to us in the way that it should be. As one definition goes digital twin can be defined as “Digital twins are (physical and/or virtual) machines or computer-based absolute models capable of mimicking, imitating, mirroring, or “twinning” the lives of actual entities such as objects, processes, humans, or human-related features.” It can also be defined as “The digital twin systems may merge physical and virtual statistics, resulting in a massive amount of data that can be controlled simultaneously by world-class analysis. This kind of analysis can also be used in smart manufacturing when combined with digital twin technology <a ref-type=\"bibr\" anchor=\"ref34\" id=\"context_ref_34_3b1\">[34]</a>. In <a ref-type=\"fig\" anchor=\"fig2\" class=\"fulltext-link\">figure 2</a>, we outline the main features and elements of a digital twin technology. As an input, we use sensors, virtual reality, health monitoring, and safety &amp; privacy. The technology we use is nanotechnology, artificial intelligence, network &amp; communication, and cloud computing. When we send data gathered from the physical body via different kinds of technology, we get a virtual body exactly like the physical body. This process is called the digital twin <a ref-type=\"bibr\" anchor=\"ref35\" id=\"context_ref_35_3b1\">[35]</a>.\n<div class=\"figure figure-full\" id=\"fig2\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee2-3227644-large.gif\" data-fig-id=\"fig2\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee2-3227644-small.gif\" alt=\"FIGURE 2. - Features and elements of a digital twin technology.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 2. </b><fig><p>Features and elements of a digital twin technology.</p></fig></div><p class=\"links\"><a href=\"/document/9975799/all-figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec3b2\"><h4>2) Notion And Essential Quality Of DTwT</h4><p>A digital twin technology can be said as a super-intelligent and evolving model which is parallel to virtually a physical process <a ref-type=\"bibr\" anchor=\"ref36\" id=\"context_ref_36_3b2\">[36]</a>. It evolves a lifecycle that includes monitor, controlling, and optimizing its processes and functions. It also determines future defects, damages, and failures and simulates different configurations to apply its maintenance operations <a ref-type=\"bibr\" anchor=\"ref37\" id=\"context_ref_37_3b2\">[37]</a>. So, the main concept of a digital twin is (i) virtual representation of a physical system; (ii) updated and exchanged data; (iii) modeling simulation and prediction, and (iv) last but not least real-time data interaction <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_3b2\">[38]</a>. It has a high-accuracy model which can use to simulate and predict real-time data. It simulates, monitor, diagnose, predict and control the process in a real environment <a ref-type=\"bibr\" anchor=\"ref39\" id=\"context_ref_39_3b2\">[39]</a>. Some characteristics of DTwT are \n<ul style=\"list-style-type:disc\"><li><p><i>Accumulation:</i> The life cycle of a physical system includes the storage of all data on a digital mainline for centralized and unified administration, increasing the effectiveness of two-way data flow <a ref-type=\"bibr\" anchor=\"ref40\" id=\"context_ref_40_3b2\">[40]</a>.</p></li><li><p><i>Reliability:</i> Real-time data monitoring may further enrich and improve the model, allowing it to encompass all of the system’s information. DT integration of all subsystems is the foundation for high-precision modeling for complex systems.</p></li><li><p><i>Dynamic:</i> Updated models may dynamically direct actual operation, and real-time interaction between physical systems and digital models allows models to develop and change throughout their life cycle. Sensor data characterizing the physical system environment or status can be utilized for dynamic model updates <a ref-type=\"bibr\" anchor=\"ref41\" id=\"context_ref_41_3b2\">[41]</a>.</p></li></ul></p><p>To these characteristics, digital twin technology executes the process with starting requirements, implementations, and test and run through it over and over again. It can direct all kinds of information in a merging way and all can acquire and on information from it at any time, working parallelly <a ref-type=\"bibr\" anchor=\"ref42\" id=\"context_ref_42_3b2\">[42]</a>. Through virtual simulation, digital twin Technology allows virtual tests before physical manufacture. When typical modeling predicts the outputs depending on the future based on archival data and guides the production, errors will inevitably occur. Simulating it in the real world during the designing process is quite tough. For this reason, to save the whole time and labor digital twin technology uses real-time data to update the model, so that the model may anticipate not only the state of the device but also the developing system in a given environment <a ref-type=\"bibr\" anchor=\"ref43\" id=\"context_ref_43_3b2\">[43]</a>.</p></div><div class=\"section_2\" id=\"sec3b3\"><h4>3) Aspects And Significance Of DTwT</h4><p>Six aspects are particularly significant to the formation of the digital twin, which include (i) project, (ii) construction, (iii) sensor, (iv) As-built data, (v) data insights, and (vi) artificial intelligence. Due to the intricate design of today’s systems, creating virtual prototype models may be a difficult effort. Because the system’s accessibility is so important in many manufacturing facilities, it’s necessary to provide a nonexclusive showing approach. Digital twins are a concept that originated in industrial design that uses data from specific products to create virtual duplicates for safety reasons and trials on various options <a ref-type=\"bibr\" anchor=\"ref44\" id=\"context_ref_44_3b3\">[44]</a>.In the context of health care, a digital twin can be a virtual three-dimensional model that exhibits the aspects of a patient’s body part or a virtual replica of a patient that portrays the patient’s specific genetic composition. These digital twins should enable scientists and researchers to provide personalized medical treatment to individual patients <a ref-type=\"bibr\" anchor=\"ref45\" id=\"context_ref_45_3b3\">[45]</a>.</p></div></div><div class=\"section_2\" id=\"sec3c\"><h3>C. Conceptual Framework For Surgical Sector With Merging the DTwT and IoRT</h3><div class=\"section_2\" id=\"sec3c1\"><h4>1) Synopsis and Implementation</h4><p>The digital twin is described as a data-driven, interactive automated version for custom-designed health care providers that tries to offer physical-associated data that appropriately replicate or forecast the health issues of a particular person <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_3c1\">[46]</a>. IoRT is a technique that is consolidated with shrewd ambiance and network. By collaborating with these two, an automated, pre-programmed, and computerized technique can be made which will have high efficiency, accuracy, dexterity, and adroitness. Here the majority of clinical assets will be available for treatment, and the trouble of inadequate clinical assets will hold to get worse as the populace grows. Illness frequency might be minimized and clinical strain might be lessened through disorder prevention, fitness management, and disorder recovery <a ref-type=\"bibr\" anchor=\"ref47\" id=\"context_ref_47_3c1\">[47]</a>. However, there may be an extreme loss of clinical centers and specialists in those fields, making them tough to get admission into society. DTwT combined with IoRT will give a realistic method to reveal people’s bodily situations in actual time, in addition to sturdy help for cloud fitness care offerings. Personalized fitness care offerings hooked up below the perception of virtual twins gift a slew of moral issues because of the confluence of fitness care, synthetic intelligence, and data and communique technology. The attached <a ref-type=\"fig\" anchor=\"fig3\" class=\"fulltext-link\">figure 3</a> will show the whole framework of IoRT collaborated DTwT in future surgical sectors and described briefly the respective equipment and their functions <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_3c1\">[48]</a>.\n<div class=\"figure figure-full\" id=\"fig3\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee3-3227644-large.gif\" data-fig-id=\"fig3\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee3-3227644-small.gif\" alt=\"FIGURE 3. - IoRT collaborated DTwT framework for the future surgical sector.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 3. </b><fig><p>IoRT collaborated DTwT framework for the future surgical sector.</p></fig></div><p class=\"links\"><a href=\"/document/9975799/all-figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec3c2\"><h4>2) Potentials and Strategies</h4><p>Hospitals can also be considered a little “factory” with a range of services that must strike a relationship between medical assets and patients. However, hospitals are presently dealing with shifting medical requirements. This necessitates hospitals not only continuously adding new services in response to demand but also making existing services more efficient <a ref-type=\"bibr\" anchor=\"ref49\" id=\"context_ref_49_3c2\">[49]</a>. For example, we can say, PHLF (Post-hepatectomy liver failure) is the main cause of postoperative death in liver patients, and digital twin simulation surgery adjusts treatment choices to know the dangers and prevent them. Researchers in cardiac medicine has created a digital twin system that identifies Carotid artery compression via head vibrations <a ref-type=\"bibr\" anchor=\"ref50\" id=\"context_ref_50_3c2\">[50]</a>. To assess the patient’s treatment status and recovery, a flexible system has been created that represents the patient’s condition and it may display the patient’s symptoms anywhere at a time. To evaluate interlink in mission-critical applications, this system simulates the DTwT to control verified remote surgical activity. The future utilization of digital twin technology in surgical medicine is derived. The refining of navigation-assisted IoRT approaches has resulted from technological advancements. Regardless of the length of the surgical operation, IoRT can reduce fatigue and permit improved precision of fine movement. In four steps, this two can be combined for a new concept. Surgical maps of the human body are designed by a computer which is mainly generated by doctors. Optimal mechanical alignment, implant dimensions, and placement are required to achieve this. Before beginning the procedure, the surgeon can review and change the surgical plan and perform a mental walkthrough of the procedure. These classifications are based on the amount of help supplied. They are:\n<ul style=\"list-style-type:disc\"><li><p>Tele-surgical systems with remote instructional stations, for example. In this step, the physician oversees all of the machine’s movements and functions.</p></li><li><p>The “shared-control” concept, in which the surgeon and the robot are jointly in charge of the motions.</p></li><li><p>The advanced controlled systems conduct the main surgery with the surgeon and trained robotics instrument.</p></li><li><p>Using digital twins, the changes which are made in the surgery will directly affect the real anatomy <a ref-type=\"bibr\" anchor=\"ref51\" id=\"context_ref_51_3c2\">[51]</a>.</p></li></ul></p><p>Digital twin in health (DTH) is a complicated medical simulation method that mixes the era with multidisciplinary, multi-tasking and multi-dimensional fashions to offer reliable, precise, and useful medical services <a ref-type=\"bibr\" anchor=\"ref52\" id=\"context_ref_52_3c2\">[52]</a>. On the other hand, IoRT can amalgamate medical equipment and the real human body. IoRT can be used to store genetic information which will help their generations. This might help to research human bodies for example any scientist’s brain which can be a great revelation for human civilization. DTH can be used for clinic control and layout in addition to affected person care <a ref-type=\"bibr\" anchor=\"ref53\" id=\"context_ref_53_3c2\">[53]</a>. Different techniques, which include organizing beds and a team of workers’ schedules, can be assessed in digital surroundings with the use of DTH earlier than scheduling and executing real changes. Without DTH, a clinical team of workers can conveniently handle and plan their movement primarily based on their discipline, understanding, and primitive analysis; however, the use of a virtual pair minimizes the danger and cuts costs <a ref-type=\"bibr\" anchor=\"ref54\" id=\"context_ref_54_3c2\">[54]</a>.</p></div><div class=\"section_2\" id=\"sec3c3\"><h4>3) Significance And Dominance Of DTwT</h4><p>The importance of digital twin technology and IoRT in the medical field is the major focus. Modern medical facilities include not only patient treatment but also healing of patients and their physical condition, illness prevention, and health recovery, hospital management of communicable viruses, and facility availability based on the patients’ needs, among other things. It also includes psychological treatment in addition to physical treatment. People’s need for medical services is shifting as the internet becomes more widely used. And our country’s present medical infrastructure, particularly in rural regions, is completely inadequate <a ref-type=\"bibr\" anchor=\"ref55\" id=\"context_ref_55_3c3\">[55]</a>. Precision medicine, medication development, and management are also included. During the COVID pandemic, those who couldn’t get out but had to stay at home began to notice that there were no medical facilities and that there were no effects. As a result, it is past time to begin implementing effective methods for treating patients who live far away. New unprecedented robotic surgical methodologies and implementations are found in day-to-day life. The cost of care is a key concern. In previous research, serious problems were noted. Excessive blood loss and dislocation are also big concerns. Again we all know that the number of doctors who are needed for a stable life is very less in reality.</p><p>Further, the rural people are kept away from the least medical facilities. The lasting solution to this difficult challenge will be digital twin technology combined with IoRT. IoRT assists us in resolving these issues and lowering them to a manageable level <a ref-type=\"bibr\" anchor=\"ref12\" id=\"context_ref_12_3c3\">[12]</a>.By using IoRT combined with digital twin technology, a perfectly trained doctor can see a patient’s visual representation and give treatment to rural people or people who live far away from him. For this, any person can connect to any specialized doctor in this whole world. This method also has a safe environment which includes a safe operation abode, and high accuracy in achieving the aim result. Thus the medical sector can be extended worldwide <a ref-type=\"bibr\" anchor=\"ref56\" id=\"context_ref_56_3c3\">[56]</a>. We’ve spoken about digital twin technology and some of the biggest issues it faces that might affect this industry, as well as some potential future developments. It also looks at how digital twin technology may be used in healthcare. It primarily focuses on healthcare applications, personal health management, and precision medicine, and it develops and integrates a digital twin-enabled Internet of Robotics Things (IoRT) system for telemedicine simulation with mixed reality (MR) and cloud computing <a ref-type=\"bibr\" anchor=\"ref57\" id=\"context_ref_57_3c3\">[57]</a>.</p></div></div></div>\n<div class=\"section\" id=\"sec4\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION IV.</div><h2>IoRT Collaborated DTwT Driven Future Surgical Sector</h2></div><div class=\"section_2\" id=\"sec4a\"><h3>A. Future of Surgical Sector</h3><p>This is the edge we are using technology in every aspect of human life. The surgical sector is no different in terms of modern technology. Day by day they are adopting new technologies which are replacing the traditional ones. Several concepts are not in use till now but have a brilliant possibility regarding modern surgical methods which include digital twin (DTw) and Internet of Robotic Things (IoRT) <a ref-type=\"bibr\" anchor=\"ref58\" id=\"context_ref_58_4a\">[58]</a>. Digital twin serves in the healthcare sector, like the digital equivalent of the practical treatment and services which enables remote monitoring and assessment of the surgical sector. The digital twin can offer a safe setup for evaluating how improvements will affect a patient’s well-being. Any kind of problems can be anticipated before they arise and given time to make the required adjustments or follow the proper procedures. This is done by using reality or real-time data collected by digital twins and then using system dynamics through a machine, process, or live organism to solve it. This will make it possible to reduce risks and find the best possible solutions, which is sometimes very crucial in the surgical sector <a ref-type=\"bibr\" anchor=\"ref59\" id=\"context_ref_59_4a\">[59]</a>, <a ref-type=\"bibr\" anchor=\"ref60\" id=\"context_ref_60_4a\">[60]</a>. Using digital twins and IoRT, the primary healthcare processes can change drastically. Using digital tracking to twin the human body and connected it through the internet creates new and modern healthcare applications that improve medical treatment wondrously.</p><div class=\"section_2\" id=\"sec4a1\"><h4>1) Diagnosis Process</h4><p>In the health sector diagnosis is the top factor as the life of a critical patient depends on the right diagnosis and treatment by the physician. A small mistake or misdiagnosis can risk everything and cause irreplaceable damage. Proper diagnosis helps to predict what patients need either medicine or surgical aid. But as we say earlier in today’s era of modern technologies just imagine being able to estimate how experimental procedures would affect a patient without putting their life in danger or creating a computerized model of a person’s physique that decide which surgical procedure would be most effective <a ref-type=\"bibr\" anchor=\"ref61\" id=\"context_ref_61_4a1\">[61]</a>. Welcome to a new era of “Digital Twin (DTw) and Internet of Robotic Things (IoRT)” which enables precision treatment and preventative care. Physicians can make more accurate clinical diagnoses for patients with chronic conditions to receive individualized treatment options that lengthen and secure their lives. This also makes it possible to detect any inefficiencies and concerns immediately, saving time and lives. Hospital design and patient care are two areas where digital twins and IoRT are constantly playing a significant role. A Digital Twin of any human body feature may receive data from sensors efficiently and effectively and the process can be done by IoRT procedures <a ref-type=\"bibr\" anchor=\"ref55\" id=\"context_ref_55_4a1\">[55]</a>. Beginning with the mapping of a real environment using photos and meticulous note-taking, a digital twin is created. The digital twin is then updated with real-time data. The twin always has the most recent information since the two are constantly synced. The data is processed by computer vision, artificial intelligence, and nanotechnology, enabling users to model potential scenarios and the best possible solution is given by IoRT <a ref-type=\"bibr\" anchor=\"ref62\" id=\"context_ref_62_4a1\">[62]</a>.</p></div><div class=\"section_2\" id=\"sec4a2\"><h4>2) Inclusion of Advanced Equipment and Smart Procedure</h4><p>Humans can’t acquire and communicate data as precisely and reliably as smart technologies and devices can including digital modeling, medical equipment, and improved human body data. for a successful operation to be done at hospitals, a healthcare institution has to develop a variety of technologies and procedures to become digital twin-ready <a ref-type=\"bibr\" anchor=\"ref63\" id=\"context_ref_63_4a2\">[63]</a>. Surgeons use technologies called surgical assistance tools to facilitate and expedite surgical operations. Similar to AR headsets, pre-operative pictures from CT, MRI, and 3D scans are seen with important real-time patient data including heart rate, body temperature, blood pressure, and breathing rate. Robotic equipment like the Da Vinci surgical system is the most popular robot today because of recent advancements in surgical applications. In addition to it, robotic arms, the cyberknife, and the Cenex germ-zapping robot are also used for surgery <a ref-type=\"bibr\" anchor=\"ref64\" id=\"context_ref_64_4a2\">[64]</a>. This is are newer techniques that are developed by digital twin and IoRT. some basic workflows done by digital twin and IoRT are given below: Remote surgery, telepresence, augmented reality surgery, <a ref-type=\"bibr\" anchor=\"ref65\" id=\"context_ref_65_4a2\">[65]</a> 3D human anatomy models for better diagnosis, visualization diagnosis, and planning, Virtual patients, Surgery simulation, Treatment planning, Preventive medicine, and patient care, Medical therapy, Pain control, Visualization of massive medical databases, Architectural design for healthcare facilities <a ref-type=\"bibr\" anchor=\"ref66\" id=\"context_ref_66_4a2\">[66]</a>. Some critical surgeries are done by it which is quite impossible manually such as Total hip, Shoulder, Foot, and ankle arthroplasty, Uncompartmentalized knee arthroplasty, Total knee arthroplasty, prostatectomies, cardiac valve repair <a ref-type=\"bibr\" anchor=\"ref67\" id=\"context_ref_67_4a2\">[67]</a> Coronary artery bypass, Cutting away cancer tissue from sensitive parts of the body such as blood vessels, nerves, or important body organs, Gallbladder removal, etc <a ref-type=\"bibr\" anchor=\"ref68\" id=\"context_ref_68_4a2\">[68]</a>.</p></div><div class=\"section_2\" id=\"sec4a3\"><h4>3) Revolutionary Healthcare</h4><div class=\"section_2\" id=\"sec4a3a\"><h5>a: Patient Supervision</h5><p>The monitoring and assessment of a patient’s health are simplified with the evolution of the digital twin and IoRT concept which is later resulting in successful outcomes. The digital twin and IoRT can be used for proactive remote monitoring of medical equipment and predictive maintenance of devices/equipment to detect prospective faults or technical difficulties before they arise in addition to real-time patient monitoring. This can save money, time, and effort while also preventing interruptions in the continuity of treatment <a ref-type=\"bibr\" anchor=\"ref69\" id=\"context_ref_69_4a3a\">[69]</a>. It may be further investigated to improve patient health plans and postoperative surgical results. The potential to evaluate real-time data and make an accurate decisions will soon make the digital twin and IoRT a valuable asset for doctors. The whole quality of life will be improved by the integration of IoRT with a digital twin, which will further simplify process modeling, health predictions, and precise disease diagnostics. Real-time monitoring, an efficient treatment plan, and patient preventative care are difficult operations for physicians <a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_4a3a\">[70]</a>. Three important steps are mentioned here such as (i) predictive outcome; (ii0 surgical planning and (ii) personalized medicine.</p><p>Reactive care is being replaced with preventative care in patient care. To construct a person’s individualized digital twin, data on their genetic, biochemical, physiological, and behavioral characteristics are collected. By forecasting patient-specific results and planning equipment maintenance, digital twins can help hospital personnel manage patient flow and inventory more efficiently. Surgery planning is essential because patients in critical condition are at very high risk without it. One of the expanding medical perspectives is personalized medicine. This tries to address the issue by offering interventions for the prevention and treatment of diseases or conditions. Thus, using digital twins to achieve customized treatment is a natural, complementary technique. Without having to wait for an extended duration for testing or diagnostic findings, the usage of an individual patient’s digital twin can help customize treatment plans for that person <a ref-type=\"bibr\" anchor=\"ref71\" id=\"context_ref_71_4a3a\">[71]</a>.</p></div><div class=\"section_2\" id=\"sec4a3b\"><h5>b: Doctors and Stuff Administration</h5><p>The doctors are better able to prepare the surgical treatment and recognize the risks involved with the advancement of the virtual patient. In rare circumstances, modeling might lessen or even eliminate the need for surgery. Domain knowledge and extensive teamwork are essential for planning IoRT healthcare applications. Nurses must help with patient advocacy, sector expressive language, point of care knowledge, and technical knowledge. In acute care and long-term settings, nurses are involved in the patient’s daily care. They are also the professionals who give home care the most frequently. Technicians are needed with nurses to help with technological knowledge, practical application, and understanding of IoRT for the benefit of patients.</p></div><div class=\"section_2\" id=\"sec4a3c\"><h5>c: Health Center Management</h5><p>Digital twin helps to decide what steps to take, operational strategies, capacity, staffing, and others of the hospital. Digital twin makes a virtual model which detects the shortage of beds, the spread of viruses, employee schedules, operating rooms, etc. These will support the improvement of performance, cost, patient care, and safety of any health institution. With the use of digital twins, the hospital may be virtually recreated to establish a risk-free setting of IoRT procedures for evaluating the effect of improvements on the system this performance <a ref-type=\"bibr\" anchor=\"ref72\" id=\"context_ref_72_4a3c\">[72]</a>. This is crucial in the surgical sector because it makes it possible for sensible strategic decisions for IoRT performances to be made in a very complicated and delicate situation. Some hospitals have started using “smart beds” that can tell when a patient is trying to get up and when they are occupied, relaying this information to nurses via the network or the internet. The attached <a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">figure 4</a> have the summarized opinion in healthcare of the future surgical sector as we all know that surgery patients need special care and a safe environment\n<div class=\"figure figure-full\" id=\"fig4\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee4-3227644-large.gif\" data-fig-id=\"fig4\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee4-3227644-small.gif\" alt=\"FIGURE 4. - A summarized comment about the IoRT assisted DTwT-driven future surgical sector.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 4. </b><fig><p>A summarized comment about the IoRT assisted DTwT-driven future surgical sector.</p></fig></div><p class=\"links\"><a href=\"/document/9975799/all-figures\" class=\"all\">Show All</a></p></div></p></div></div></div><div class=\"section_2\" id=\"sec4b\"><h3>B. Trends Of IoRT Collaborative DTwT Framework In Future Surgical Sector</h3><p>The need for higher-quality basic healthcare and communication technology in the field of medicine both rise as the population does. The idea of IoRT collaborative DTwT in future surgical sectors offers a number of solutions to the pressing issues that face contemporary healthcare. The taxonomy we pronounced here elaborates the prospects of IoRT collaborated DTwT for future surgical sectors methodically and extensively.</p><div class=\"section_2\" id=\"sec4b1\"><h4>1) Smart Doctor Assistance</h4><p>This is the initial stage. Here, the environment for the technique is built shown in <a ref-type=\"fig\" anchor=\"fig5\" class=\"fulltext-link\">fig 5</a>. This stage can be divided into three parts and these are,\n<div class=\"figure figure-full\" id=\"fig5\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee5-3227644-large.gif\" data-fig-id=\"fig5\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee5-3227644-small.gif\" alt=\"FIGURE 5. - Smart doctor assistance to diagnosis and treatment.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 5. </b><fig><p>Smart doctor assistance to diagnosis and treatment.</p></fig></div><p class=\"links\"><a href=\"/document/9975799/all-figures\" class=\"all\">Show All</a></p></div></p><div class=\"section_2\" id=\"sec4b1a\"><h5>a: Patient Interaction and Inspection</h5><p>First of all, patient and doctor interaction will happen. Using the digital twin technology, a virtual representation of the patient’s anatomy will be created. This virtual representation can be called a smart mapping of the patient’s genetics which will carry the exact twin of the patient. When a human becomes sick or ill, he will definitely have some syndromes in his inner body parts. For example, when cancer happens to the human body, it changes the patient’s DNA <a ref-type=\"bibr\" anchor=\"ref73\" id=\"context_ref_73_4b1a\">[73]</a>. Another example is when any patient has a heart problem then he will have an asynchronous heartbeat in the ECG test. According to this, the surgeon can say what problem is happening to the patient. Similarly, the virtual representation which will be created by digital twin technology also will have the same genetic problem according to the patient’s body. Then this virtual representation can be sent to wherever the doctor will stay. A third-world country like ours or a low-income county that does not have a strong surgical sector can communicate to the world’s best doctor by using this technique <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_4b1a\">[74]</a>.</p></div><div class=\"section_2\" id=\"sec4b1b\"><h5>b: Decision Making</h5><p>After having the digital twin of the patient, this will be given into the IoRT as its input <a ref-type=\"bibr\" anchor=\"ref75\" id=\"context_ref_75_4b1b\">[75]</a>. Then this input can be provided to the specialized doctor. Afterward, the doctor will start his assumption about the patient’s disease. The doctor can see a visual representation of the patient’s affliction because the twin created by the technique has the same kind of error in it. The doctor can also use any kind of robot for his work. Sometimes according to the requirements, a doctor’s twin can also be created using digital twin technology. This twin will be created to perform the doctor’s role. Every compulsory and mandatory knowledge, information, or data that is important for the diagnosis of the patient’s diseases will be provided to this twin <a ref-type=\"bibr\" anchor=\"ref76\" id=\"context_ref_76_4b1b\">[76]</a>.</p></div><div class=\"section_2\" id=\"sec4b1c\"><h5>c: Diagnosis</h5><p>According to the patient’s twin, the doctor will give the diagnosis. On the other hand, if the doctor’s twin is using then this twin accordance with its previous information will identify the errors in the patient’s twin. Then pursuant to this, the doctor’s twin will take the necessary steps for the patient’s twin. Using the IoRT, these steps will be supplied to the destination <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_4b1c\">[77]</a>.</p></div></div><div class=\"section_2\" id=\"sec4b2\"><h4>2) Advanced Equipment</h4><p>The modern and trailblazing equipment is used here for better and perfect surgery. So, the operation can have high quality, high efficacy, and safe surrounding. For this, many kinds of robots, sensors sometimes actuators are used as advanced equipment. Some of these are explained below in <a ref-type=\"fig\" anchor=\"fig6\" class=\"fulltext-link\">fig 6</a>:\n<div class=\"figure figure-full\" id=\"fig6\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee6-3227644-large.gif\" data-fig-id=\"fig6\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee6-3227644-small.gif\" alt=\"FIGURE 6. - Combination of advanced equipment in proposed surgical procedure.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 6. </b><fig><p>Combination of advanced equipment in proposed surgical procedure.</p></fig></div><p class=\"links\"><a href=\"/document/9975799/all-figures\" class=\"all\">Show All</a></p></div></p><div class=\"section_2\" id=\"sec4b2a\"><h5>a: AR/VR/MR</h5><p>Augmented reality (AR) can be said as an upgrade version of the real world which can be achieved by stimulating digital visual elements and sensors <a ref-type=\"bibr\" anchor=\"ref78\" id=\"context_ref_78_4b2a\">[78]</a>. Virtual reality is the application of computer technology that allows the user to have an experience of a 3D world <a ref-type=\"bibr\" anchor=\"ref79\" id=\"context_ref_79_4b2a\">[79]</a>. Mixed reality is the mixed version of the physical world and digital content <a ref-type=\"bibr\" anchor=\"ref80\" id=\"context_ref_80_4b2a\">[80]</a>. By using this equipment, an exact physical reality can be made in which a person can have real feelings by using different types of sensors <a ref-type=\"bibr\" anchor=\"ref81\" id=\"context_ref_81_4b2a\">[81]</a>. So this technology will help the doctor to have a perfect visual delineation of the patient’s digital twin.</p></div><div class=\"section_2\" id=\"sec4b2b\"><h5>b: Robotics Apparatus</h5><p>Robots are basically programmable and compatible machines that can be created according to requirements. Nowadays there are a lot of robots are created and used in many sectors according to the required systems. In the surgical sector, robots have so many applications also. There are basically two types of robots in this sector. One type of robot will follow the commands given by the doctors or experts and another type of robot can take necessary steps according to the instructions which are programmed previously into the robot <a ref-type=\"bibr\" anchor=\"ref82\" id=\"context_ref_82_4b2b\">[82]</a>. Accuracy and efficiency can be increased by using robots in the surgical sector. Da Vinci surgical system is the most used robot. Besides it, robotics arms, xenex germ-zapping robots, Paro therapeutic robots, the cyberknife, etc are also used for surgery <a ref-type=\"bibr\" anchor=\"ref83\" id=\"context_ref_83_4b2b\">[83]</a>.</p></div><div class=\"section_2\" id=\"sec4b2c\"><h5>c: Surgical Machines</h5><p>There is some kind of machines and machine tool which is already used in surgical sectors. Some of these are designed for general purposes whereas others are made for a specific purpose. These can be divided into five parts. They are cutting instruments, holding instruments, hemostatic instruments, retractor,s and tissue unifying instruments <a ref-type=\"bibr\" anchor=\"ref84\" id=\"context_ref_84_4b2c\">[84]</a>. Now revolutionary changes are taken into them to make them more advanced. So the machines can perform specific operations more accurately and perfectly for the surgery. For example endoscopes, fetoscopes, gonioscopes, gamma cameras, etc. are already used in this sector. Then robots are also can be connected to these machines for better outcomes <a ref-type=\"bibr\" anchor=\"ref85\" id=\"context_ref_85_4b2c\">[85]</a>.</p></div></div><div class=\"section_2\" id=\"sec4b3\"><h4>3) Communication Infrastructure</h4><p>After receiving the digital twin of the patient by the IoRT, the doctor will see this via advanced equipment. Then he will start his premise about the twin and he will give his treatment <a ref-type=\"bibr\" anchor=\"ref86\" id=\"context_ref_86_4b3\">[86]</a>. This process can be divided into two parts. They are given below:</p><div class=\"section_2\" id=\"sec4b3a\"><h5>a: Body Signal Processing and Recognition</h5><p>First of all, a normal human digital twin will be created which it will be set as a stander form for the diagnosis process. The doctor will have an exact visual representation of the patient through the digital twin by using AR, VR, and MR technology. So he can have an idea about the patient’s disease for treatment <a ref-type=\"bibr\" anchor=\"ref87\" id=\"context_ref_87_4b3a\">[87]</a>. On the other hand, if a doctor’s twin is used then this doctor’s twin will compare the standard twin of a human body which is already given to it previously with the patient’s twin. By comparison between them, errors will be found. These errors are mainly the disease of the patient. So this will be the imposed process of identifying the disease of any patient <a ref-type=\"bibr\" anchor=\"ref88\" id=\"context_ref_88_4b3a\">[88]</a>.</p></div><div class=\"section_2\" id=\"sec4b3b\"><h5>b: Identity Modeling, Authentication, and Resolution</h5><p>After seeing any errors in the digital twin of the patient, the doctor will start to diagnose and if the doctor’s twin is used then it also starts to test according to the commands which are already given to it by programmed. This is the normal process that generally happened in real life. But using this technique, a normal patient can connect to a specialized doctor from far away and can take better surgical treatment. So, good surgical ministration can be spread all over the world <a ref-type=\"bibr\" anchor=\"ref89\" id=\"context_ref_89_4b3b\">[89]</a>.</p></div></div><div class=\"section_2\" id=\"sec4b4\"><h4>4) Connectivity Equipment</h4><div class=\"section_2\" id=\"sec4b4a\"><h5>a: Nanotechnology</h5><p>Nanotechnology is a necessary component in the surgical sector based on DTw and IoRT. Using traditional surgical technology, diseased tissue is found, and then inject necessary medicines to locate the disease. Nanotechnology improvement combines necessary medicines and imaging techniques to identify illness even at the single cell level <a ref-type=\"bibr\" anchor=\"ref20\" id=\"context_ref_20_4b4a\">[20]</a>. Specific detection of tumor tissues is made possible by nanotechnology. Also enable the detection of the tumor cells, the location of a growing tumor, and the location of the inflammation. Early malignant tissue treatment without damaging healthy, normal tissues is also a vital issue in nanotechnology treatment. traditional technology can’t give us this level of advancement. With the help of DTw and IoRT, we can collect all the necessary data from the patient for a nanotechnology treatment. With the help of surgical implants and tissue engineering, nanotechnology has significantly impacted all surgical procedures such that: optical nanosurgery, surgical oncology, thoracic, artificial heart, glaucoma, etc. the IoRT related surgical tools used in nanotechnology are: Surgical blades made with diamond nanolayers, Nanoneedles, nano-fabricated drain, etc. <a ref-type=\"bibr\" anchor=\"ref90\" id=\"context_ref_90_4b4a\">[90]</a>.</p></div><div class=\"section_2\" id=\"sec4b4b\"><h5>b: Network and Communication</h5><p>Another important point of equipment manufacturing is network and communication. Hospitals and other medical facilities use conventional or unconventional infrastructure called network and communication systems to fulfill their communication requirements. Patients want to send messages about their health and treatment and then the systems manage interactions between doctors and patients and limit the discussions that can occur among them. <a ref-type=\"table\" anchor=\"table4\" class=\"fulltext-link\">Table 4</a> are discussed the characteristics including types, equipment, communication system, and data about the role of networking and communication in the future surgical sector. All of these are components of a network and communication system. The data collected by DTw are restored in this system and help IoRT surgical procedures. Here we can see in <a ref-type=\"fig\" anchor=\"fig7\" class=\"fulltext-link\">figure 7</a> the advantages of the latest communication system to ensure safety in healthcare. It is useful to divide communication tasks throughout the healthcare system. The line of communication separating community-based primary care providers from hospital-based health services, Agents, communication policies, communication devices, and security protocols are all components of communication systems. Highly specialized knowledge must occasionally be shared over considerable distances between hospitals. Such that transportability, non-modern communication, intra-hospital communication, and inter-hospital communication <a ref-type=\"bibr\" anchor=\"ref91\" id=\"context_ref_91_4b4b\">[91]</a>.<div class=\"figure figure-full table\" id=\"table4\"><div class=\"figcaption\"><b class=\"title\">TABLE 4 </b>\nCommunication is characterized by different aspects over time or distance and ways of communication.</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee.t4-3227644-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee.t4-3227644-small.gif\" alt=\"Table 4- &#10;Communication is characterized by different aspects over time or distance and ways of communication.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div>\n<div class=\"figure figure-full\" id=\"fig7\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee7-3227644-large.gif\" data-fig-id=\"fig7\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee7-3227644-small.gif\" alt=\"FIGURE 7. - Traditional vs advanced communication system in future surgical sector.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 7. </b><fig><p>Traditional vs advanced communication system in future surgical sector.</p></fig></div><p class=\"links\"><a href=\"/document/9975799/all-figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec4b4c\"><h5>c: Cloud Computing</h5><p>Cloud computing in the health care and the surgical sector is a modern panorama <a ref-type=\"bibr\" anchor=\"ref92\" id=\"context_ref_92_4b4c\">[92]</a>. The healthcare sector is one of the most advanced in the implementation and adaption of new technologies like IoRT, digital twin technology, cloud computing, etc. They are very much beneficial for analyzing images and reports to extract information from genetic and clinical data. IoRT and DTw integrated with cloud computing open a new approach to perception in the surgical domain and this fusion helps physicians to diagnose various diseases with great accuracy <a ref-type=\"bibr\" anchor=\"ref93\" id=\"context_ref_93_4b4c\">[93]</a>. This system is called a cloud computing-based diagnosis system. Data transmission and communication processes in healthcare are experiencing massive development. Technological concepts and e-services are developed constantly, from e-communications in healthcare to e-care. E-Health is a representation of the potential of information and communication technology to advance both patient care and overall health <a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_4b4c\">[70]</a>. The patient and the healthcare providers will all be affected by this fundamental transformation, which will alter how healthcare is delivered.</p><p>As we stated earlier, telemedicine is an important part of the e-health domain. Cloud-based telemedicine for health care focuses on identifying important medical needs, combining them with needy patients with telemedicine, improving the efficiency of surgeries, and strictly following the safety measures <a ref-type=\"bibr\" anchor=\"ref94\" id=\"context_ref_94_4b4c\">[94]</a>. Telemedicine also can treat a group of patients with similar problems can be treated together. Moreover secure virtual consultations, chatbots, and remote monitoring can reduce the pressure <a ref-type=\"bibr\" anchor=\"ref95\" id=\"context_ref_95_4b4c\">[95]</a>. Another important part of this sector is monitoring remote patients at post-ops as some injuries are very serious and there are high chances of infections. For this, a professional physician is there for any need. But in many cases, that’s not possible as the hospital has limited resources and manpower. For these emails, video conferencing, and sometimes limited phone calls are very helpful. Cloud computing helps in that matter <a ref-type=\"bibr\" anchor=\"ref96\" id=\"context_ref_96_4b4c\">[96]</a>.</p></div><div class=\"section_2\" id=\"sec4b4d\"><h5>d: Artificial Intelligence (AI)</h5><p>The last piece of equipment in this section is artificial intelligence (AIn). As a modern technology artificial intelligence is gaining popularity and importance in a variety of sectors. One of them is the medical sector, especially the surgical sector. The algorithm and deep machine learning used in AIn with IoRT have been accepted by clinical physicians for clinical usage. By monitoring clinical procedures, communication patterns, and mistakes that went undetected during a treatment, AIn is already being used in various areas that require quality improvement. The main goal of AIn solutions in the surgical sector is to improve clinical decision-making <a ref-type=\"bibr\" anchor=\"ref97\" id=\"context_ref_97_4b4d\">[97]</a>. The adoption of AIn-based technologies with IoRT by doctors may help them make better treatment decisions, diagnose patients earlier and more accurately, and assess possible complications. These tools appear to be especially helpful when doctors are asked to make quick decisions in difficult situations. <a ref-type=\"fig\" anchor=\"fig8\" class=\"fulltext-link\">Fig. 8</a> elaborates the purpose and capacity of artificial intelligence in surgical procedures with uncertainty. The purpose was to take advice from the previous data collected by DTw and use them on AI-based tools IoRT in surgical practice while also analyzing their possibilities. Additionally, it was required to assess any possible impact that such a technology would have on doctors, other clinicians, and patients. Limiting pre-operative difficulties, lowering hospital issues, and promoting recovery are some of the benefits of AI in the surgical sector. it can also be said that a smartphone device can help in decision-making while providing all with fact-based and practical outcomes, facilitating the best surgical outcomes which are cooperative and adaptable as per the patient’s requests <a ref-type=\"bibr\" anchor=\"ref98\" id=\"context_ref_98_4b4d\">[98]</a>.\n<div class=\"figure figure-full\" id=\"fig8\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee8-3227644-large.gif\" data-fig-id=\"fig8\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee8-3227644-small.gif\" alt=\"FIGURE 8. - Prologue of artificial intelligence in the future surgical sector.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 8. </b><fig><p>Prologue of artificial intelligence in the future surgical sector.</p></fig></div><p class=\"links\"><a href=\"/document/9975799/all-figures\" class=\"all\">Show All</a></p></div></p></div></div><div class=\"section_2\" id=\"sec4b5\"><h4>5) Health Monitoring</h4><div class=\"section_2\" id=\"sec4b5a\"><h5>a: Security and Privacy</h5><p>Privacy and security issues have constantly been important in the medical and surgical fields <a ref-type=\"bibr\" anchor=\"ref93\" id=\"context_ref_93_4b5a\">[93]</a>. DTwT suggests a focus on content health care. By providing successful and equalizing development resources, this process has the potential to significantly benefit society. A new approach will lead to a high level of transparency of an individual’s physiological construction which also secure the patient’s security and privacy. Data about a person’s physiological structure can lead to moral differences, according to the expanding amount of information on diagnostics and genes <a ref-type=\"bibr\" anchor=\"ref99\" id=\"context_ref_99_4b5a\">[99]</a>. The concept of a “digital twin in health” (DTH) combines modern technology with complex medical simulation to provide accurate, precise, and beneficial medical services. Patients anticipate that healthcare professionals would maintain their personal information and keep it private. Similarly, IoRT-based healthcare systems must assure privacy while allowing for the exchange of data required to deliver high-quality treatment throughout the healthcare system. Sensors and surveillance may do the main security work. For many of the equipment used in a provided system, customized IoRT will gather types of information and keep the privacy accordingly and individually <a ref-type=\"bibr\" anchor=\"ref100\" id=\"context_ref_100_4b5a\">[100]</a>.</p></div><div class=\"section_2\" id=\"sec4b5b\"><h5>b: Hospital Management</h5><p>Hospital management is also a major issue in health monitoring. For a successful surgery based on IoRT and digital twin, a well-equipped and well-managed hospital or health care center are very crucial. Systems use IoRT devices to track data about people (such as patients, nurses, and family members) <a ref-type=\"bibr\" anchor=\"ref101\" id=\"context_ref_101_4b5b\">[101]</a>. Patient data collection is perhaps the area of IoRT and DTw in healthcare that is most evolved <a ref-type=\"bibr\" anchor=\"ref102\" id=\"context_ref_102_4b5b\">[102]</a>. By keeping an eye on different types of vital indicators or data uploaded by a telemetry tracking system medical staff can diagnose and begin treating infectious diseases, cancer, heart failure, etc. early <a ref-type=\"bibr\" anchor=\"ref57\" id=\"context_ref_57_4b5b\">[57]</a>. Along with patient treatment, DTH may be utilized for clinic management and design. Another important point is that good and efficient caregivers for handling critical patients. Before scheduling and carrying out actual modifications, various methods, such as scheduling beds and a team of staff, may be evaluated in a digital environment using DTH. A clinical team of employees may easily manage and plan their activity without DTH based on their discipline, understanding, and fundamental analysis; nevertheless, using a virtual pair reduces the risk and saves money <a ref-type=\"bibr\" anchor=\"ref103\" id=\"context_ref_103_4b5b\">[103]</a>.</p></div><div class=\"section_2\" id=\"sec4b5c\"><h5>c: Drug Management</h5><p>Drug management is one of the most important perspectives of this sector. According to some approaches, “health” is described as a group of patterns that are reliable for a specific user against the context of patterns seen in the community. DTw offers a conceptual framework to evaluate this new information on health care and its logical and moral significance for treatment, access to care, and human betterment <a ref-type=\"bibr\" anchor=\"ref104\" id=\"context_ref_104_4b5c\">[104]</a>. The use of personalized medicine for a person to find differences from the ordinary aspect is also a part of drug management. We use mainly DTw as a hypothesis where one would have access to highly precise data on a person. A similar approach will also influence what is termed therapeutic and what is an improvement. Also, telemetry tracking devices can automatically detect, communicate and upload blood pressure, urine output, and other data and according to these data a sequential drug management map <a ref-type=\"bibr\" anchor=\"ref54\" id=\"context_ref_54_4b5c\">[54]</a>.</p></div><div class=\"section_2\" id=\"sec4b5d\"><h5>d: Patient Safety</h5><p>The last but not least important factor is patient safety. Patient Safety is currently a very crucial issue in health. Highly developed computer simulations of patients, driven by huge quantities of bio-data of the patient would lead to more precise and successful surgical procedures. Eventually, this may lead to the development of a “virtual patient”. Digital models now even provide the opportunity of adjusting treatment to the predicted response of individual patients instead of basing treatments on the responses of the normal individual <a ref-type=\"bibr\" anchor=\"ref105\" id=\"context_ref_105_4b5d\">[105]</a>. These models can account for various factors including age, way of life, and genetic background. If such “virtual patients” are truly made available, they will raise the standard of medical care <a ref-type=\"bibr\" anchor=\"ref106\" id=\"context_ref_106_4b5d\">[106]</a>. Therefore, digital twins offer a concept to analyze the impact of important principles in current discussions about health care, such as health, sickness, and prevention. This statement demands significant improvements in health, a reduction in healthcare costs, and therefore more self-efficacy over our nature. Therefore, utilizing digital twins won’t just result in better quantitative aspects of health and sickness. A conceptual shift in how we think about the difference between health and sickness results from the way that DTw reflects individual status and enables transparent comparisons of these individuals <a ref-type=\"bibr\" anchor=\"ref107\" id=\"context_ref_107_4b5d\">[107]</a>.</p></div></div></div></div>\n<div class=\"section\" id=\"sec5\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION V.</div><h2>Opportunities</h2></div><p>Science is now triumphant in every sector of our life. It just makes our life more and more comfortable and easier. The surgery sector is also a part of this development. Every day new inventions are added to this sector which makes this sector stronger.V-C1 IoRT collaboration with DTwT will also bring in opportunities to this sector which will make this sector more advanced. These opportunities will be discussed below in <a ref-type=\"fig\" anchor=\"fig9\" class=\"fulltext-link\">fig 9</a>:\n<div class=\"figure figure-full\" id=\"fig9\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee9-3227644-large.gif\" data-fig-id=\"fig9\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee9-3227644-small.gif\" alt=\"FIGURE 9. - Opportunities of IoRT collaborated DTwT in the Future surgical sector.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 9. </b><fig><p>Opportunities of IoRT collaborated DTwT in the Future surgical sector.</p></fig></div><p class=\"links\"><a href=\"/document/9975799/all-figures\" class=\"all\">Show All</a></p></div></p><div class=\"section_2\" id=\"sec5a\"><h3>A. Smart Doctor Assistance Point of View</h3><p>From the covid situation, we understand that manpower is a very big issue in the medical sector <a ref-type=\"bibr\" anchor=\"ref108\" id=\"context_ref_108_5a\">[108]</a>. Generally, the world doesn’t have enough doctors and nurses. As a result, many people die without proper treatment. But in IoRT collaborating with DTwT robots will do basic work. As a result, the world can overcome this manpower problem. Besides this, this technology will have other facilities also. Like:</p><div class=\"section_2\" id=\"sec5a1\"><h4>1) Diagnostic Accuracy</h4><p>In IoRT robots will do all the work. Surgeons will see the exact visualized twin of the patients by using DTwT. Because high sensing sensors will be used in this technology and then he will give treatment by robots. So, this technology will have more accuracy and efficiency. Also, operations will have robustness <a ref-type=\"bibr\" anchor=\"ref109\" id=\"context_ref_109_5a1\">[109]</a>.</p></div><div class=\"section_2\" id=\"sec5a2\"><h4>2) Improvement in Physician’s Efficiency</h4><p>Another problem is the lack of skilled surgeons. Countries like ours don’t have a good educational background. For this reason, students generally don’t have higher education in the surgery sector. As a result, there are not enough expert surgeons for our people. So, inefficient surgeons do the operation works which is more dangerous. But we can solve these problems by using the technology in which IoRT and DTwT are used. Because doctors or surgeons can see a patient from far away with this technology. So, people from any country in the world will be able to talk to any skilled surgeon about their problems and can take treatments through IoRT and DTwT.</p></div></div><div class=\"section_2\" id=\"sec5b\"><h3>B. Advancing Surgical Equipment Point of View</h3><p>In IoRT collaboration with DTwT, advanced equipment will be used. This equipment has accuracy and efficiency. This advanced equipment will make this technology more powerful.</p><div class=\"section_2\" id=\"sec5b1\"><h4>1) Safe Operation Environment</h4><p>Robots will do the operation with this technology. Robots will do these according to the input which will be given to them. There will be no human touch in this technology. We all know that humans can do mistakes but robots generally don’t do mistakes. As a result, this technology will offer a more safe operational environment to the people <a ref-type=\"bibr\" anchor=\"ref110\" id=\"context_ref_110_5b1\">[110]</a>.</p></div><div class=\"section_2\" id=\"sec5b2\"><h4>2) High Efficiency and Accuracy</h4><p>Highly sensitive sensors and robots will be used in this technology where IoRT and DTwT will be used. For this reason, the necessary work will be done more accurately and correctly. Ar, MR, VR, etc will be used in this technology. So, the visualization of the patients will be more realistic. This will help the doctor to give treatment more easily. For, these reasons, this technology will have more efficiency and accuracy.</p></div></div><div class=\"section_2\" id=\"sec5c\"><h3>C. Communication Infrastructure Point of View</h3><p>Communication infrastructure is one of the most important prospects in the future surgical domain. It can be categorized into two sectors. One is body Signal Processing and Recognition and another is identity Modeling, Authentication, and Resolution. A normal human digital twin will be created by DTwT which it will be set as a standard form for the diagnosis process. The doctor will have an exact visual representation of the patient through the digital twin by using different types of IoRT technology <a ref-type=\"bibr\" anchor=\"ref111\" id=\"context_ref_111_5c\">[111]</a>. Comparing them, the doctors will find the disease. So we can say via DTwT that the proper body signal can be processed, the doctors then identify the model by comparing it with a perfect body twin, recognizing and authenticating the disease. so there are many opportunities in this prospect <a ref-type=\"bibr\" anchor=\"ref112\" id=\"context_ref_112_5c\">[112]</a>. Some of them are:</p><div class=\"section_2\" id=\"sec5c1\"><h4>1) Improve Access</h4><p>We can easily access all the data of any patient as it is already stored in a hospital database. It will be improved after every checkup or test so the data will be up to date. Any physicians who treat the patient have access to all the data and through this, they can diagnose any kind of problem in it <a ref-type=\"bibr\" anchor=\"ref113\" id=\"context_ref_113_5c1\">[113]</a>.</p></div><div class=\"section_2\" id=\"sec5c2\"><h4>2) Increase Quality</h4><p>It also increases the quality of the treatment and surgical procedure. As the disease is diagnosed precisely and promptly, the success rate of any surgical procedure is very high. Moreover, the digital twin of the physicians will perform the surgical procedure so the accuracy is high <a ref-type=\"bibr\" anchor=\"ref114\" id=\"context_ref_114_5c2\">[114]</a>.</p></div><div class=\"section_2\" id=\"sec5c3\"><h4>3) Improve Rich Factor Identification</h4><p>The rich factor refers to the ratio of the number of DEGs to the number of total annotated genes in certain pathways. It is a very important factor for any genetic disease. IoRT-based DTwT will also help us to identify the factors and taking decisions.</p></div></div><div class=\"section_2\" id=\"sec5d\"><h3>D. Connectivity Equipment Point of View</h3><p>Our review paper is based on the IoRT collaboration with DTwT for future surgical sectors. For DTwT and IoRT we need the advanced equipment to connect them with the system as well as the patients. Some of them are i. Nanotechnology; ii. Network and Communication; iii. Cloud Computing; iv. Artificial Intelligence (AIn). This equipment will help to connect the physical body with its digital twin of it and help the physicians to treat the patients. The opportunities we can get from it will be:</p><div class=\"section_2\" id=\"sec5d1\"><h4>1) Improved Communication</h4><p>The advanced and modern equipment will help to connect with the patients. That will improve the communication between them. The improvement of the equipment combines necessary medicines and imaging techniques to identify illness even at the single cell level and cure the disease.</p></div><div class=\"section_2\" id=\"sec5d2\"><h4>2) Save Time and Resources</h4><p>The equipment will save time and resources as the data have as of now been saved in the database. The physicians access the data, gathered information about the patients, and find out the problems easily. This will help to diagnose diseases precisely.</p></div><div class=\"section_2\" id=\"sec5d3\"><h4>3) Increase Reliability of Equipment</h4><p>The reliability of the equipment is very essential. The interconnection between the equipment will help to conduct the surgical procedure more efficiently. So it saves a life or avoids any life-threatening incidents.</p></div></div><div class=\"section_2\" id=\"sec5e\"><h3>E. Health Monitoring Point of View</h3><p>The final prospect of it is health monitoring. Health monitoring is basically for the patients to create a safe environment, better treatment facilities, and better care, and medicine. It also secures security and privacy, helping to manage the hospitals and the safety of the patients. So the sectors are i. Security and Privacy; ii. Hospital management; iii. Drug Management; iv. Patient Safety <a ref-type=\"bibr\" anchor=\"ref115\" id=\"context_ref_115_5e\">[115]</a>. The opportunities we get from this prospect are:</p><div class=\"section_2\" id=\"sec5e1\"><h4>1) Better Privacy and Security</h4><p>Safety and security are the most pivotal factors for any patient. As we know that all the data regarding personal or physical information are collected in the database of a hospital for creating twins, privacy is at risk. Sensors and surveillance may do the main security work. Many of the equipment used in a provided system, customized IoRT will gather types of information and keep the privacy accordingly and individually <a ref-type=\"bibr\" anchor=\"ref116\" id=\"context_ref_116_5e1\">[116]</a>.</p></div><div class=\"section_2\" id=\"sec5e2\"><h4>2) Better Patient Care</h4><p>DTwT will create the concept of a “digital twin in health” (DTH) which combines modern technology with complex medical simulation to provide accurate, precise, and beneficial medical services. It helps a better environment for the patients after surgery and develops safe post-operative care. Also, skilled caregivers can take care of the patients more effectively <a ref-type=\"bibr\" anchor=\"ref117\" id=\"context_ref_117_5e2\">[117]</a>.</p></div><div class=\"section_2\" id=\"sec5e3\"><h4>3) Better Precautionary Maintenance</h4><p>Precaution is vital in any healthcare system, especially for patients who have undergone surgery recently. Any kind of infection for them will be life-threatening. IoRT-based DTwT creates a better and more secure section for patients according to their surgeries and prescribed treatment. Also, the database will help the management to be ready for any emergencies like blood loss, organ transplant, tissue recreation, medicine, allergic reaction, etc. also precautions can be taken for individuals as we can easily access their data. Furthermore, recently we have been in a grieving situation of the pandemic of COVID SARS virus. It’s very infectious as it can spread through the air. So isolation for the patients affected by COVID was crucial. An isolated ward was created, and oxygen cylinders, ICUs, and plasma are arranged and reserved for the critical patients. All this can be done easily by the IoRT-based database <a ref-type=\"bibr\" anchor=\"ref118\" id=\"context_ref_118_5e3\">[118]</a>.</p></div></div><div class=\"section_2\" id=\"sec5f\"><h3>F. Sustainability</h3><p>Environmental, Social, and Governance is the abbreviation for ESG which is being able to produce a more sustainable society and a better environment for the human being. Improving citizen welfare by emphasizing health, education, and environmental preservation is the core tenet of ESG to encourage social cohesiveness, lessen inequality, and shield weaker groups and people. On the other hand, the term sustainability refers to achieving goals without affecting the capacity of coming generations. There is a total of 17 goals of ESG. Among them, this study of this paper targets some of the important goals of ESG, particularly goals 3, 5, 9, 11 and 13. In this work, a new technological framework combining DTwT and IoRT (Goal 9) is developed for ensuring a better surgical experience from all aspects <a ref-type=\"bibr\" anchor=\"ref119\" id=\"context_ref_119_5f\">[119]</a>. The sustainability model of the developed framework may assist in reframing how hospitals not only strive to improve patient health outcomes but also to support the economy, develop healthy communities, and improve the environment (Goal 3 5, and 11) <a ref-type=\"bibr\" anchor=\"ref120\" id=\"context_ref_120_5f\">[120]</a>.</p><p>Healthcare systems and medical wastes are the major reasons for environmental pollution occurring in the existing surgical system. This paper discusses the framework of combined DTwT and IoRT-based surgical systems which deals with modeling the environment-friendly mechanism (Goal 13) for surgical systems and comprehending how to cut emissions and the use of energy. These mentioned capabilities enable the developed framework to meet sustainability and climate goals. DTwT and IoRT-assisted surgical framework may also assist in lowering the expenses associated with using raw materials, product development, and reducing CO2 emissions from physical prototypes. The adoption of DTwT and IoRT in the broad medical and healthcare sector may initiate revolutionary change in terms of product creation, risk assessment, and sustainability. Any physician’s primary motivations are to save life and time. In comparison to conventional techniques, DTwT and IoRT enhanced by AI algorithms provided the possibility for extremely effective features with increased precision which is discussed in the paper thoroughly. Hence the developed framework presented in this paper is capable of meeting the sustainability goals.</p><p>Besides, the substantial impact of the achieved potential benefits/outcomes of the developed framework for the research field is briefly explained in the following way. \n<ul style=\"list-style-type:disc\"><li><p>The paper discussed a conceptual framework for the new surgical sector driven by IoRT collaborated DTwT framework which opens a new research platform for the implantation of emerging technology in surgical sectors. In this work, a study about the potential benefits of using advanced technologies like IoRT and DTwT in the surgical sector is studied which accelerates their application in the real-time surgical sector.</p></li><li><p>The surgical sector should be more modernized for a healthier population, avoiding excess time consumption and environmental pollution. This paper presents a solution to meet the medical service demand for a healthier population, and others by introducing some technical features which may require further investigation to properly integrate them into surgical sectors.</p></li><li><p>This paper also discusses traditional equipment which is currently used in the surgical sector. At the same time, the author explained the new versions of robots and communication techniques that can be used in the surgical sector. So, this paper unfurls research flown for this type of machinery also.</p></li></ul></p><p>This shouldn’t be a surprise to the mentioned advantages that the partnership between IoRT and DTwT has brought to surgical sectors in the near future. This paper explained how and why it should be considered DTwT and IoRT for future surgical fields. Self-tracking programs that help individuals live healthier lives and health monitoring systems that allow for remote treatment and may lessen the need for hospital visits were two examples of this type of technology. The developed framework claimed to continually update personalized models of individuals and their physiology through the measurement of various factors of a person’s health and lifestyle, as well as the treatment of patients who require it. It was elaborately discussed in below <a ref-type=\"table\" anchor=\"table5\" class=\"fulltext-link\">Table 5</a>.<div class=\"figure figure-full table\" id=\"table5\"><div class=\"figcaption\"><b class=\"title\">TABLE 5 </b>\nRelation between existing challenges and proposed solution presented in this paper.</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee.t5-3227644-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee.t5-3227644-small.gif\" alt=\"Table 5- &#10;Relation between existing challenges and proposed solution presented in this paper.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p></div></div>\n<div class=\"section\" id=\"sec6\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION VI.</div><h2>Integration Challenges</h2></div><p>Science has a big role in human life. Technology always made our life easier. With the help of this, we can lead a very happy, healthy, and better life. But in this journey, we have to face some problems. These problems are needed to be overcome. After that only, we will able to lead the exact life which we want for us. In this particular technology, we will also face problems that can be divided into 2 sectors. The sectors of the problems are discussed below:</p><div class=\"section_2\" id=\"sec6a\"><h3>A. Economical Point of View</h3><p>Economy is a very important issue for us like third countries which don’t have that kind of economical support. We are not that stable to effort this kind of costly technique. The issues in this sector are given in <a ref-type=\"fig\" anchor=\"fig10\" class=\"fulltext-link\">fig 10</a>:\n<div class=\"figure figure-full\" id=\"fig10\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee10-3227644-large.gif\" data-fig-id=\"fig10\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee10-3227644-small.gif\" alt=\"FIGURE 10. - Challenges of IoRT collaborated DTwT in future surgical sector.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 10. </b><fig><p>Challenges of IoRT collaborated DTwT in future surgical sector.</p></fig></div><p class=\"links\"><a href=\"/document/9975799/all-figures\" class=\"all\">Show All</a></p></div></p><div class=\"section_2\" id=\"sec6a1\"><h4>1) Cost Issue</h4><p>Cost issue is a very big issue in IoRT system. IoRT is very costly for some reasons. The machines which are used in IoRT are very costly <a ref-type=\"bibr\" anchor=\"ref121\" id=\"context_ref_121_6a1\">[121]</a>. Then robots are used in IoRT. These are also costly equipment. The visual rendition which is given by the digital twin technology should be updated all the time. Because according to this, the system will be done. So, if the rendition is not updated then the system can’t be done successfully. For this reason, we should be careful about the process of interactivity between digital and physical things. Sensors and machines which are used in digital twin technology should have high proficiency, high accuracy <a ref-type=\"bibr\" anchor=\"ref122\" id=\"context_ref_122_6a1\">[122]</a>. So if there is a small change in real life, this technology can react without any delay <a ref-type=\"bibr\" anchor=\"ref123\" id=\"context_ref_123_6a1\">[123]</a>. Because delays in the reaction can be harmful to the particular system. So, we need to use very sensitive and effective sensors for digital twin technology. And the price of this sensor is very high <a ref-type=\"bibr\" anchor=\"ref124\" id=\"context_ref_124_6a1\">[124]</a>. These Sensors are also very costly. So, the overall cost of the combined technology becomes very high because of these.</p></div><div class=\"section_2\" id=\"sec6a2\"><h4>2) Production Issue</h4><p>This is the big and one of the main issues in the surgical sector. We don’t have enough equipment which is very important for surgery. Another problem is that the cost of this equipment is very high. For this reason, rural people often can’t have the basic treatment for their life. On the other hand, the world’s population is increasing day by day. But the number of operation theatre is not increased according to this. So to overcome this problem, we need to increase the production rate. If we can make more surgical equipment then the cost of this equipment will be decreased soon <a ref-type=\"bibr\" anchor=\"ref125\" id=\"context_ref_125_6a2\">[125]</a>. Then we have to build more hospitals and clinics. So that rural people can take necessary treatment easily.</p></div><div class=\"section_2\" id=\"sec6a3\"><h4>3) Salary Issue of Surgeons</h4><p>According to a survey there is only 4 surgeons for 1000 people. This number is very poor. In the COVID pandemic situation, we all see that many people die without any proper treatment. Because surgeons do a lot of hard work. They always work under physical and mental pressure. But they don’t have a fair salary according to their hard work. For this reason, we need to make sure that, they will have a fair salary that will justify their hard work. Second thing is that there are so many brilliant students who can’t continue their education for money purposes. We need to arrange scholarships and diplomas or nursing courses for these students. Through this, the number of nurses and surgeons can be increased which will help to have proper treatment at a cheap cost.</p></div><div class=\"section_2\" id=\"sec6a4\"><h4>4) Transportation Issue</h4><p>Another big problem for the economic sector is trash transportation. Every day, a huge number of trashes comes out from the surgery sector. We all know medical trash doesn’t mix with soil. Rather this trash affect nature. So, it is a big issue to transport it to the right destination and a lot of money is spent in this sector.</p></div></div><div class=\"section_2\" id=\"sec6b\"><h3>B. Technical Point of View</h3><p>There are some integration challenges in terms of the technical sector as shown in <a ref-type=\"fig\" anchor=\"fig10\" class=\"fulltext-link\">Fig 10b</a> and discussed as follows;</p><div class=\"section_2\" id=\"sec6b1\"><h4>1) Data Issue</h4><p>IoRT has all kinds of information about that particular subject which is needed to do that job successfully <a ref-type=\"bibr\" anchor=\"ref126\" id=\"context_ref_126_6b1\">[126]</a>. For example, in the health sector, IoRT will have all the sensitive information about the body <a ref-type=\"bibr\" anchor=\"ref127\" id=\"context_ref_127_6b1\">[127]</a>. On the other hand, digital twin involves cloud computing <a ref-type=\"bibr\" anchor=\"ref128\" id=\"context_ref_128_6b1\">[128]</a>. So it should be truest worthy because the whole information about a human body is transferred by this <a ref-type=\"bibr\" anchor=\"ref129\" id=\"context_ref_129_6b1\">[129]</a>. Otherwise, we can face some security challenges <a ref-type=\"bibr\" anchor=\"ref62\" id=\"context_ref_62_6b1\">[62]</a>. If this information gets leaked, it will be trouble full for that man <a ref-type=\"bibr\" anchor=\"ref130\" id=\"context_ref_130_6b1\">[130]</a>. This kind of leakage can be done for so many reasons <a ref-type=\"bibr\" anchor=\"ref131\" id=\"context_ref_131_6b1\">[131]</a>. Like as,</p><div class=\"section_2\" id=\"sec6b1a\"><h5>a: Poor Password</h5><p>These devices have internet connection <a ref-type=\"bibr\" anchor=\"ref132\" id=\"context_ref_132_6b1a\">[132]</a>. If these devices’ password is not that kind of strong then anyone can hack them which will definitely be a big problem <a ref-type=\"bibr\" anchor=\"ref133\" id=\"context_ref_133_6b1a\">[133]</a>.</p></div><div class=\"section_2\" id=\"sec6b1b\"><h5>b: Access Ability</h5><p>For a specific sector, specific people should have access ability <a ref-type=\"bibr\" anchor=\"ref134\" id=\"context_ref_134_6b1b\">[134]</a>. Otherwise, it will be very difficult to maintain privacy for that sector <a ref-type=\"bibr\" anchor=\"ref135\" id=\"context_ref_135_6b1b\">[135]</a>.</p></div><div class=\"section_2\" id=\"sec6b1c\"><h5>c: Data Convolution</h5><p>These machines and devices need to collect more information and give it to the right destination. Sometimes it becomes more complex to maintain the process without any errors <a ref-type=\"bibr\" anchor=\"ref136\" id=\"context_ref_136_6b1c\">[136]</a>.</p></div></div><div class=\"section_2\" id=\"sec6b2\"><h4>2) Network Issue</h4><p>Another big issue in this technology is a network issue. In IoRT and DTwT, information needs to send by cloud computing. So the network system should be very strong. On the other hand, network speed should be very fast. Now we live in the 5G generation. But for smooth IoRT results, we need to advance it. This will also increase the cost.</p></div><div class=\"section_2\" id=\"sec6b3\"><h4>3) Precise Description Issue</h4><p>Digital twin needs to give a very precise description of the system. <a ref-type=\"bibr\" anchor=\"ref137\" id=\"context_ref_137_6b3\">[137]</a>. There can’t be any error. If there is a little error in this description, it will destroy the whole system. So we can’t do the work successfully <a ref-type=\"bibr\" anchor=\"ref138\" id=\"context_ref_138_6b3\">[138]</a>.</p></div><div class=\"section_2\" id=\"sec6b4\"><h4>4) Globalization Issue</h4><p>Nowadays thousands of devices are connected to the internet. And this number is growing day by day. In the next years, this number will be more and more. IoRT system is fully dependent on this. So, it can be assumed that we can face connection issues. For this, we have to establish a strong server system all over the world <a ref-type=\"bibr\" anchor=\"ref126\" id=\"context_ref_126_6b4\">[126]</a>.</p></div><div class=\"section_2\" id=\"sec6b5\"><h4>5) Software Issue</h4><p>To combine both IoRT and digital twin technology we need to focus on new types of software which can combine these two <a ref-type=\"bibr\" anchor=\"ref139\" id=\"context_ref_139_6b5\">[139]</a>. With this software, we will be able to work for both IoRT and digital twin technology. So, this software will be more difficult and complex.</p></div></div></div>\n<div class=\"section\" id=\"sec7\"><div class=\"header article-hdr\"><div class=\"kicker\">\n\t\t                        SECTION VII.</div><h2>Conclusion</h2></div><p>This paper thoroughly focuses on the IoRT collaborative DTwT-driven future surgical sector. A study about the potential strength and weaknesses of this combined technology in the case of surgical paradigm was also highlighted in <a ref-type=\"table\" anchor=\"table6\" class=\"fulltext-link\">Table 6</a>. This study also explored some critical issues shown in the existing surgical sectors and discussed how the developed framework combined with IoRT and DTwT solved them. This was done by enabling some advanced technical features of IoRT and DTwT in the surgical domain. Here, the extended features of IoRT give an environment in which robots can take data from real life and analysis them properly to take the necessary steps to do the work successfully according to the requirements. People can also control these robots via the internet from far away. On the other hand, digital twin technology makes an exact visual twin of a human body by using sensors and necessary machines. By collaborating with these two, a new brunch of technology can be made which may have more advanced and modern technology. In this paper, the author explained this technology distinctly with the necessary things as a way out which may make human life more comfortable.<div class=\"figure figure-full table\" id=\"table6\"><div class=\"figcaption\"><b class=\"title\">TABLE 6 </b>\nStrength and weakness of the developed framework driven future surgical sectors in terms of different prospects.</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee.t6-3227644-large.gif\"><img src=\"/mediastore_new/IEEE/content/media/6287639/9668973/9975799/muyee.t6-3227644-small.gif\" alt=\"Table 6- &#10;Strength and weakness of the developed framework driven future surgical sectors in terms of different prospects.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p><p>As a layout, the main process was discussed in the paper. First using this technology, a digital twin of the patient will be created. Then it will send to the doctor by using the IoRT. When the doctor will receive the twin, he will analyze and give treatment through the IoRT. People can also do vice versa. It also can be used by the doctor’s twin who will give treatment to the patient by using IoRT. This technology will be able to offer a better and safe surgery sector. It is also beneficial for the sustainability aspect with more potential benefits such as (i) environmentally friendly processes, (ii) improving social cohesiveness, (iii) lessening inequality, (iv) minimizing medical waste which is the reason for environmental pollution, (v) perform more precious, accurate, and effective analysis (vi) improve patient health as well as the economy and can save time and money. By enabling this new method in the surgical domain, people from any side of the world can take treatment from a skilled surgeon. Developing countries like Bangladesh can have preferable treatment from the other side of the world. Additionally, this technology may offer a reliable solution during the pandemic situation also. This study also highlighted some challenges that may arise during the adaption of this technology which may provide extended support for researchers to add their deep insight into this arena.</p></div>\n</div></div></response>\n"
}